#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AfterImageMesh

#include "Basic.hpp"


namespace SDK::Params
{

// Function AfterImageMesh.AfterImageMesh_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct AfterImageMesh_C_Initialize final
{
public:
	class UObject*                                bpp__OwnerObject__pf;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AfterImageMesh_C_Initialize;

// Function AfterImageMesh.AfterImageMesh_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AfterImageMesh_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AfterImageMesh_C_ReceiveTick;

// Function AfterImageMesh.AfterImageMesh_C.SetSkeletalMeshinfo
// 0x0020 (0x0020 - 0x0000)
struct AfterImageMesh_C_SetSkeletalMeshinfo final
{
public:
	class USkeletalMesh*                          bpp__SkeletalMesh__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 bpp__AnimInstanceClass__pf;                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     bpp__OptionalReplacementMaterial__pf;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AfterImageMesh_C_SetSkeletalMeshinfo;

// Function AfterImageMesh.AfterImageMesh_C.StartAfterImage
// 0x0008 (0x0008 - 0x0000)
struct AfterImageMesh_C_StartAfterImage final
{
public:
	float                                         bpp__Time__pf;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AfterImageMesh_C_StartAfterImage;

}

