#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: APB_Bag01

#include "Basic.hpp"


namespace SDK::Params
{

// Function APB_Bag01.APB_Bag01_C.ExecuteUbergraph_APB_Bag01
// 0x0008 (0x0008 - 0x0000)
struct APB_Bag01_C_ExecuteUbergraph_APB_Bag01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWildCardInt_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWildCardInt_ReturnValue1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWildCardInt_ReturnValue2;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWildCardInt_ReturnValue3;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_APB_Bag01_C_ExecuteUbergraph_APB_Bag01;

}

