#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveEquipmentDetail

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function ArchiveEquipmentDetail.ArchiveEquipmentDetail_C.ExecuteUbergraph_ArchiveEquipmentDetail
// 0x0008 (0x0008 - 0x0000)
struct ArchiveEquipmentDetail_C_ExecuteUbergraph_ArchiveEquipmentDetail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEquipmentDetail_C_ExecuteUbergraph_ArchiveEquipmentDetail;

// Function ArchiveEquipmentDetail.ArchiveEquipmentDetail_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ArchiveEquipmentDetail_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEquipmentDetail_C_PreConstruct;

// Function ArchiveEquipmentDetail.ArchiveEquipmentDetail_C.SetItemData
// 0x00F0 (0x00F0 - 0x0000)
struct ArchiveEquipmentDetail_C_SetItemData final
{
public:
	struct FPBItemCatalogData                     input_data;                                        // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FPBItemCatalogData                     itemData;                                          // 0x0078(0x0078)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEquipmentDetail_C_SetItemData;

}

