#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveDropitemListItem

#include "Basic.hpp"

#include "DropItemData_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ArchiveDropitemListItem.ArchiveDropitemListItem_C.ExecuteUbergraph_ArchiveDropitemListItem
// 0x0004 (0x0004 - 0x0000)
struct ArchiveDropitemListItem_C_ExecuteUbergraph_ArchiveDropitemListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveDropitemListItem_C_ExecuteUbergraph_ArchiveDropitemListItem;

// Function ArchiveDropitemListItem.ArchiveDropitemListItem_C.SetItemDropData
// 0x0038 (0x0038 - 0x0000)
struct ArchiveDropitemListItem_C_SetItemDropData final
{
public:
	struct FDropItemData                          input_data;                                        // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue1;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveDropitemListItem_C_SetItemDropData;

// Function ArchiveDropitemListItem.ArchiveDropitemListItem_C.SetDropItemName
// 0x00D0 (0x00D0 - 0x0000)
struct ArchiveDropitemListItem_C_SetDropItemName final
{
public:
	class FText                                   name_txt;                                          // 0x0000(0x0018)(Edit, BlueprintVisible)
	int32                                         Val;                                               // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0060(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveDropitemListItem_C_SetDropItemName;

// Function ArchiveDropitemListItem.ArchiveDropitemListItem_C.SetDropRate
// 0x0098 (0x0098 - 0x0000)
struct ArchiveDropitemListItem_C_SetDropRate final
{
public:
	class FText                                   rate_txt;                                          // 0x0000(0x0018)(Edit, BlueprintVisible)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0080(0x0018)()
};
DUMPER7_ASSERTS_ArchiveDropitemListItem_C_SetDropRate;

}

