#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveEnemyDetail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveEnemyDetail.ArchiveEnemyDetail_C
// 0x0150 (0x03A8 - 0x0258)
class UArchiveEnemyDetail_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArchiveDetailWindow_C*                 ArchiveDetailWindow;                               // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveEnemyAreaName_C*                EnemyAreaName;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveContentsBlock_C*                EnemyBusterNum;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveEnemyDropItem_C*                EnemyDropItem;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveContentsBlock_C*                EnemyName;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveEnemyResist_C*                  EnemyResist;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveEnemyStatus_C*                  EnemyStatus;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPBArchiveEnemyCatalogData             EnemyData;                                         // 0x0298(0x0110)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ArchiveEnemyDetail(int32 EntryPoint);
	void Construct();
	void Initialize();
	void SetEnemyArea();
	void SetEnemyBusterNum();
	void SetEnemyDropItem();
	void SetEnemyName();
	void SetEnemyResist();
	void SetEnemyStatus();
	void Setup();
	void UpdateEnemyDetail(const struct FPBArchiveEnemyCatalogData& input_data);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveEnemyDetail_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveEnemyDetail_C")
	}
	static class UArchiveEnemyDetail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveEnemyDetail_C>();
	}
};
DUMPER7_ASSERTS_UArchiveEnemyDetail_C;

}

