#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveTipsList

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function ArchiveTipsList.ArchiveTipsList_C.ExecuteUbergraph_ArchiveTipsList
// 0x0008 (0x0008 - 0x0000)
struct ArchiveTipsList_C_ExecuteUbergraph_ArchiveTipsList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveTipsList_C_ExecuteUbergraph_ArchiveTipsList;

// Function ArchiveTipsList.ArchiveTipsList_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ArchiveTipsList_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveTipsList_C_PreConstruct;

// Function ArchiveTipsList.ArchiveTipsList_C.SetDispCursor
// 0x0002 (0x0002 - 0x0000)
struct ArchiveTipsList_C_SetDispCursor final
{
public:
	bool                                          isEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsOn;                                              // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveTipsList_C_SetDispCursor;

// Function ArchiveTipsList.ArchiveTipsList_C.GetDescription
// 0x0010 (0x0010 - 0x0000)
struct ArchiveTipsList_C_GetDescription final
{
public:
	class FString                                 Description;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsList_C_GetDescription;

// Function ArchiveTipsList.ArchiveTipsList_C.SetListParam
// 0x0038 (0x0038 - 0x0000)
struct ArchiveTipsList_C_SetListParam final
{
public:
	struct FPBArchiveTipsCatalogData              input_data;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_ArchiveTipsList_C_SetListParam;

}

