#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveTopMenuItem

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ArchiveTopMenuItem.ArchiveTopMenuItem_C.ExecuteUbergraph_ArchiveTopMenuItem
// 0x0008 (0x0008 - 0x0000)
struct ArchiveTopMenuItem_C_ExecuteUbergraph_ArchiveTopMenuItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveTopMenuItem_C_ExecuteUbergraph_ArchiveTopMenuItem;

// Function ArchiveTopMenuItem.ArchiveTopMenuItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ArchiveTopMenuItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveTopMenuItem_C_PreConstruct;

// Function ArchiveTopMenuItem.ArchiveTopMenuItem_C.SetMenuText
// 0x0018 (0x0018 - 0x0000)
struct ArchiveTopMenuItem_C_SetMenuText final
{
public:
	class FText                                   Input;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_ArchiveTopMenuItem_C_SetMenuText;

// Function ArchiveTopMenuItem.ArchiveTopMenuItem_C.SetItemCursor
// 0x0002 (0x0002 - 0x0000)
struct ArchiveTopMenuItem_C_SetItemCursor final
{
public:
	ESlateVisibility                              Visiblity;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Visible;                                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTopMenuItem_C_SetItemCursor;

// Function ArchiveTopMenuItem.ArchiveTopMenuItem_C.IsActivated
// 0x0001 (0x0001 - 0x0000)
struct ArchiveTopMenuItem_C_IsActivated final
{
public:
	bool                                          isEnable;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveTopMenuItem_C_IsActivated;

// Function ArchiveTopMenuItem.ArchiveTopMenuItem_C.GetUniqueID
// 0x0008 (0x0008 - 0x0000)
struct ArchiveTopMenuItem_C_GetUniqueID final
{
public:
	class FName                                   UniqueId_0;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTopMenuItem_C_GetUniqueID;

}

