#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveEnemyListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveEnemyListItem.ArchiveEnemyListItem_C
// 0x0150 (0x03A8 - 0x0258)
class UArchiveEnemyListItem_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Base;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEffChoiceBP_C*                         EffChoiceBP;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonItemIcon_C*                      icon;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewIcon;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Root;                                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          isNew;                                             // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEnabled;                                         // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBArchiveEnemyCatalogData             EnemyData;                                         // 0x0298(0x0110)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ArchiveEnemyListItem(int32 EntryPoint);
	void Construct();
	void SetNewIcon(bool IsVisible_0);
	void SetListEnable(bool IsEnabled_0);
	void UnsetNewIcon();
	void Initialize();
	void Setup();
	void SetListParam(int32 input_index, const struct FPBArchiveEnemyCatalogData& input_data);
	void SetDispCursor(bool IsOn);
	void SetNameText(const class FText& InText);
	void GetDescription(class FText* Explain);
	struct FPBDropCatalogData GetDropItemData();
	void GetEnemyData(struct FPBArchiveEnemyCatalogData* EnemyData_0);
	void SetDemonsName(int32 Index_0);
	void SetShardIcon();
	void IsUnlockList(bool* is_unlock);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveEnemyListItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveEnemyListItem_C")
	}
	static class UArchiveEnemyListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveEnemyListItem_C>();
	}
};
DUMPER7_ASSERTS_UArchiveEnemyListItem_C;

}

