#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveTimeAttackListItem_Archives

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveTimeAttackListItem_Archives.ArchiveTimeAttackListItem_Archives_C
// 0x0080 (0x02D8 - 0x0258)
class UArchiveTimeAttackListItem_Archives_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ArrivalTime;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BestRecordTime;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEffChoiceBP_C*                         EffChoiceBP;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewIcon;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Root;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Number;                                            // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isNew;                                             // 0x029C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEnabled;                                         // 0x029D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29E[0x2];                                      // 0x029E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBArchiveTimeRecordCatalogData        record;                                            // 0x02A0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ArchiveTimeAttackListItem_Archives(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void SetNewIcon(bool IsVisible_0);
	void SetNameText(const class FText& InText);
	void SetDispCursor(bool IsOn);
	void SetListEnable(bool IsEnabled_0);
	void UnsetNewIcon();
	void SetArrivalTime(float sec);
	void SetRecordData(const struct FPBArchiveTimeRecordCatalogData& Input);
	void GetCheckpointID(class FName* ID);
	void SetBestRecordTime(float sec);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveTimeAttackListItem_Archives_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveTimeAttackListItem_Archives_C")
	}
	static class UArchiveTimeAttackListItem_Archives_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveTimeAttackListItem_Archives_C>();
	}
};
DUMPER7_ASSERTS_UArchiveTimeAttackListItem_Archives_C;

}

