#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveTimeAttackListItem_Archives

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ArchiveTimeAttackListItem_Archives.ArchiveTimeAttackListItem_Archives_C.ExecuteUbergraph_ArchiveTimeAttackListItem_Archives
// 0x0008 (0x0008 - 0x0000)
struct ArchiveTimeAttackListItem_Archives_C_ExecuteUbergraph_ArchiveTimeAttackListItem_Archives final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveTimeAttackListItem_Archives_C_ExecuteUbergraph_ArchiveTimeAttackListItem_Archives;

// Function ArchiveTimeAttackListItem_Archives.ArchiveTimeAttackListItem_Archives_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ArchiveTimeAttackListItem_Archives_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveTimeAttackListItem_Archives_C_PreConstruct;

// Function ArchiveTimeAttackListItem_Archives.ArchiveTimeAttackListItem_Archives_C.SetNewIcon
// 0x0001 (0x0001 - 0x0000)
struct ArchiveTimeAttackListItem_Archives_C_SetNewIcon final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveTimeAttackListItem_Archives_C_SetNewIcon;

// Function ArchiveTimeAttackListItem_Archives.ArchiveTimeAttackListItem_Archives_C.SetNameText
// 0x0018 (0x0018 - 0x0000)
struct ArchiveTimeAttackListItem_Archives_C_SetNameText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_ArchiveTimeAttackListItem_Archives_C_SetNameText;

// Function ArchiveTimeAttackListItem_Archives.ArchiveTimeAttackListItem_Archives_C.SetDispCursor
// 0x0010 (0x0010 - 0x0000)
struct ArchiveTimeAttackListItem_Archives_C_SetDispCursor final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffChoiceBP_C*                         NewLocalVar_1;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTimeAttackListItem_Archives_C_SetDispCursor;

// Function ArchiveTimeAttackListItem_Archives.ArchiveTimeAttackListItem_Archives_C.SetListEnable
// 0x0001 (0x0001 - 0x0000)
struct ArchiveTimeAttackListItem_Archives_C_SetListEnable final
{
public:
	bool                                          IsEnabled_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveTimeAttackListItem_Archives_C_SetListEnable;

// Function ArchiveTimeAttackListItem_Archives.ArchiveTimeAttackListItem_Archives_C.UnsetNewIcon
// 0x0090 (0x0090 - 0x0000)
struct ArchiveTimeAttackListItem_Archives_C_UnsetNewIcon final
{
public:
	class UPBCharacterInventoryComponent*         inventry;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemCatalogData                     CallFunc_GetItemDataById_itemData;                 // 0x0008(0x0078)(HasGetValueTypeHash)
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBBaseCharacter*                       CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTimeAttackListItem_Archives_C_UnsetNewIcon;

// Function ArchiveTimeAttackListItem_Archives.ArchiveTimeAttackListItem_Archives_C.SetArrivalTime
// 0x0220 (0x0220 - 0x0000)
struct ArchiveTimeAttackListItem_Archives_C_SetArrivalTime final
{
public:
	float                                         sec;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBTimerText                           NewLocalVar_0;                                     // 0x0008(0x0078)(Edit, BlueprintVisible)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0040)(HasGetValueTypeHash)
	struct FPBTimerText                           CallFunc_GetTimerText_ReturnValue;                 // 0x00C0(0x0078)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0138(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0178(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x01B8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01F8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0208(0x0018)()
};
DUMPER7_ASSERTS_ArchiveTimeAttackListItem_Archives_C_SetArrivalTime;

// Function ArchiveTimeAttackListItem_Archives.ArchiveTimeAttackListItem_Archives_C.SetRecordData
// 0x0040 (0x0040 - 0x0000)
struct ArchiveTimeAttackListItem_Archives_C_SetRecordData final
{
public:
	struct FPBArchiveTimeRecordCatalogData        Input;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveTimeAttackListItem_Archives_C_SetRecordData;

// Function ArchiveTimeAttackListItem_Archives.ArchiveTimeAttackListItem_Archives_C.GetCheckpointID
// 0x0008 (0x0008 - 0x0000)
struct ArchiveTimeAttackListItem_Archives_C_GetCheckpointID final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTimeAttackListItem_Archives_C_GetCheckpointID;

// Function ArchiveTimeAttackListItem_Archives.ArchiveTimeAttackListItem_Archives_C.SetBestRecordTime
// 0x0220 (0x0220 - 0x0000)
struct ArchiveTimeAttackListItem_Archives_C_SetBestRecordTime final
{
public:
	float                                         sec;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBTimerText                           NewLocalVar_0;                                     // 0x0008(0x0078)(Edit, BlueprintVisible)
	struct FPBTimerText                           CallFunc_GetTimerText_ReturnValue;                 // 0x0080(0x0078)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00F8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0138(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0178(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x01B8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01F8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0208(0x0018)()
};
DUMPER7_ASSERTS_ArchiveTimeAttackListItem_Archives_C_SetBestRecordTime;

}

