#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveItemList

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function ArchiveItemList.ArchiveItemList_C.ExecuteUbergraph_ArchiveItemList
// 0x0004 (0x0004 - 0x0000)
struct ArchiveItemList_C_ExecuteUbergraph_ArchiveItemList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveItemList_C_ExecuteUbergraph_ArchiveItemList;

// Function ArchiveItemList.ArchiveItemList_C.SetItemData
// 0x0088 (0x0088 - 0x0000)
struct ArchiveItemList_C_SetItemData final
{
public:
	struct FPBItemCatalogData                     input_data;                                        // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAssigned_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveItemList_C_SetItemData;

// Function ArchiveItemList.ArchiveItemList_C.GetItemData
// 0x0078 (0x0078 - 0x0000)
struct ArchiveItemList_C_GetItemData final
{
public:
	struct FPBItemCatalogData                     Output;                                            // 0x0000(0x0078)(Parm, OutParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveItemList_C_GetItemData;

// Function ArchiveItemList.ArchiveItemList_C.SetItemName
// 0x0018 (0x0018 - 0x0000)
struct ArchiveItemList_C_SetItemName final
{
public:
	class FText                                   in_text;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_ArchiveItemList_C_SetItemName;

// Function ArchiveItemList.ArchiveItemList_C.SetItemIcon
// 0x0020 (0x0020 - 0x0000)
struct ArchiveItemList_C_SetItemIcon final
{
public:
	class FString                                 icon_path;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Path;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveItemList_C_SetItemIcon;

// Function ArchiveItemList.ArchiveItemList_C.SetNewIcon
// 0x0002 (0x0002 - 0x0000)
struct ArchiveItemList_C_SetNewIcon final
{
public:
	bool                                          is_new;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isNew;                                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveItemList_C_SetNewIcon;

// Function ArchiveItemList.ArchiveItemList_C.SetDispCursor
// 0x0001 (0x0001 - 0x0000)
struct ArchiveItemList_C_SetDispCursor final
{
public:
	bool                                          is_disp;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveItemList_C_SetDispCursor;

// Function ArchiveItemList.ArchiveItemList_C.UnsetNewIcon
// 0x0008 (0x0008 - 0x0000)
struct ArchiveItemList_C_UnsetNewIcon final
{
public:
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveItemList_C_UnsetNewIcon;

}

