#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveEnemyResistChip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveEnemyResistChip.ArchiveEnemyResistChip_C
// 0x0028 (0x0280 - 0x0258)
class UArchiveEnemyResistChip_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 icon;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Resist;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Icon_Texture;                                      // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ArchiveEnemyResistChip(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void Initialize();
	void Setup();
	void SetIconImage(class UTexture2D* Texture);
	void SetResistValue(float input_value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveEnemyResistChip_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveEnemyResistChip_C")
	}
	static class UArchiveEnemyResistChip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveEnemyResistChip_C>();
	}
};
DUMPER7_ASSERTS_UArchiveEnemyResistChip_C;

}

