#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveWeaponDetail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveWeaponDetail.ArchiveWeaponDetail_C
// 0x00A8 (0x0300 - 0x0258)
class UArchiveWeaponDetail_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArchiveEquipmentStatus_C*              Status;                                            // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0268(0x0018)(Edit, BlueprintVisible)
	class AArchiveBackGround_C*                   WeaponModel;                                       // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemCatalogData                     itemData;                                          // 0x0288(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ArchiveWeaponDetail(int32 EntryPoint);
	void Destruct();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void Initialize();
	void Setup();
	void DestroyActor();
	void SetItemData(const struct FPBItemCatalogData& input_data);
	void HIdeModel();
	void ShowModel();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveWeaponDetail_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveWeaponDetail_C")
	}
	static class UArchiveWeaponDetail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveWeaponDetail_C>();
	}
};
DUMPER7_ASSERTS_UArchiveWeaponDetail_C;

}

