#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveContentsBlock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveContentsBlock.ArchiveContentsBlock_C
// 0x0058 (0x02B0 - 0x0258)
class UArchiveContentsBlock_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArchiveContentsBlockPanel_C*           ArchiveContentsBlockPanel;                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextPanel_C*                     CommonTextPanel;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0278(0x0018)(Edit, BlueprintVisible)
	class FText                                   Content;                                           // 0x0290(0x0018)(Edit, BlueprintVisible)
	ETextJustify                                  Justify;                                           // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ArchiveContentsBlock(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetTitle(const class FText& InText);
	void SetContentsText(const class FText& Content_0);
	void SetContentsJustify(ETextJustify& Justification);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveContentsBlock_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveContentsBlock_C")
	}
	static class UArchiveContentsBlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveContentsBlock_C>();
	}
};
DUMPER7_ASSERTS_UArchiveContentsBlock_C;

}

