#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveEnemyMenu

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.ExecuteUbergraph_ArchiveEnemyMenu
// 0x0020 (0x0020 - 0x0000)
struct ArchiveEnemyMenu_C_ExecuteUbergraph_ArchiveEnemyMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> K2Node_Event_OnStepChanged; // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_ZOrder;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_ExecuteUbergraph_ArchiveEnemyMenu;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.Start
// 0x0014 (0x0014 - 0x0000)
struct ArchiveEnemyMenu_C_Start final
{
public:
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> OnStepChanged; // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	int32                                         ZOrder;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_Start;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ArchiveEnemyMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_PreConstruct;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.Setup
// 0x0090 (0x0090 - 0x0000)
struct ArchiveEnemyMenu_C_Setup final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBGameModePlayer                             CallFunc_GetGameModePlayerType_ReturnValue;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       CallFunc_GetPausePlayer_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AArchiveBackGround_C*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_Setup;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.OnStart
// 0x0008 (0x0008 - 0x0000)
struct ArchiveEnemyMenu_C_OnStart final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_OnStart;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.OnSelectList
// 0x0020 (0x0020 - 0x0000)
struct ArchiveEnemyMenu_C_OnSelectList final
{
public:
	bool                                          CallFunc_IsSelectSelect_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectRB_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectLB_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUnlockList_is_enable;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelectDecide_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectRight_ReturnValue;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectLeft_ReturnValue;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectDown_ReturnValue;                 // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectUp_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectCancel_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_OnSelectList;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.OnEnemyDetail
// 0x0028 (0x0028 - 0x0000)
struct ArchiveEnemyMenu_C_OnEnemyDetail final
{
public:
	bool                                          CallFunc_IsSelectDown_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectUp_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectDecide_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectSelect_ReturnValue;               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MoveCursor_is_enable;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MoveCursor_is_enable1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectRight_ReturnValue;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectLeft_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelectCancel_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_OnEnemyDetail;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.OnDestruct
// 0x0001 (0x0001 - 0x0000)
struct ArchiveEnemyMenu_C_OnDestruct final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_OnDestruct;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.UpdateMenu
// 0x0118 (0x0118 - 0x0000)
struct ArchiveEnemyMenu_C_UpdateMenu final
{
public:
	struct FPBDropCatalogData                     dropitem_data;                                     // 0x0000(0x00F0)(Edit, BlueprintVisible)
	class FText                                   Description;                                       // 0x00F0(0x0018)(Edit, BlueprintVisible)
	class UArchiveEnemyListItem_C*                select_list;                                       // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArchiveEnemyListItem_C*                CallFunc_GetSelectList_Output;                     // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_UpdateMenu;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.UpdateDetail
// 0x0230 (0x0230 - 0x0000)
struct ArchiveEnemyMenu_C_UpdateDetail final
{
public:
	class UArchiveEnemyListItem_C*                select_list;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBArchiveEnemyCatalogData             enemy_data;                                        // 0x0008(0x0110)(Edit, BlueprintVisible)
	class UArchiveEnemyListItem_C*                CallFunc_GetSelectList_Output;                     // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBArchiveEnemyCatalogData             CallFunc_GetEnemyData_EnemyData;                   // 0x0120(0x0110)()
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_UpdateDetail;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.UpdateDescription
// 0x0040 (0x0040 - 0x0000)
struct ArchiveEnemyMenu_C_UpdateDescription final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0018)(Edit, BlueprintVisible)
	class UArchiveEnemyListItem_C*                CallFunc_GetSelectList_Output;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnlockList_is_enable;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDescription_Explain;                   // 0x0028(0x0018)()
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_UpdateDescription;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.UpdateDispModel
// 0x0001 (0x0001 - 0x0000)
struct ArchiveEnemyMenu_C_UpdateDispModel final
{
public:
	bool                                          CallFunc_IsUnlockList_is_enable;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_UpdateDispModel;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.ShowEnemyModel
// 0x0230 (0x0230 - 0x0000)
struct ArchiveEnemyMenu_C_ShowEnemyModel final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBArchiveEnemyCatalogData             Data;                                              // 0x0008(0x0110)(Edit, BlueprintVisible)
	class UArchiveEnemyListItem_C*                CallFunc_GetSelectList_Output;                     // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBArchiveEnemyCatalogData             CallFunc_GetEnemyData_EnemyData;                   // 0x0120(0x0110)()
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_ShowEnemyModel;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.UpdateDropShard
// 0x01F0 (0x01F0 - 0x0000)
struct ArchiveEnemyMenu_C_UpdateDropShard final
{
public:
	struct FPBDropCatalogData                     dropitem_data;                                     // 0x0000(0x00F0)(Edit, BlueprintVisible)
	class UArchiveEnemyListItem_C*                CallFunc_GetSelectList_Output;                     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBDropCatalogData                     CallFunc_GetDropItemData_ReturnValue;              // 0x00F8(0x00F0)()
	bool                                          CallFunc_IsUnlockList_is_enable;                   // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_UpdateDropShard;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.OpenMenu
// 0x000C (0x000C - 0x0000)
struct ArchiveEnemyMenu_C_OpenMenu final
{
public:
	EUserWidgetPriority                           set_priority;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         order;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_OpenMenu;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.SetMenuVisible
// 0x0001 (0x0001 - 0x0000)
struct ArchiveEnemyMenu_C_SetMenuVisible final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_SetMenuVisible;

// Function ArchiveEnemyMenu.ArchiveEnemyMenu_C.NotifyIsDetailView
// 0x0002 (0x0002 - 0x0000)
struct ArchiveEnemyMenu_C_NotifyIsDetailView final
{
public:
	bool                                          IsDetailView;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEnemyMenu_C_NotifyIsDetailView;

}

