#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveItemList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveItemList.ArchiveItemList_C
// 0x00C0 (0x0318 - 0x0258)
class UArchiveItemList_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Base;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEffChoiceBP_C*                         EffChoiceBP;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonItemIcon_C*                      icon;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewIcon;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPBItemCatalogData                     itemData;                                          // 0x0288(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0300(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_ArchiveItemList(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void SetItemData(const struct FPBItemCatalogData& input_data);
	void GetItemData(struct FPBItemCatalogData* Output);
	void SetItemName(const class FText& in_text);
	void SetItemIcon(const class FString& icon_path);
	void SetNewIcon(bool is_new);
	void SetDispCursor(bool is_disp);
	void UnsetNewIcon();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveItemList_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveItemList_C")
	}
	static class UArchiveItemList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveItemList_C>();
	}
};
DUMPER7_ASSERTS_UArchiveItemList_C;

}

