#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveEnemyDropItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveEnemyDropItem.ArchiveEnemyDropItem_C
// 0x0320 (0x0578 - 0x0258)
class UArchiveEnemyDropItem_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 back;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DropItemList;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveDropitemTitle_C*                DropItemTitle;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DropShardList;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveDropitemTitle_C*                DropShardTitle;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPBArchiveEnemyCatalogData             EnemyData;                                         // 0x0288(0x0110)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPBDropCatalogData                     DropData;                                          // 0x0398(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPBDropCatalogData                     ShardData;                                         // 0x0488(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ArchiveEnemyDropItem(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void SetEnemyData(const struct FPBArchiveEnemyCatalogData& input_data);
	void AddDropItemList(const struct FDropItemData& input_data);
	void SetCommonIngredient();
	void SetCommonItem();
	void SetDropShard();
	void SetRareIngredient();
	void SetRareItem();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveEnemyDropItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveEnemyDropItem_C")
	}
	static class UArchiveEnemyDropItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveEnemyDropItem_C>();
	}
};
DUMPER7_ASSERTS_UArchiveEnemyDropItem_C;

}

