#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveTipsMenu

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function ArchiveTipsMenu.ArchiveTipsMenu_C.ExecuteUbergraph_ArchiveTipsMenu
// 0x001C (0x001C - 0x0000)
struct ArchiveTipsMenu_C_ExecuteUbergraph_ArchiveTipsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> K2Node_Event_OnStepChanged; // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_ZOrder;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsMenu_C_ExecuteUbergraph_ArchiveTipsMenu;

// Function ArchiveTipsMenu.ArchiveTipsMenu_C.Start
// 0x0014 (0x0014 - 0x0000)
struct ArchiveTipsMenu_C_Start final
{
public:
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> OnStepChanged; // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	int32                                         ZOrder;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsMenu_C_Start;

// Function ArchiveTipsMenu.ArchiveTipsMenu_C.Setup
// 0x0008 (0x0008 - 0x0000)
struct ArchiveTipsMenu_C_Setup final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsMenu_C_Setup;

// Function ArchiveTipsMenu.ArchiveTipsMenu_C.OnStart
// 0x0008 (0x0008 - 0x0000)
struct ArchiveTipsMenu_C_OnStart final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsMenu_C_OnStart;

// Function ArchiveTipsMenu.ArchiveTipsMenu_C.OnSelectMenu
// 0x000B (0x000B - 0x0000)
struct ArchiveTipsMenu_C_OnSelectMenu final
{
public:
	bool                                          CallFunc_IsListEmpty_IsListEmpty;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsListEmpty_IsListEmpty1;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsListEmpty_IsListEmpty2;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsListEmpty_IsListEmpty3;                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectRB_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectLB_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectRight_ReturnValue;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectLeft_ReturnValue;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectDown_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectUp_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectCancel_ReturnValue;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveTipsMenu_C_OnSelectMenu;

// Function ArchiveTipsMenu.ArchiveTipsMenu_C.MoveCursor
// 0x0020 (0x0020 - 0x0000)
struct ArchiveTipsMenu_C_MoveCursor final
{
public:
	int32                                         Move;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Description;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsMenu_C_MoveCursor;

// Function ArchiveTipsMenu.ArchiveTipsMenu_C.MoveTab
// 0x0008 (0x0008 - 0x0000)
struct ArchiveTipsMenu_C_MoveTab final
{
public:
	int32                                         move_val;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Move;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsMenu_C_MoveTab;

// Function ArchiveTipsMenu.ArchiveTipsMenu_C.UpdateExplainText
// 0x0028 (0x0028 - 0x0000)
struct ArchiveTipsMenu_C_UpdateExplainText final
{
public:
	class FString                                 Description;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UArchiveTipsList_C*                     CallFunc_GetSelectList_Output;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDescription_Description;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsMenu_C_UpdateExplainText;

// Function ArchiveTipsMenu.ArchiveTipsMenu_C.OpenMenu
// 0x000C (0x000C - 0x0000)
struct ArchiveTipsMenu_C_OpenMenu final
{
public:
	EUserWidgetPriority                           set_priority;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         order;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsMenu_C_OpenMenu;

}

