#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveCraftRecipeDetail

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "IngredientData_structs.hpp"


namespace SDK::Params
{

// Function ArchiveCraftRecipeDetail.ArchiveCraftRecipeDetail_C.ExecuteUbergraph_ArchiveCraftRecipeDetail
// 0x0004 (0x0004 - 0x0000)
struct ArchiveCraftRecipeDetail_C_ExecuteUbergraph_ArchiveCraftRecipeDetail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveCraftRecipeDetail_C_ExecuteUbergraph_ArchiveCraftRecipeDetail;

// Function ArchiveCraftRecipeDetail.ArchiveCraftRecipeDetail_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct ArchiveCraftRecipeDetail_C_Initialize final
{
public:
	TArray<class UArchiveCraftIngredient_C*>      K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ZeroConstructor, ReferenceParm)
};
DUMPER7_ASSERTS_ArchiveCraftRecipeDetail_C_Initialize;

// Function ArchiveCraftRecipeDetail.ArchiveCraftRecipeDetail_C.SetCraftData
// 0x0128 (0x0128 - 0x0000)
struct ArchiveCraftRecipeDetail_C_SetCraftData final
{
public:
	struct FPBArchiveCraftCatalogData             input_data;                                        // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FIngredientData                        data04;                                            // 0x0088(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FIngredientData                        data03;                                            // 0x009C(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FIngredientData                        data02;                                            // 0x00B0(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FIngredientData                        data01;                                            // 0x00C4(0x0014)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FIngredientData                        K2Node_MakeStruct_IngredientData;                  // 0x00D8(0x0014)(NoDestructor, HasGetValueTypeHash)
	struct FIngredientData                        K2Node_MakeStruct_IngredientData1;                 // 0x00EC(0x0014)(NoDestructor, HasGetValueTypeHash)
	struct FIngredientData                        K2Node_MakeStruct_IngredientData2;                 // 0x0100(0x0014)(NoDestructor, HasGetValueTypeHash)
	struct FIngredientData                        K2Node_MakeStruct_IngredientData3;                 // 0x0114(0x0014)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveCraftRecipeDetail_C_SetCraftData;

}

