#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveEnemyResistChip

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ArchiveEnemyResistChip.ArchiveEnemyResistChip_C.ExecuteUbergraph_ArchiveEnemyResistChip
// 0x0008 (0x0008 - 0x0000)
struct ArchiveEnemyResistChip_C_ExecuteUbergraph_ArchiveEnemyResistChip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEnemyResistChip_C_ExecuteUbergraph_ArchiveEnemyResistChip;

// Function ArchiveEnemyResistChip.ArchiveEnemyResistChip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ArchiveEnemyResistChip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEnemyResistChip_C_PreConstruct;

// Function ArchiveEnemyResistChip.ArchiveEnemyResistChip_C.SetIconImage
// 0x0008 (0x0008 - 0x0000)
struct ArchiveEnemyResistChip_C_SetIconImage final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEnemyResistChip_C_SetIconImage;

// Function ArchiveEnemyResistChip.ArchiveEnemyResistChip_C.SetResistValue
// 0x00A8 (0x00A8 - 0x0000)
struct ArchiveEnemyResistChip_C_SetResistValue final
{
public:
	float                                         input_value;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor1;                     // 0x0038(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor2;                     // 0x0060(0x0028)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0090(0x0018)()
};
DUMPER7_ASSERTS_ArchiveEnemyResistChip_C_SetResistValue;

}

