#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveTipsExplain

#include "Basic.hpp"


namespace SDK::Params
{

// Function ArchiveTipsExplain.ArchiveTipsExplain_C.ExecuteUbergraph_ArchiveTipsExplain
// 0x0004 (0x0004 - 0x0000)
struct ArchiveTipsExplain_C_ExecuteUbergraph_ArchiveTipsExplain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsExplain_C_ExecuteUbergraph_ArchiveTipsExplain;

// Function ArchiveTipsExplain.ArchiveTipsExplain_C.SetExplainText
// 0x0038 (0x0038 - 0x0000)
struct ArchiveTipsExplain_C_SetExplainText final
{
public:
	class FString                                 input_string;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UArchiveTipsLine_C*                     Line;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Element;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 String;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsExplain_C_SetExplainText;

}

