#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveQuestListWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveQuestListWindow.ArchiveQuestListWindow_C
// 0x0030 (0x0288 - 0x0258)
class UArchiveQuestListWindow_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           ItemsList;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListWindow_C*                    ListWindow;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UQuestMenuListItem_C*>           MenuLIst;                                          // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Index_0;                                           // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ArchiveQuestListWindow(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void Clean();
	void AddList(class UQuestMenuListItem_C* Input);
	void GetList(int32 Param_Index_0, class UQuestMenuListItem_C** Output);
	void GetSelectList(class UQuestMenuListItem_C** Output);
	void Refresh();
	void MoveScroll(int32 Move, class UQuestMenuListItem_C** Output);
	void UnsetNewFromSelected();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveQuestListWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveQuestListWindow_C")
	}
	static class UArchiveQuestListWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveQuestListWindow_C>();
	}
};
DUMPER7_ASSERTS_UArchiveQuestListWindow_C;

}

