#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveItemListWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIScroll_classes.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveItemListWindow.ArchiveItemListWindow_C
// 0x0030 (0x02D8 - 0x02A8)
class UArchiveItemListWindow_C final : public UUIScroll_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ArchiveItemListWindow_C;            // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArchiveItemListTab_C*                  ListTab;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListWindow_C*                    ScrollList;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UArchiveItemList_C*>             MenuLIst;                                          // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Index_0;                                           // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ArchiveItemListWindow(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void AddList(class UArchiveItemList_C* add_item);
	void GetList(int32 Param_Index_0, class UArchiveItemList_C** outpu);
	void GetSelectList(class UArchiveItemList_C** Output);
	void Clean();
	void Refresh();
	void ResetScrollOffset(int32 Param_Index_0, int32 Offset_0);
	void MoveTab(int32 move_val);
	void MoveCursor(int32 move_val);
	void UpdateScroll();
	void SetListIndex(int32 Input);
	void GetTabCategory(ECarriedCatalog* Output);
	void IsListEmpty(bool* IsEmpty_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveItemListWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveItemListWindow_C")
	}
	static class UArchiveItemListWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveItemListWindow_C>();
	}
};
DUMPER7_ASSERTS_UArchiveItemListWindow_C;

}

