#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveCraftListWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "UIScroll_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveCraftListWindow.ArchiveCraftListWindow_C
// 0x0050 (0x02F8 - 0x02A8)
class UArchiveCraftListWindow_C final : public UUIScroll_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ArchiveCraftListWindow_C;           // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArchiveCraftListTab_C*                 ListTab;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListWindow_C*                    ScrollList;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UCraftRecipeList_C*>             ListItems;                                         // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Index_0;                                           // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCommonTabIconMenu_C*>           ListTabs;                                          // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<ECarriedCatalog>                       TabCategory;                                       // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ArchiveCraftListWindow(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void AddList(class UCraftRecipeList_C* input_item);
	void GetList(int32 Param_Index_0, class UCraftRecipeList_C** Output);
	void GetSelectList(class UCraftRecipeList_C** Output);
	void Clean();
	void Refresh();
	void MoveCursor(int32 move_val);
	void MoveTab(int32 move_val);
	void SetListIndex(int32 input_index);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveCraftListWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveCraftListWindow_C")
	}
	static class UArchiveCraftListWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveCraftListWindow_C>();
	}
};
DUMPER7_ASSERTS_UArchiveCraftListWindow_C;

}

