#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveTimeAttackMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveTimeAttackMenu.ArchiveTimeAttackMenu_C
// 0x0028 (0x02A0 - 0x0278)
class UArchiveTimeAttackMenu_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Close;                                             // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UArchiveTimeAttackListWindow_C*         RecordList;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveMenu_C*                         ArchiveMenu;                                       // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ArchiveTimeAttackMenu(int32 EntryPoint);
	void OnPressedButton();
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void Construct();
	void WidgetAnimationEvt_open_K2Node_WidgetAnimationEvent_0();
	void Initialize();
	void Setup();
	void OnStart();
	void OnSelectMenu();
	void GetRecordTime(float input_sec, class FText* Output);
	void MoveCursor(int32 move_val);
	void OpenMenu(EUserWidgetPriority set_priority);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveTimeAttackMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveTimeAttackMenu_C")
	}
	static class UArchiveTimeAttackMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveTimeAttackMenu_C>();
	}
};
DUMPER7_ASSERTS_UArchiveTimeAttackMenu_C;

}

