#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveTipsListWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIScroll_classes.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveTipsListWindow.ArchiveTipsListWindow_C
// 0x0030 (0x02D8 - 0x02A8)
class UArchiveTipsListWindow_C final : public UUIScroll_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ArchiveTipsListWindow_C;            // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArchiveTipsListTab_C*                  ListTab;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListWindow_C*                    ScrollList;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UArchiveTipsList_C*>             ListItems;                                         // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Index_0;                                           // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ArchiveTipsListWindow(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void AddList(class UArchiveTipsList_C* Input);
	void GetList(int32 Param_Index_0, class UArchiveTipsList_C** Output);
	void GetSelectList(class UArchiveTipsList_C** Output);
	void Clean();
	void Refresh();
	void MoveCursor(int32 Move);
	void MoveTab(int32 Move);
	void SetListIndex(int32 Input);
	void IsListEmpty(bool* IsListEmpty_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveTipsListWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveTipsListWindow_C")
	}
	static class UArchiveTipsListWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveTipsListWindow_C>();
	}
};
DUMPER7_ASSERTS_UArchiveTipsListWindow_C;

}

