#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackkerIDSetter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BackkerIDSetter.BackkerIDSetter_C
// 0x0058 (0x02B0 - 0x0258)
class UBackkerIDSetter_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 back;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Content;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEffChoiceBP_C*                         EffChoiceBP;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       TextBox;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBlockTitle_C*                    Title;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   text;                                              // 0x0288(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	UMulticastDelegateProperty_                   EventTextCommited;                                 // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BackkerIDSetter(int32 EntryPoint);
	void BndEvt__TextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& text_0, ETextCommit CommitMethod);
	void BndEvt__TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& text_0);
	void Construct();
	void Initialize();
	void Setup();
	void SetBlockCursor(ESlateVisibility InVisibility);
	void SetInputActivate(bool Condition);
	void GetContentText(class FText* Output);
	void SetContentText(const class FText& in_text);
	void ResponseTextCommit(ETextCommit Param);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BackkerIDSetter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BackkerIDSetter_C")
	}
	static class UBackkerIDSetter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBackkerIDSetter_C>();
	}
};
DUMPER7_ASSERTS_UBackkerIDSetter_C;

}

