#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackkerIDSetter

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BackkerIDSetter.BackkerIDSetter_C.ExecuteUbergraph_BackkerIDSetter
// 0x0040 (0x0040 - 0x0000)
struct BackkerIDSetter_C_ExecuteUbergraph_BackkerIDSetter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0008(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text1;                  // 0x0028(0x0018)(ConstParm)
};
DUMPER7_ASSERTS_BackkerIDSetter_C_ExecuteUbergraph_BackkerIDSetter;

// Function BackkerIDSetter.BackkerIDSetter_C.BndEvt__TextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BackkerIDSetter_C_BndEvt__TextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   text_0;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BackkerIDSetter_C_BndEvt__TextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature;

// Function BackkerIDSetter.BackkerIDSetter_C.BndEvt__TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BackkerIDSetter_C_BndEvt__TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   text_0;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BackkerIDSetter_C_BndEvt__TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature;

// Function BackkerIDSetter.BackkerIDSetter_C.SetBlockCursor
// 0x0002 (0x0002 - 0x0000)
struct BackkerIDSetter_C_SetBlockCursor final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Visible;                                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BackkerIDSetter_C_SetBlockCursor;

// Function BackkerIDSetter.BackkerIDSetter_C.SetInputActivate
// 0x0020 (0x0020 - 0x0000)
struct BackkerIDSetter_C_SetInputActivate final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetContentText_output;                    // 0x0008(0x0018)()
};
DUMPER7_ASSERTS_BackkerIDSetter_C_SetInputActivate;

// Function BackkerIDSetter.BackkerIDSetter_C.GetContentText
// 0x0030 (0x0030 - 0x0000)
struct BackkerIDSetter_C_GetContentText final
{
public:
	class FText                                   Output;                                            // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_BackkerIDSetter_C_GetContentText;

// Function BackkerIDSetter.BackkerIDSetter_C.SetContentText
// 0x0018 (0x0018 - 0x0000)
struct BackkerIDSetter_C_SetContentText final
{
public:
	class FText                                   in_text;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_BackkerIDSetter_C_SetContentText;

// Function BackkerIDSetter.BackkerIDSetter_C.ResponseTextCommit
// 0x0002 (0x0002 - 0x0000)
struct BackkerIDSetter_C_ResponseTextCommit final
{
public:
	ETextCommit                                   Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BackkerIDSetter_C_ResponseTextCommit;

}

