#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BloodDressController

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// DynamicClass BloodDressController.BloodDressController_C
// 0x00A0 (0x02D0 - 0x0230)
class UBloodDressController_C final : public UActorComponent
{
public:
	TArray<class UTexture2D*>                     BodyColorTextures;                                 // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 BodyMeshRef;                                       // 0x0240(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 DressMeshRef;                                      // 0x0248(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     DressColorTextures;                                // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumBodyStages;                                     // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentBodyStage;                                  // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentDressStage;                                 // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumDressStages;                                    // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     DressMaskTextures;                                 // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     BodyMaskTextures;                                  // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumHairStages;                                     // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentHairStage;                                  // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     HairColorTextures;                                 // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     HairMaskTextures;                                  // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 HairMeshRef;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 OutlineMeshRef;                                    // 0x02C0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K2Node_CustomEvent_NormalisedHP;                   // 0x02C8(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveBeginPlay();
	void UpdateDressParams(float bpp__NormalisedHP__pf);
	void UpdateMats(float bpp__NormHP__pf, TArray<class UTexture2D*>* bpp__TextureList__pf, int32* bpp__CurrentStage__pf, int32 bpp__NumStages__pf, class USkeletalMeshComponent* bpp__Mesh__pf, class FName bpp__BaseTexName__pf, class FName bpp__TargetTexName__pf, bool bpp__ShouldUpdateCurrentStage__pf, class FName bpp__MaterialSlot__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BloodDressController_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BloodDressController_C")
	}
	static class UBloodDressController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBloodDressController_C>();
	}
};
DUMPER7_ASSERTS_UBloodDressController_C;

}

