#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BossRush

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BossRush.BossRush_C
// 0x0128 (0x03A0 - 0x0278)
class UBossRush_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Close;                                             // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UcraftTriangleAnm_C*                    Arrow;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bg;                                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonControllGuide_C*                 ControllGuide;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USavedataEditMenu_C*                    EditMenu;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonMenuHeader_C*                    MenuHeader;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonMsgPopup_C*                      MsgPopup;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USavedataDetail_C*                      PasteSlotDetail;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USavedataInfo_C*                        PasteSlotInfo;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USavedataDetail_C*                      SavedataDetail;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USavedataInfo_C*                        SavedataInfo;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDataLoadList_C*                        SaveSlotList;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStartupSelecter_C*                     StartupSelecter;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWaitMsgPopup_C*                  WaitPopup;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonYesNoPopup_C*                    YesNoPopup;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 SaveSlotName;                                      // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfigSelectMenu_C*                    ConfigSelectMenu;                                  // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventCloseLoadMenu;                                // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 CopySlotName;                                      // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0350(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   txt;                                               // 0x0368(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	UMulticastDelegateProperty_                   EventSaveEnd;                                      // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsResume;                                          // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCourseSelectMenu_C*                    CourseSelect;                                      // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BossRush(int32 EntryPoint);
	void OnPressedButton();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void Construct();
	void WidgetAnimationEvt_out_K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_in_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_open_K2Node_WidgetAnimationEvent_0();
	void DeleteConfirmNo();
	void DeleteConfirmYes();
	void SetupDeleteConfirmNo();
	void SetupDeleteConfirmYes();
	void OpenDeleteConfirm();
	void SelecterClosed();
	void SelecterOpened();
	void SetupStartEvent();
	void SetupStartupSelecter();
	void カスタムイベント_2();
	void OpenSavingMessage();
	void BndEvt__MsgPopup_K2Node_ComponentBoundEvent_3_EventClosedMsg__DelegateSignature();
	void OpenSaveEndMessage();
	void ClosedMenu();
	void EventSubMenuBackerId();
	void EventSubMenuEditName();
	void EventSubMenuCanceled();
	void EventSubMenuClosed();
	void EventSubMenuOpened();
	void SetupEditSubMenu();
	void BndEvt__SaveSlotList_K2Node_ComponentBoundEvent_1_EventEditNameCancel__DelegateSignature();
	void BndEvt__SaveSlotList_K2Node_ComponentBoundEvent_0_EventEditNameDecide__DelegateSignature();
	void EditNameEnd();
	void CancelEditName();
	void DecideEditName();
	void EditNameConfirmNo();
	void EditNameConfirmYes();
	void SetupEditNameConfirmNo();
	void SetupEditNameConfirmYes();
	void OpenEditNameConfirm();
	void カスタムイベント_0();
	void DataCopyEnd();
	void DataCopyConfirmNo();
	void DataCopyConfirmYes();
	void SetupDataCopyConfirmNo();
	void SetupDataCopyConfirmYes();
	void OpenDataCopyConfirm();
	void ResumeCancel();
	void ResumeStart();
	void ResumeConfirmNo();
	void ResumeConfirmYes();
	void SetupResumeConfirmNo();
	void SetupResumeConfirmYes();
	void OpenResumeConfirm();
	void CourseSelectClosed();
	void CourseSelectOpened();
	void SetupCourseSelectClosed();
	void SetupCourseSelectOpened();
	void OpenCourceSelectMenu();
	void DeleteSaveData();
	void IsSelectDelete(bool* IsSelect);
	void LoadingStart();
	void DecideSaveSlot();
	void UpdateSlotData();
	void MoveCursor(int32 MoveVal);
	void NewGameStart();
	void GameStart();
	void IsSelectOption(bool* IsSelect);
	void UpdatePasteSlotData();
	void SetupDataCopy();
	void DataCopy();
	void IsSelectSwitchSuspend(bool* is_enable);
	void UpdateControlGuide();
	void SwitchSelectData();
	void Initialize();
	void Setup();
	void OnStart();
	void OnSelectSlot();
	void OnSubMenu();
	void OnDataCopy();
	void OnConfirm();
	void OnEditName();
	void OnCourseSelect();
	void OnLoading();
	void Had_DLC_When_Saved(bool* ret);
	void UpdateCourseSelectRecordTimes();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BossRush_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BossRush_C")
	}
	static class UBossRush_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBossRush_C>();
	}
};
DUMPER7_ASSERTS_UBossRush_C;

}

