#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosState

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ChaosState.BP_ChaosState_C.GetTimeElapsed
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosState_C_GetTimeElapsed final
{
public:
	float                                         bpp__TimeElapsed__pf;                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosState_C_GetTimeElapsed;

// Function BP_ChaosState.BP_ChaosState_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosState_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosState_C_ReceiveTick;

// Function BP_ChaosState.BP_ChaosState_C.Server_UpdateGameInstance
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosState_C_Server_UpdateGameInstance final
{
public:
	bool                                          bpp__Ready__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__Index__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosState_C_Server_UpdateGameInstance;

// Function BP_ChaosState.BP_ChaosState_C.SetTimeElapsed
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosState_C_SetTimeElapsed final
{
public:
	float                                         bpp__inTimeElapsed__pf;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__outTimeElapsed__pf;                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosState_C_SetTimeElapsed;

}

