#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosItemDropper

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// DynamicClass BP_ChaosItemDropper.BP_ChaosItemDropper_C
// 0x0288 (0x0710 - 0x0488)
class ABP_ChaosItemDropper_C final : public AActor
{
public:
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ChaosItemSwap_C*                    BP_ChaosItemSwap;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBP_ChaosDropPicker_C*                  BP_ChaosDropPicker_Consumables_;                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBP_ChaosDropPicker_C*                  BP_ChaosDropPicker_Shards_;                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBUserWidgetPauseMenu*                 ShardPickupWidget;                                 // 0x04B0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Player1Shard;                                      // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Player2Shard;                                      // 0x04C0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class APBBaseCharacter*, float>          RecentInteractingCharacters;                       // 0x04C8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FName                                   Player2NextClientShard;                            // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Player2ShardPromptShowing;                         // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_Event_Visible;                              // 0x0521(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_522[0x2];                                      // 0x0522(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0524(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0528(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x052C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AOCCharacter*                           CallFunc_GetClientCharacter_Character;             // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_GetClientCharacter_Success;               // 0x0538(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_539[0x3];                                      // 0x0539(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class APBBaseCharacter* bpp__itemDropper__pf)> K2Node_CreateDelegate_OutputDelegate; // 0x053C(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   K2Node_CustomEvent_PickupShard;                    // 0x054C(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPopupSwapText_PopupSwapText;           // 0x0558(0x0018)(Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	bool                                          CallFunc_IsPlayer2ShowingSwap_Return;              // 0x0570(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBItemMasterData                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0578(0x0088)(Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0600(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_604[0x4];                                      // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOCCharacter*                           CallFunc_GetClientCharacter_Character1;            // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_GetClientCharacter_Success1;              // 0x0610(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       K2Node_CustomEvent_itemDropper1;                   // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0620(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames1;        // 0x0630(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChaosModeConsumable                   CallFunc_GetDataTableRowFromName_OutRow1;          // 0x0648(0x0020)(Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0668(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       K2Node_CustomEvent_itemDropper;                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0678(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CallFunc_Array_Get_Item1;                          // 0x067C(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChaosModeShard                        CallFunc_GetDataTableRowFromName_OutRow2;          // 0x0688(0x0020)(Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_CustomEvent_Character;                      // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x06B0(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6B4[0x4];                                      // 0x06B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APBBaseCharacter*>               CallFunc_Map_Keys_Keys;                            // 0x06B8(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       CallFunc_Array_Get_Item2;                          // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 CallFunc_Map_Values_Values;                        // 0x06D0(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	float                                         CallFunc_Array_Get_Item3;                          // 0x06E0(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Temp_float_Variable;                               // 0x06E4(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class APBBaseCharacter* bpp__character__pf)> K2Node_CreateDelegate_OutputDelegate1; // 0x06E8(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(class APBBaseCharacter* bpp__itemDropper__pf)> K2Node_CreateDelegate_OutputDelegate2; // 0x06F8(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          CallFunc_IsPlayer2ShowingSwap_Return1;             // 0x0708(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CreateShardPickupWidget();
	void DropConsumable(class APBBaseCharacter* bpp__itemDropper__pf);
	void DropRandomConsumable(class APBBaseCharacter* bpp__itemDropper__pf);
	void DropRandomShard(class APBBaseCharacter* bpp__itemDropper__pf);
	void DropShard(class APBBaseCharacter* bpp__itemDropper__pf);
	void GetClientCharacter(class AOCCharacter** bpp__character__pf, bool* bpp__Success__pf);
	void ItemEquipped(class APBBaseCharacter* bpp__character__pf);
	void MULTICAST_RemoveShardPickupWidget();
	void MULTICAST_ShowPlayer2PickUpShard(class FName bpp__PickupShard__pf);
	void Player1CancelShard();
	void Player1PickUpShard();
	void Player2CancelShard();
	void Player2PickUpShard();
	void ReceiveBeginPlay();
	void ReceiveTick(float bpp__DeltaSeconds__pf);
	void RemoveShardPickupWidget();
	void TogglePlayer2ShardPromptShowing(bool bpp__Visible__pf);
	void TriggerPlayer2CancelShard();
	void TriggerPlayer2PickupShard();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BP_ChaosItemDropper_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ChaosItemDropper_C")
	}
	static class ABP_ChaosItemDropper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChaosItemDropper_C>();
	}
};
DUMPER7_ASSERTS_ABP_ChaosItemDropper_C;

}

