#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosQuest_KillWithinTime

#include "Basic.hpp"

#include "ProjectBlood_classes.hpp"


namespace SDK
{

// DynamicClass BP_ChaosQuest_KillWithinTime.BP_ChaosQuest_KillWithinTime_C
// 0x00F8 (0x06C8 - 0x05D0)
class ABP_ChaosQuest_KillWithinTime_C final : public APBEventObject
{
public:
	class UBP_ChaosQuestUtilities_C*              BP_ChaosQuestUtilities;                            // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APBBaseCharacter*>               EnemiesToKill;                                     // 0x05D8(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	float                                         maxDuration;                                       // 0x05E8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedTime;                                       // 0x05EC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPaused;                                          // 0x05F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F1[0x3];                                      // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_UpdateEnemiesToKill_EnemiesLeft;          // 0x05F4(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class APBBaseCharacter* bpp__deadCharacter__pf)> K2Node_CreateDelegate_OutputDelegate; // 0x05F8(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class APBBaseCharacter*>               CallFunc_GetAllEnemies_Enemies;                    // 0x0608(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0618(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallFunc_UpdateEnemiesToKill_EnemiesLeft1;         // 0x061C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallFunc_UpdateEnemiesToKill_EnemiesLeft2;         // 0x0620(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_624[0x4];                                      // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChaosModeLogic*                        CallFunc_GetChaosModeLogic_ReturnValue;            // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_CustomEvent_deadCharacter1;                 // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChaosQuest*                            CallFunc_GetQuest_ReturnValue;                     // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_CustomEvent_DeadCharacter;                  // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APBBaseCharacter*>               CallFunc_GetAllEnemies_Enemies1;                   // 0x0650(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class APBEventListenerManager*                K2Node_Event_eventManager;                         // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   K2Node_Event_eventKey;                             // 0x0668(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   K2Node_Event_eventSubKey;                          // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                K2Node_Event_eventSender;                          // 0x0678(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0680(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CreateProgressTexts_ReturnValue2;         // 0x0688(0x0018)(Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x06A0(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	class FText                                   CallFunc_CreateProgressTexts_ReturnValue21;        // 0x06B0(0x0018)(Transient, DuplicateTransient, NativeAccessSpecifierPublic)

public:
	void Check_Enemy_Count();
	class FText CreateProgressTexts(class FText* bpp__ReturnValue2__pf);
	int32 GetRegisterdIndex();
	void OnReceiveEvent(class APBEventListenerManager* bpp__eventManager__pf, class FName bpp__eventKey__pf, class FName bpp__eventSubKey__pf, class UObject* bpp__eventSender__pf);
	void On_Death(class APBBaseCharacter* bpp__deadCharacter__pf);
	void ReceiveBeginPlay();
	void ReceiveTick(float bpp__DeltaSeconds__pf);
	void StartEnemiesCount();
	void UpdateDeath(class APBBaseCharacter* bpp__deadCharacter__pf);
	void UpdateEnemiesToKill(int32* bpp__EnemiesLeft__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BP_ChaosQuest_KillWithinTime_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ChaosQuest_KillWithinTime_C")
	}
	static class ABP_ChaosQuest_KillWithinTime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChaosQuest_KillWithinTime_C>();
	}
};
DUMPER7_ASSERTS_ABP_ChaosQuest_KillWithinTime_C;

}

