#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosPlayerController

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function BP_ChaosPlayerController.BP_ChaosPlayerController_C.CameraInfoHasChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_ChaosPlayerController_C_CameraInfoHasChanged final
{
public:
	bool                                          bpp__Changed__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosPlayerController_C_CameraInfoHasChanged;

// Function BP_ChaosPlayerController.BP_ChaosPlayerController_C.CustomEvent
// 0x0014 (0x0014 - 0x0000)
struct BP_ChaosPlayerController_C_CustomEvent final
{
public:
	class FName                                   bpp__OldStep__pf__const;                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__NewStep__pf__const;                           // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__NewStepIsEndStep__pf;                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ChaosPlayerController_C_CustomEvent;

// Function BP_ChaosPlayerController.BP_ChaosPlayerController_C.ExecuteUbergraph_BP_ChaosPlayerController_1
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosPlayerController_C_ExecuteUbergraph_BP_ChaosPlayerController_1 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosPlayerController_C_ExecuteUbergraph_BP_ChaosPlayerController_1;

// Function BP_ChaosPlayerController.BP_ChaosPlayerController_C.ExecuteUbergraph_BP_ChaosPlayerController_3
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosPlayerController_C_ExecuteUbergraph_BP_ChaosPlayerController_3 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosPlayerController_C_ExecuteUbergraph_BP_ChaosPlayerController_3;

// Function BP_ChaosPlayerController.BP_ChaosPlayerController_C.ExecuteUbergraph_BP_ChaosPlayerController_7
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosPlayerController_C_ExecuteUbergraph_BP_ChaosPlayerController_7 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosPlayerController_C_ExecuteUbergraph_BP_ChaosPlayerController_7;

// Function BP_ChaosPlayerController.BP_ChaosPlayerController_C.LOCAL_SpawnCreature
// 0x0018 (0x0018 - 0x0000)
struct BP_ChaosPlayerController_C_LOCAL_SpawnCreature final
{
public:
	class UClass*                                 bpp__Class__pf;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Loc__pf;                                      // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ChaosPlayerController_C_LOCAL_SpawnCreature;

// Function BP_ChaosPlayerController.BP_ChaosPlayerController_C.MULTICAST_SyncCharaTime
// 0x0010 (0x0010 - 0x0000)
struct BP_ChaosPlayerController_C_MULTICAST_SyncCharaTime final
{
public:
	class APBBaseCharacter*                       bpp__character__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__CharaTime__pf;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ChaosPlayerController_C_MULTICAST_SyncCharaTime;

// Function BP_ChaosPlayerController.BP_ChaosPlayerController_C.MULTICAST_UpdateCameraInfo
// 0x0038 (0x0038 - 0x0000)
struct BP_ChaosPlayerController_C_MULTICAST_UpdateCameraInfo final
{
public:
	TArray<struct FVector4>                       bpp__ViewProjMtx__pf__const;                       // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector2D                              bpp__ViewportSize__pf;                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBIntRect                             bpp__ConstrainedViewRect__pf;                      // 0x0018(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                bpp__TargetLocation__pf;                           // 0x0028(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ChaosPlayerController_C_MULTICAST_UpdateCameraInfo;

// Function BP_ChaosPlayerController.BP_ChaosPlayerController_C.RequestSyncCharaTimeForClient
// 0x0010 (0x0010 - 0x0000)
struct BP_ChaosPlayerController_C_RequestSyncCharaTimeForClient final
{
public:
	class APBBaseCharacter*                       bpp__Chara__pf;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__CharaTime__pf;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ChaosPlayerController_C_RequestSyncCharaTimeForClient;

// Function BP_ChaosPlayerController.BP_ChaosPlayerController_C.SERVER_SpawnCreature
// 0x0018 (0x0018 - 0x0000)
struct BP_ChaosPlayerController_C_SERVER_SpawnCreature final
{
public:
	class UClass*                                 bpp__Class__pf;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Loc__pf;                                      // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ChaosPlayerController_C_SERVER_SpawnCreature;

// Function BP_ChaosPlayerController.BP_ChaosPlayerController_C.SERVER_SyncCharaTime
// 0x0010 (0x0010 - 0x0000)
struct BP_ChaosPlayerController_C_SERVER_SyncCharaTime final
{
public:
	class APBBaseCharacter*                       bpp__character__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__CharaTime__pf;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ChaosPlayerController_C_SERVER_SyncCharaTime;

// Function BP_ChaosPlayerController.BP_ChaosPlayerController_C.SERVER_UpdateCameraInfo
// 0x0038 (0x0038 - 0x0000)
struct BP_ChaosPlayerController_C_SERVER_UpdateCameraInfo final
{
public:
	TArray<struct FVector4>                       bpp__ViewProjMtx__pf__const;                       // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector2D                              bpp__ViewportSize__pf;                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBIntRect                             bpp__ConstrainedViewRect__pf;                      // 0x0018(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                bpp__TargetLocation__pf;                           // 0x0028(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ChaosPlayerController_C_SERVER_UpdateCameraInfo;

}

