#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosQuest_ExitInTime

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ChaosQuest_ExitInTime.BP_ChaosQuest_ExitInTime_C.GetRegisterdIndex
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosQuest_ExitInTime_C_GetRegisterdIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosQuest_ExitInTime_C_GetRegisterdIndex;

// Function BP_ChaosQuest_ExitInTime.BP_ChaosQuest_ExitInTime_C.OnReceiveEvent
// 0x0020 (0x0020 - 0x0000)
struct BP_ChaosQuest_ExitInTime_C_OnReceiveEvent final
{
public:
	class APBEventListenerManager*                bpp__eventManager__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__eventKey__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__eventSubKey__pf;                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__eventSender__pf;                              // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosQuest_ExitInTime_C_OnReceiveEvent;

// Function BP_ChaosQuest_ExitInTime.BP_ChaosQuest_ExitInTime_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosQuest_ExitInTime_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosQuest_ExitInTime_C_ReceiveTick;

}

