#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosAutoConsumeBag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ChaosAutoConsumeBag.BP_ChaosAutoConsumeBag_C
// 0x0060 (0x0710 - 0x06B0)
class ABP_ChaosAutoConsumeBag_C : public APBCollectableSkeletalObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBET_OnOverlapPCBox*                   PBET_OnOverlapPCBox;                               // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPBSoundControlComponent*               PBSoundControl;                                    // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       Mid;                                               // 0x06C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         DisappearanceDuration;                             // 0x06D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisappearanceTimer;                                // 0x06DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverLapPC;                                         // 0x06E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       Character;                                         // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GroundCheckTime;                                   // 0x06F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GroundCheckMaxLimit;                               // 0x06F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GroundCheckCurrent;                                // 0x06F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FC[0x4];                                      // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APBBaseCharacter*>               OverlappingCharacters;                             // 0x0700(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_ChaosAutoConsumeBag(int32 EntryPoint);
	void BeginDissappearing(class APBBaseCharacter* CollectingCharacter);
	void ConsumeItem();
	void BndEvt__PBET_OnOverlapPCBox_K2Node_ComponentBoundEvent_1_PBETDelegate_OnOverlapEndPC__DelegateSignature(const struct FPBET_OverlapPCInfo& OverlapPCInfo);
	void RenewIcon();
	void BndEvt__PBET_OnOverlapPCBox_K2Node_ComponentBoundEvent_0_PBETDelegate_OnOverlapPC__DelegateSignature(const struct FPBET_OverlapPCInfo& OverlapPCInfo);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UpdateDisappearance(float DeltaSeconds);
	void StartDisappearance(float Duration);
	void SpawnItemIconEffect(class APBBaseCharacter* Character_0);
	void UpdateItemIconEffect();
	void CanConsume(bool* CanConsume_0);
	bool InVersusMode();
	void GetChaosPlayer(class APBBaseCharacter** Element);
	void GetVersusPlayer(class APBBaseCharacter** Element);
	void ClampToRoomBounds(const struct FVector& Location, const struct FVector& RoomPadding, struct FVector* NewLocation);
	void GetClosestGround(const struct FVector& Location, const struct FVector& Direction, float Check, int32 Intervals, struct FVector* Ground, int32* CheckedIntervals);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ChaosAutoConsumeBag_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ChaosAutoConsumeBag_C")
	}
	static class ABP_ChaosAutoConsumeBag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChaosAutoConsumeBag_C>();
	}
};
DUMPER7_ASSERTS_ABP_ChaosAutoConsumeBag_C;

}

