#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosQuest_KillWithinTime

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ChaosQuest_KillWithinTime.BP_ChaosQuest_KillWithinTime_C.CreateProgressTexts
// 0x0030 (0x0030 - 0x0000)
struct BP_ChaosQuest_KillWithinTime_C_CreateProgressTexts final
{
public:
	class FText                                   bpp__ReturnValue2__pf;                             // 0x0000(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosQuest_KillWithinTime_C_CreateProgressTexts;

// Function BP_ChaosQuest_KillWithinTime.BP_ChaosQuest_KillWithinTime_C.GetRegisterdIndex
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosQuest_KillWithinTime_C_GetRegisterdIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosQuest_KillWithinTime_C_GetRegisterdIndex;

// Function BP_ChaosQuest_KillWithinTime.BP_ChaosQuest_KillWithinTime_C.OnReceiveEvent
// 0x0020 (0x0020 - 0x0000)
struct BP_ChaosQuest_KillWithinTime_C_OnReceiveEvent final
{
public:
	class APBEventListenerManager*                bpp__eventManager__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__eventKey__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__eventSubKey__pf;                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__eventSender__pf;                              // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosQuest_KillWithinTime_C_OnReceiveEvent;

// Function BP_ChaosQuest_KillWithinTime.BP_ChaosQuest_KillWithinTime_C.On Death
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosQuest_KillWithinTime_C_On_Death final
{
public:
	class APBBaseCharacter*                       bpp__deadCharacter__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosQuest_KillWithinTime_C_On_Death;

// Function BP_ChaosQuest_KillWithinTime.BP_ChaosQuest_KillWithinTime_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosQuest_KillWithinTime_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosQuest_KillWithinTime_C_ReceiveTick;

// Function BP_ChaosQuest_KillWithinTime.BP_ChaosQuest_KillWithinTime_C.UpdateDeath
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosQuest_KillWithinTime_C_UpdateDeath final
{
public:
	class APBBaseCharacter*                       bpp__deadCharacter__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosQuest_KillWithinTime_C_UpdateDeath;

// Function BP_ChaosQuest_KillWithinTime.BP_ChaosQuest_KillWithinTime_C.UpdateEnemiesToKill
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosQuest_KillWithinTime_C_UpdateEnemiesToKill final
{
public:
	int32                                         bpp__EnemiesLeft__pf;                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosQuest_KillWithinTime_C_UpdateEnemiesToKill;

}

