#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosItemSwap

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function BP_ChaosItemSwap.BP_ChaosItemSwap_C.Begin Swap
// 0x0010 (0x0010 - 0x0000)
struct BP_ChaosItemSwap_C_Begin_Swap final
{
public:
	class APBBaseCharacter*                       bpp__character__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__TableRow__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemSwap_C_Begin_Swap;

// Function BP_ChaosItemSwap.BP_ChaosItemSwap_C.Begin Swap With Preset Item
// 0x0010 (0x0010 - 0x0000)
struct BP_ChaosItemSwap_C_Begin_Swap_With_Preset_Item final
{
public:
	class APBBaseCharacter*                       bpp__character__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__TableRow__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemSwap_C_Begin_Swap_With_Preset_Item;

// Function BP_ChaosItemSwap.BP_ChaosItemSwap_C.DisableChaosItemSwaps
// 0x0001 (0x0001 - 0x0000)
struct BP_ChaosItemSwap_C_DisableChaosItemSwaps final
{
public:
	bool                                          bpp__Disable__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemSwap_C_DisableChaosItemSwaps;

// Function BP_ChaosItemSwap.BP_ChaosItemSwap_C.ExecuteUbergraph_BP_ChaosItemSwap_1
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosItemSwap_C_ExecuteUbergraph_BP_ChaosItemSwap_1 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemSwap_C_ExecuteUbergraph_BP_ChaosItemSwap_1;

// Function BP_ChaosItemSwap.BP_ChaosItemSwap_C.GetPopupSwapText
// 0x0018 (0x0018 - 0x0000)
struct BP_ChaosItemSwap_C_GetPopupSwapText final
{
public:
	class FText                                   bpp__PopupSwapText__pf;                            // 0x0000(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemSwap_C_GetPopupSwapText;

// Function BP_ChaosItemSwap.BP_ChaosItemSwap_C.GetProposedItem
// 0x000C (0x000C - 0x0000)
struct BP_ChaosItemSwap_C_GetProposedItem final
{
public:
	class FName                                   bpp__ItemName__pf;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               bpp__ItemType__pf;                                 // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ChaosItemSwap_C_GetProposedItem;

// Function BP_ChaosItemSwap.BP_ChaosItemSwap_C.InitializeItem
// 0x0010 (0x0010 - 0x0000)
struct BP_ChaosItemSwap_C_InitializeItem final
{
public:
	class APBBaseCharacter*                       bpp__character__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__TableRow__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemSwap_C_InitializeItem;

// Function BP_ChaosItemSwap.BP_ChaosItemSwap_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosItemSwap_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemSwap_C_ReceiveTick;

}

