#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosQuest_NoAttack

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// DynamicClass BP_ChaosQuest_NoAttack.BP_ChaosQuest_NoAttack_C
// 0x0030 (0x04B8 - 0x0488)
class ABP_ChaosQuest_NoAttack_C final : public AActor
{
public:
	class UBP_ChaosQuestUtilities_C*              BP_ChaosQuestUtilities;                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_CustomEvent_attackingCharacter;             // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_CustomEvent_receivingCharacter;             // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class APBBaseCharacter* bpp__attackingCharacter__pf, class APBBaseCharacter* bpp__receivingCharacter__pf)> K2Node_CreateDelegate_OutputDelegate; // 0x04A8(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)

public:
	void On_Damage_Dealt(class APBBaseCharacter* bpp__attackingCharacter__pf, class APBBaseCharacter* bpp__receivingCharacter__pf);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BP_ChaosQuest_NoAttack_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ChaosQuest_NoAttack_C")
	}
	static class ABP_ChaosQuest_NoAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChaosQuest_NoAttack_C>();
	}
};
DUMPER7_ASSERTS_ABP_ChaosQuest_NoAttack_C;

}

