#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosTreasureBox

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ChaosTreasureBox.BP_ChaosTreasureBox_C.Chaos Version Give Item
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosTreasureBox_C_Chaos_Version_Give_Item final
{
public:
	class APBBaseCharacter*                       bpp__character__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosTreasureBox_C_Chaos_Version_Give_Item;

// Function BP_ChaosTreasureBox.BP_ChaosTreasureBox_C.CreateSwapInfoWidget
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosTreasureBox_C_CreateSwapInfoWidget final
{
public:
	class APBBaseCharacter*                       bpp__character__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosTreasureBox_C_CreateSwapInfoWidget;

// Function BP_ChaosTreasureBox.BP_ChaosTreasureBox_C.GetRandomItem
// 0x0028 (0x0028 - 0x0000)
struct BP_ChaosTreasureBox_C_GetRandomItem final
{
public:
	TArray<class FName>                           bpp__ItemNames__pf;                                // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 bpp__ItemProbabilities__pf;                        // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   bpp__RandomItem__pf;                               // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosTreasureBox_C_GetRandomItem;

// Function BP_ChaosTreasureBox.BP_ChaosTreasureBox_C.GetTableRow
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosTreasureBox_C_GetTableRow final
{
public:
	class FName                                   bpp__TableRow__pf;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosTreasureBox_C_GetTableRow;

}

