#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosWarp

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "BP_BossRush_Warp_classes.hpp"


namespace SDK
{

// DynamicClass BP_ChaosWarp.BP_ChaosWarp_C
// 0x0140 (0x09E0 - 0x08A0)
class ABP_ChaosWarp_C final : public ABP_BossRush_Warp_C
{
public:
	class FName                                   DevNextlevelName;                                  // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Succeed;                                           // 0x08A8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A9[0x7];                                      // 0x08A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_UpButton_C*                        UpButtonWidget_P3;                                 // 0x08B0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          QuestFailure;                                      // 0x08B8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8B9[0x7];                                      // 0x08B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            WaitingWidget;                                     // 0x08C0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBET_OverlapPCInfo                    K2Node_ComponentBoundEvent_OverlapPCInfo1_BP_ChaosWarp_C; // 0x08C8(0x0038)(Transient, DuplicateTransient, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FPBET_OverlapPCInfo                    K2Node_ComponentBoundEvent_OverlapPCInfo_BP_ChaosWarp_C; // 0x0900(0x0038)(Transient, DuplicateTransient, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         CallFunc_GetPlayerIndex_Index;                     // 0x0938(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CallFunc_GetPlayerIndex_Index1;                    // 0x0939(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_93A[0x2];                                      // 0x093A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_BP_ChaosWarp_C;             // 0x093C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CallFunc_BreakVector_Y_BP_ChaosWarp_C;             // 0x0940(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CallFunc_BreakVector_Z_BP_ChaosWarp_C;             // 0x0944(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallFunc_SpawnEffect_EffectManageID_BP_ChaosWarp_C; // 0x0948(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94C[0x4];                                      // 0x094C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBParticle*                            CallFunc_SpawnEffect_EffectRef_BP_ChaosWarp_C;     // 0x0950(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0958(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChaosModeLogic*                        CallFunc_GetChaosModeLogic_ReturnValue;            // 0x0960(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ABP_ChaosQuestManager_C*>        CallFunc_GetAllActorsOfClass_OutActors;            // 0x0968(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class ABP_ChaosQuestManager_C*                CallFunc_Array_Get_Item;                           // 0x0978(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Temp_text_Variable;                                // 0x0980(0x0018)(Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0998(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0999(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99A[0x6];                                      // 0x099A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       K2Node_DynamicCast_AsPBBase_Character_BP_ChaosWarp_C; // 0x09A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess_BP_ChaosWarp_C;        // 0x09A8(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9A9[0x7];                                      // 0x09A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ChaosQuestManager_C*>        CallFunc_GetAllActorsOfClass_OutActors1;           // 0x09B0(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class ABP_ChaosQuestManager_C*                CallFunc_Array_Get_Item1;                          // 0x09C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ABP_ChaosQuestManager_C*>        CallFunc_GetAllActorsOfClass_OutActors2;           // 0x09C8(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class ABP_ChaosQuestManager_C*                CallFunc_Array_Get_Item2;                          // 0x09D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void CallWarp();
	void ExecuteUbergraph_BP_ChaosWarp_0(int32 bpp__EntryPoint__pf);
	void GetPlayerIndex(class APBBaseCharacter* bpp__Player__pf, uint8* bpp__Index__pf);
	void SetUpButtonVisible_P3(bool bpp__Visible__pf, class APBBaseCharacter* bpp__ParentPlayer__pf);
	void StopShardPickupWidgets();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BP_ChaosWarp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ChaosWarp_C")
	}
	static class ABP_ChaosWarp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChaosWarp_C>();
	}
};
DUMPER7_ASSERTS_ABP_ChaosWarp_C;

}

