#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NetActionManager

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function BP_NetActionManager.BP_NetActionManager_C.GetPBCharacter
// 0x0010 (0x0010 - 0x0000)
struct BP_NetActionManager_C_GetPBCharacter final
{
public:
	class APBBaseCharacter*                       bpp__character__pf;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsValid__pf;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_NetActionManager_C_GetPBCharacter;

// Function BP_NetActionManager.BP_NetActionManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_NetActionManager_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_NetActionManager_C_ReceiveTick;

// Function BP_NetActionManager.BP_NetActionManager_C.SetNetStep
// 0x0001 (0x0001 - 0x0000)
struct BP_NetActionManager_C_SetNetStep final
{
public:
	EPBStep                                       bpp__NewStep__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_NetActionManager_C_SetNetStep;

}

