#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_Dialogue

#include "Basic.hpp"

#include "EDialogueInputType_structs.hpp"
#include "DialogueSpeakerAttribute_TableItem_structs.hpp"
#include "Dialogue_TableItem_structs.hpp"
#include "NamedAsset_structs.hpp"


namespace SDK::Params
{

// Function BPC_Dialogue.BPC_Dialogue_C.ChangeHost
// 0x0020 (0x0020 - 0x0000)
struct BPC_Dialogue_C_ChangeHost final
{
public:
	class UObject*                                bpp__NewHost__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BranchName__pf;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      bpp__PC__pf;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Success__pf;                                  // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPC_Dialogue_C_ChangeHost;

// Function BPC_Dialogue.BPC_Dialogue_C.Clear
// 0x0001 (0x0001 - 0x0000)
struct BPC_Dialogue_C_Clear final
{
public:
	bool                                          bpp__ClearxFailed__pfT;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_Clear;

// Function BPC_Dialogue.BPC_Dialogue_C.DisplayUI
// 0x0008 (0x0008 - 0x0000)
struct BPC_Dialogue_C_DisplayUI final
{
public:
	class APlayerController*                      bpp__PC__pf;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_DisplayUI;

// Function BPC_Dialogue.BPC_Dialogue_C.ExecuteUbergraph_BPC_Dialogue_1
// 0x0004 (0x0004 - 0x0000)
struct BPC_Dialogue_C_ExecuteUbergraph_BPC_Dialogue_1 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_ExecuteUbergraph_BPC_Dialogue_1;

// Function BPC_Dialogue.BPC_Dialogue_C.Exit
// 0x0002 (0x0002 - 0x0000)
struct BPC_Dialogue_C_Exit final
{
public:
	bool                                          bpp__ExitSelfOnly__pf;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ExitxFailed__pfT;                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_Exit;

// Function BPC_Dialogue.BPC_Dialogue_C.ExtractDialogueBranchHost
// 0x0020 (0x0020 - 0x0000)
struct BPC_Dialogue_C_ExtractDialogueBranchHost final
{
public:
	class FString                                 bpp__RawBranch__pf__const;                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__Host__pf;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Branch__pf;                                   // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_ExtractDialogueBranchHost;

// Function BPC_Dialogue.BPC_Dialogue_C.FormatError_AssetNotFoundOrInvalid
// 0x0028 (0x0028 - 0x0000)
struct BPC_Dialogue_C_FormatError_AssetNotFoundOrInvalid final
{
public:
	class FString                                 bpp__AssetName__pf__const;                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__funcName__pf;                                 // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__Result__pf;                                   // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_FormatError_AssetNotFoundOrInvalid;

// Function BPC_Dialogue.BPC_Dialogue_C.FormatError_MissingArg
// 0x0030 (0x0030 - 0x0000)
struct BPC_Dialogue_C_FormatError_MissingArg final
{
public:
	class FString                                 bpp__argName__pf__const;                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__funcName__pf;                                 // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__ArgNumber__pf;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 bpp__Result__pf;                                   // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_FormatError_MissingArg;

// Function BPC_Dialogue.BPC_Dialogue_C.GetActualInputType
// 0x0001 (0x0001 - 0x0000)
struct BPC_Dialogue_C_GetActualInputType final
{
public:
	EDialogueInputType                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_GetActualInputType;

// Function BPC_Dialogue.BPC_Dialogue_C.GetAsset
// 0x0020 (0x0020 - 0x0000)
struct BPC_Dialogue_C_GetAsset final
{
public:
	class FName                                   bpp__ItemName__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNamedAsset                            bpp__AssetReference__pf;                           // 0x0008(0x0010)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Found__pf;                                    // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPC_Dialogue_C_GetAsset;

// Function BPC_Dialogue.BPC_Dialogue_C.GetDialogueItem
// 0x00A0 (0x00A0 - 0x0000)
struct BPC_Dialogue_C_GetDialogueItem final
{
public:
	class FName                                   bpp__ItemName__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDialogue_TableItem                    bpp__Item__pf;                                     // 0x0008(0x0090)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bpp__Found__pf;                                    // 0x0098(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPC_Dialogue_C_GetDialogueItem;

// Function BPC_Dialogue.BPC_Dialogue_C.GetDialogueItem_Func
// 0x00A0 (0x00A0 - 0x0000)
struct BPC_Dialogue_C_GetDialogueItem_Func final
{
public:
	class FName                                   bpp__ItemName__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDialogue_TableItem                    bpp__Item__pf;                                     // 0x0008(0x0090)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bpp__Found__pf;                                    // 0x0098(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPC_Dialogue_C_GetDialogueItem_Func;

// Function BPC_Dialogue.BPC_Dialogue_C.GetDialogueRowNames
// 0x0010 (0x0010 - 0x0000)
struct BPC_Dialogue_C_GetDialogueRowNames final
{
public:
	TArray<class FName>                           bpp__Names__pf;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_GetDialogueRowNames;

// Function BPC_Dialogue.BPC_Dialogue_C.GetDialogueRowNames_Func
// 0x0010 (0x0010 - 0x0000)
struct BPC_Dialogue_C_GetDialogueRowNames_Func final
{
public:
	TArray<class FName>                           bpp__Names__pf;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_GetDialogueRowNames_Func;

// Function BPC_Dialogue.BPC_Dialogue_C.GetNextState
// 0x0010 (0x0010 - 0x0000)
struct BPC_Dialogue_C_GetNextState final
{
public:
	class FName                                   bpp__RequestState__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Flow__pf;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_GetNextState;

// Function BPC_Dialogue.BPC_Dialogue_C.GetScriptInterpreter
// 0x0008 (0x0008 - 0x0000)
struct BPC_Dialogue_C_GetScriptInterpreter final
{
public:
	class ABP_ScriptInterpreter_C*                bpp__Interpreter__pf;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_GetScriptInterpreter;

// Function BPC_Dialogue.BPC_Dialogue_C.GetScriptInterpreter_Func
// 0x0008 (0x0008 - 0x0000)
struct BPC_Dialogue_C_GetScriptInterpreter_Func final
{
public:
	class ABP_ScriptInterpreter_C*                bpp__Interpreter__pf;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_GetScriptInterpreter_Func;

// Function BPC_Dialogue.BPC_Dialogue_C.GetSpeakerAttributes
// 0x0038 (0x0038 - 0x0000)
struct BPC_Dialogue_C_GetSpeakerAttributes final
{
public:
	class FName                                   bpp__SpeakerID__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDialogueSpeakerAttribute_TableItem    bpp__Result__pf;                                   // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bpp__Found__pf;                                    // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPC_Dialogue_C_GetSpeakerAttributes;

// Function BPC_Dialogue.BPC_Dialogue_C.GetSpeakerAttributes_Func
// 0x0038 (0x0038 - 0x0000)
struct BPC_Dialogue_C_GetSpeakerAttributes_Func final
{
public:
	class FName                                   bpp__SpeakerID__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDialogueSpeakerAttribute_TableItem    bpp__Result__pf;                                   // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bpp__Found__pf;                                    // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPC_Dialogue_C_GetSpeakerAttributes_Func;

// Function BPC_Dialogue.BPC_Dialogue_C.GetUseCondition
// 0x0028 (0x0028 - 0x0000)
struct BPC_Dialogue_C_GetUseCondition final
{
public:
	class FString                                 bpp__Key__pf__const;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__ConditionString__pf;                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Found__pf;                                    // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__Index__pf;                                    // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_GetUseCondition;

// Function BPC_Dialogue.BPC_Dialogue_C.HandleScriptFunction
// 0x0028 (0x0028 - 0x0000)
struct BPC_Dialogue_C_HandleScriptFunction final
{
public:
	class FName                                   bpp__Function__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         bpp__Args__pf;                                     // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 bpp__Result__pf;                                   // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_HandleScriptFunction;

// Function BPC_Dialogue.BPC_Dialogue_C.HandleScriptFunction_Func
// 0x0028 (0x0028 - 0x0000)
struct BPC_Dialogue_C_HandleScriptFunction_Func final
{
public:
	class FName                                   bpp__Function__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         bpp__Args__pf;                                     // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 bpp__Result__pf;                                   // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_HandleScriptFunction_Func;

// Function BPC_Dialogue.BPC_Dialogue_C.IsTopicActive
// 0x0001 (0x0001 - 0x0000)
struct BPC_Dialogue_C_IsTopicActive final
{
public:
	bool                                          bpp__Active__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_IsTopicActive;

// Function BPC_Dialogue.BPC_Dialogue_C.OnReceiveResponse
// 0x0028 (0x0028 - 0x0000)
struct BPC_Dialogue_C_OnReceiveResponse final
{
public:
	int32                                         bpp__ResponseIdx__pf;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BranchName__pf;                               // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp__BranchHost__pf;                               // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      bpp__PC__pf;                                       // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Failed__pf;                                   // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPC_Dialogue_C_OnReceiveResponse;

// Function BPC_Dialogue.BPC_Dialogue_C.OnStateChanged
// 0x0020 (0x0020 - 0x0000)
struct BPC_Dialogue_C_OnStateChanged final
{
public:
	class FName                                   bpp__To__pf;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__From__pf;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      bpp__PC__pf;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ValidToProcess__pf;                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPC_Dialogue_C_OnStateChanged;

// Function BPC_Dialogue.BPC_Dialogue_C.ParseStateName
// 0x0014 (0x0014 - 0x0000)
struct BPC_Dialogue_C_ParseStateName final
{
public:
	class FName                                   bpp__FullStateName__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BranchName__pf;                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__PartNumber__pf;                               // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_ParseStateName;

// Function BPC_Dialogue.BPC_Dialogue_C.PopPreviousState
// 0x0008 (0x0008 - 0x0000)
struct BPC_Dialogue_C_PopPreviousState final
{
public:
	class FName                                   bpp__Found__pf;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_PopPreviousState;

// Function BPC_Dialogue.BPC_Dialogue_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPC_Dialogue_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_ReceiveTick;

// Function BPC_Dialogue.BPC_Dialogue_C.RemoveUseCondition
// 0x0010 (0x0010 - 0x0000)
struct BPC_Dialogue_C_RemoveUseCondition final
{
public:
	class FString                                 bpp__Key__pf__const;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_RemoveUseCondition;

// Function BPC_Dialogue.BPC_Dialogue_C.SetInputType
// 0x0010 (0x0010 - 0x0000)
struct BPC_Dialogue_C_SetInputType final
{
public:
	EDialogueInputType                            bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ForceUpdate__pf;                              // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      bpp__PC__pf;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_SetInputType;

// Function BPC_Dialogue.BPC_Dialogue_C.SetSkipDialogue
// 0x0001 (0x0001 - 0x0000)
struct BPC_Dialogue_C_SetSkipDialogue final
{
public:
	bool                                          bpp__DoSkip__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_SetSkipDialogue;

// Function BPC_Dialogue.BPC_Dialogue_C.SetState
// 0x0020 (0x0020 - 0x0000)
struct BPC_Dialogue_C_SetState final
{
public:
	class FName                                   bpp__NewxFlow__pfT;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Force__pf;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      bpp__PC__pf;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IgnoreCurrentStateInHistory__pf;              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__NewParam__pf;                                 // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPC_Dialogue_C_SetState;

// Function BPC_Dialogue.BPC_Dialogue_C.SetUseCondition
// 0x0020 (0x0020 - 0x0000)
struct BPC_Dialogue_C_SetUseCondition final
{
public:
	class FString                                 bpp__Key__pf__const;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__Condition__pf__const;                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_SetUseCondition;

// Function BPC_Dialogue.BPC_Dialogue_C.Use_Func
// 0x0008 (0x0008 - 0x0000)
struct BPC_Dialogue_C_Use_Func final
{
public:
	class APlayerController*                      bpp__PC__pf;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPC_Dialogue_C_Use_Func;

}

