#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_DialogueDatatableHost

#include "Basic.hpp"

#include "DialogueSpeakerAttribute_TableItem_structs.hpp"
#include "Dialogue_TableItem_structs.hpp"
#include "NamedAsset_structs.hpp"


namespace SDK::Params
{

// Function BPI_DialogueDatatableHost.BPI_DialogueDatatableHost_C.GetAsset
// 0x0020 (0x0020 - 0x0000)
struct BPI_DialogueDatatableHost_C_GetAsset final
{
public:
	class FName                                   bpp__ItemName__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNamedAsset                            bpp__AssetReference__pf;                           // 0x0008(0x0010)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Found__pf;                                    // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPI_DialogueDatatableHost_C_GetAsset;

// Function BPI_DialogueDatatableHost.BPI_DialogueDatatableHost_C.GetDialogueItem
// 0x00A0 (0x00A0 - 0x0000)
struct BPI_DialogueDatatableHost_C_GetDialogueItem final
{
public:
	class FName                                   bpp__ItemName__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDialogue_TableItem                    bpp__Item__pf;                                     // 0x0008(0x0090)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bpp__Found__pf;                                    // 0x0098(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPI_DialogueDatatableHost_C_GetDialogueItem;

// Function BPI_DialogueDatatableHost.BPI_DialogueDatatableHost_C.GetDialogueRowNames
// 0x0010 (0x0010 - 0x0000)
struct BPI_DialogueDatatableHost_C_GetDialogueRowNames final
{
public:
	TArray<class FName>                           bpp__Names__pf;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPI_DialogueDatatableHost_C_GetDialogueRowNames;

// Function BPI_DialogueDatatableHost.BPI_DialogueDatatableHost_C.GetScriptInterpreter
// 0x0008 (0x0008 - 0x0000)
struct BPI_DialogueDatatableHost_C_GetScriptInterpreter final
{
public:
	class ABP_ScriptInterpreter_C*                bpp__Interpreter__pf;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPI_DialogueDatatableHost_C_GetScriptInterpreter;

// Function BPI_DialogueDatatableHost.BPI_DialogueDatatableHost_C.GetSpeakerAttributes
// 0x0038 (0x0038 - 0x0000)
struct BPI_DialogueDatatableHost_C_GetSpeakerAttributes final
{
public:
	class FName                                   bpp__SpeakerID__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDialogueSpeakerAttribute_TableItem    bpp__Result__pf;                                   // 0x0008(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bpp__Found__pf;                                    // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPI_DialogueDatatableHost_C_GetSpeakerAttributes;

}

