#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_DialogueResponseHandler

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_DialogueResponseHandler.BPI_DialogueResponseHandler_C.ExtractDialogueBranchHost
// 0x0020 (0x0020 - 0x0000)
struct BPI_DialogueResponseHandler_C_ExtractDialogueBranchHost final
{
public:
	class FString                                 bpp__RawBranch__pf__const;                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__Host__pf;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Branch__pf;                                   // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPI_DialogueResponseHandler_C_ExtractDialogueBranchHost;

// Function BPI_DialogueResponseHandler.BPI_DialogueResponseHandler_C.IsTopicActive
// 0x0001 (0x0001 - 0x0000)
struct BPI_DialogueResponseHandler_C_IsTopicActive final
{
public:
	bool                                          bpp__Active__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPI_DialogueResponseHandler_C_IsTopicActive;

// Function BPI_DialogueResponseHandler.BPI_DialogueResponseHandler_C.OnReceiveResponse
// 0x0028 (0x0028 - 0x0000)
struct BPI_DialogueResponseHandler_C_OnReceiveResponse final
{
public:
	int32                                         bpp__ResponseIdx__pf;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BranchName__pf;                               // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp__BranchHost__pf;                               // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      bpp__PC__pf;                                       // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Failed__pf;                                   // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPI_DialogueResponseHandler_C_OnReceiveResponse;

}

