#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_PlayerRoot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "PB_ST_ShardInfo_structs.hpp"


namespace SDK::Params
{

// Function Bullet_PlayerRoot.Bullet_PlayerRoot_C.CheckOutScreen
// 0x000C (0x000C - 0x0000)
struct Bullet_PlayerRoot_C_CheckOutScreen final
{
public:
	float                                         bpp__ScreenOutRateX__pf;                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__ScreenOutRateY__pf;                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ScreenOut__pf;                                // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Bullet_PlayerRoot_C_CheckOutScreen;

// Function Bullet_PlayerRoot.Bullet_PlayerRoot_C.GetDirectionalHandDirection
// 0x000C (0x000C - 0x0000)
struct Bullet_PlayerRoot_C_GetDirectionalHandDirection final
{
public:
	struct FVector                                bpp__Direction__pf;                                // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_PlayerRoot_C_GetDirectionalHandDirection;

// Function Bullet_PlayerRoot.Bullet_PlayerRoot_C.GetDirectionalHandWorldLocation
// 0x000C (0x000C - 0x0000)
struct Bullet_PlayerRoot_C_GetDirectionalHandWorldLocation final
{
public:
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_PlayerRoot_C_GetDirectionalHandWorldLocation;

// Function Bullet_PlayerRoot.Bullet_PlayerRoot_C.GetOutScreen
// 0x0001 (0x0001 - 0x0000)
struct Bullet_PlayerRoot_C_GetOutScreen final
{
public:
	bool                                          bpp__IsOutScreen__pf;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_PlayerRoot_C_GetOutScreen;

// Function Bullet_PlayerRoot.Bullet_PlayerRoot_C.GetShardInfo
// 0x0048 (0x0048 - 0x0000)
struct Bullet_PlayerRoot_C_GetShardInfo final
{
public:
	EShardType                                    bpp__ShardType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPB_ST_ShardInfo                       bpp__ShardInfo__pf;                                // 0x0004(0x0044)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_PlayerRoot_C_GetShardInfo;

// Function Bullet_PlayerRoot.Bullet_PlayerRoot_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Bullet_PlayerRoot_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                bpp__EndPlayReason__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_PlayerRoot_C_ReceiveEndPlay;

// Function Bullet_PlayerRoot.Bullet_PlayerRoot_C.SetScale
// 0x000C (0x000C - 0x0000)
struct Bullet_PlayerRoot_C_SetScale final
{
public:
	struct FVector                                bpp__Scale__pf;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_PlayerRoot_C_SetScale;

}

