#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosMode_FilterSelectionButtons

#include "Basic.hpp"


namespace SDK::Params
{

// Function ChaosMode_FilterSelectionButtons.ChaosMode_FilterSelectionButtons_C.ExecuteUbergraph_ChaosMode_FilterSelectionButtons
// 0x0028 (0x0028 - 0x0000)
struct ChaosMode_FilterSelectionButtons_C_ExecuteUbergraph_ChaosMode_FilterSelectionButtons final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ChaosMode_FilterSelectionButtons_C_ExecuteUbergraph_ChaosMode_FilterSelectionButtons;

// Function ChaosMode_FilterSelectionButtons.ChaosMode_FilterSelectionButtons_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ChaosMode_FilterSelectionButtons_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ChaosMode_FilterSelectionButtons_C_PreConstruct;

// Function ChaosMode_FilterSelectionButtons.ChaosMode_FilterSelectionButtons_C.SetDispCursor
// 0x0018 (0x0018 - 0x0000)
struct ChaosMode_FilterSelectionButtons_C_SetDispCursor final
{
public:
	bool                                          InDisp;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ChaosMode_FilterSelectionButtons_C_SetDispCursor;

}

