#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChildOfLightItemSelectMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChildOfLightItemSelectMenu.ChildOfLightItemSelectMenu_C
// 0x0040 (0x02B8 - 0x0278)
class UChildOfLightItemSelectMenu_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInventoryItemListView_C*               CommonItemSelectView;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Header;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MenuBg;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           OptionBox;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_C*                            MainMenu;                                          // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedIdx;                                       // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarriedCatalog                               MenuShardType;                                     // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeVisible;                                       // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChildOfLightItemSelectMenu(int32 EntryPoint);
	void BndEvt__CommonItemSelectView_K2Node_ComponentBoundEvent_2_OnCurrentSelectionChanged__DelegateSignature(const struct FPBItemCatalogData& itemData);
	void BndEvt__CommonItemSelectView_K2Node_ComponentBoundEvent_1_OnCancel__DelegateSignature();
	void BndEvt__CommonItemSelectView_K2Node_ComponentBoundEvent_0_OnConfirmSelection__DelegateSignature(const struct FPBItemCatalogData& itemData);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Initialize(ECarriedCatalog ItemType, const class FText& HeaderText);
	void SetMainMenu(class UMainMenu_C* MainMenuIn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ChildOfLightItemSelectMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChildOfLightItemSelectMenu_C")
	}
	static class UChildOfLightItemSelectMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChildOfLightItemSelectMenu_C>();
	}
};
DUMPER7_ASSERTS_UChildOfLightItemSelectMenu_C;

}

