#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChildOfLightGameflowMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ChildOfLightGameflowMenuEnum_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChildOfLightGameflowMenu.ChildOfLightGameflowMenu_C
// 0x0090 (0x0308 - 0x0278)
class UChildOfLightGameflowMenu_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeInInstantBG;                                   // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Dismiss;                                           // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Bg;                                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PoemLinesListBox;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnClosed;                                          // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EChildOfLightGameflowMenuEnum                 CurrentStateType;                                  // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         TextInLinesdeleteme;                               // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          NewVar_0;                                          // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     TextLines;                                         // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         CurrentLineIndex;                                  // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentLineTime;                                   // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LineFadeTime;                                      // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalLineTime;                                     // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextColor;                                         // 0x02F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChildOfLightGameflowMenu(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BeginDismiss();
	void BeginShow(EChildOfLightGameflowMenuEnum stateType, bool IsInstantShow);
	void OnFadeInComplete();
	void OnDismissFinished();
	void OnPressedButton();
	void Construct();
	void SetState(EChildOfLightGameflowMenuEnum State);
	void GetTextForEvent(EChildOfLightGameflowMenuEnum stateType, class FText* EventText);
	void SetAlpha(class UTextBlock* Target, float InColorAndOpacity_Specified_Color_A);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ChildOfLightGameflowMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChildOfLightGameflowMenu_C")
	}
	static class UChildOfLightGameflowMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChildOfLightGameflowMenu_C>();
	}
};
DUMPER7_ASSERTS_UChildOfLightGameflowMenu_C;

}

