#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChildOfLightItemSelectMenu

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ChildOfLightItemSelectMenu.ChildOfLightItemSelectMenu_C.ExecuteUbergraph_ChildOfLightItemSelectMenu
// 0x0200 (0x0200 - 0x0000)
struct ChildOfLightItemSelectMenu_C_ExecuteUbergraph_ChildOfLightItemSelectMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemCatalogData                     K2Node_ComponentBoundEvent_ItemData1;              // 0x0048(0x0078)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBItemCatalogData                     K2Node_ComponentBoundEvent_ItemData;               // 0x00C8(0x0078)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue1;         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable1;                             // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemCatalogData                     CallFunc_EquipToCurrentShortcut_ReturnValue;       // 0x0188(0x0078)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ChildOfLightItemSelectMenu_C_ExecuteUbergraph_ChildOfLightItemSelectMenu;

// Function ChildOfLightItemSelectMenu.ChildOfLightItemSelectMenu_C.BndEvt__CommonItemSelectView_K2Node_ComponentBoundEvent_2_OnCurrentSelectionChanged__DelegateSignature
// 0x0078 (0x0078 - 0x0000)
struct ChildOfLightItemSelectMenu_C_BndEvt__CommonItemSelectView_K2Node_ComponentBoundEvent_2_OnCurrentSelectionChanged__DelegateSignature final
{
public:
	struct FPBItemCatalogData                     itemData;                                          // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ChildOfLightItemSelectMenu_C_BndEvt__CommonItemSelectView_K2Node_ComponentBoundEvent_2_OnCurrentSelectionChanged__DelegateSignature;

// Function ChildOfLightItemSelectMenu.ChildOfLightItemSelectMenu_C.BndEvt__CommonItemSelectView_K2Node_ComponentBoundEvent_0_OnConfirmSelection__DelegateSignature
// 0x0078 (0x0078 - 0x0000)
struct ChildOfLightItemSelectMenu_C_BndEvt__CommonItemSelectView_K2Node_ComponentBoundEvent_0_OnConfirmSelection__DelegateSignature final
{
public:
	struct FPBItemCatalogData                     itemData;                                          // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ChildOfLightItemSelectMenu_C_BndEvt__CommonItemSelectView_K2Node_ComponentBoundEvent_0_OnConfirmSelection__DelegateSignature;

// Function ChildOfLightItemSelectMenu.ChildOfLightItemSelectMenu_C.Tick
// 0x003C (0x003C - 0x0000)
struct ChildOfLightItemSelectMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ChildOfLightItemSelectMenu_C_Tick;

// Function ChildOfLightItemSelectMenu.ChildOfLightItemSelectMenu_C.Initialize
// 0x0140 (0x0140 - 0x0000)
struct ChildOfLightItemSelectMenu_C_Initialize final
{
public:
	ECarriedCatalog                               ItemType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HeaderText;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UChildOfLightItemSelectOption_C*        LoopMenuItem;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemCatalogData                     ShardLoopItemData;                                 // 0x0028(0x0078)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         PlayerInventory;                                   // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MenuListIdx;                                       // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBItemCatalogData                     CallFunc_GetEquipItemDataById_ret;                 // 0x00B0(0x0078)(HasGetValueTypeHash)
	TArray<struct FPBItemCatalogData>             CallFunc_GetAllMyEquip_ret;                        // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ChildOfLightItemSelectMenu_C_Initialize;

// Function ChildOfLightItemSelectMenu.ChildOfLightItemSelectMenu_C.SetMainMenu
// 0x0008 (0x0008 - 0x0000)
struct ChildOfLightItemSelectMenu_C_SetMainMenu final
{
public:
	class UMainMenu_C*                            MainMenuIn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ChildOfLightItemSelectMenu_C_SetMainMenu;

}

