#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chr_P0000

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "PB_ST_ShardChangeInfo_structs.hpp"
#include "RemoteStepTrigger_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Chr_P0000.Chr_P0000_C.ChrInfo_GetShardInfo
// 0x0030 (0x0030 - 0x0000)
struct Chr_P0000_C_ChrInfo_GetShardInfo final
{
public:
	EShardType                                    bpp__ShardType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsEquip__pf;                                  // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPB_ST_ShardChangeInfo                 bpp__ShardInfo__pf;                                // 0x0004(0x002C)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_ChrInfo_GetShardInfo;

// Function Chr_P0000.Chr_P0000_C.ChrInfo_SetShardBuffer
// 0x005C (0x005C - 0x0000)
struct Chr_P0000_C_ChrInfo_SetShardBuffer final
{
public:
	EShardType                                    bpp__ShardType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ChangeRequest__pf;                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__ShardID__pf;                                  // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Grade__pf;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__GradeValue__pf;                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Rank__pf;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__RankValue__pf;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Status__pf;                                   // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEnchantShardAttribute                        bpp__StatusType__pf;                               // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__OldEquip__pf;                                 // 0x0024(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsEquip__pf;                                  // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPB_ST_ShardChangeInfo                 bpp__ShardInfo__pf;                                // 0x0030(0x002C)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_ChrInfo_SetShardBuffer;

// Function Chr_P0000.Chr_P0000_C.Event_OnWarpStateChanged
// 0x0002 (0x0002 - 0x0000)
struct Chr_P0000_C_Event_OnWarpStateChanged final
{
public:
	EWarpEffectState                              bpp__OldState__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWarpEffectState                              bpp__NewState__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_Event_OnWarpStateChanged;

// Function Chr_P0000.Chr_P0000_C.ExecuteUbergraph_Chr_P0000_0
// 0x0004 (0x0004 - 0x0000)
struct Chr_P0000_C_ExecuteUbergraph_Chr_P0000_0 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_ExecuteUbergraph_Chr_P0000_0;

// Function Chr_P0000.Chr_P0000_C.ExecuteUbergraph_Chr_P0000_1
// 0x0004 (0x0004 - 0x0000)
struct Chr_P0000_C_ExecuteUbergraph_Chr_P0000_1 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_ExecuteUbergraph_Chr_P0000_1;

// Function Chr_P0000.Chr_P0000_C.ExecuteUbergraph_Chr_P0000_10
// 0x0004 (0x0004 - 0x0000)
struct Chr_P0000_C_ExecuteUbergraph_Chr_P0000_10 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_ExecuteUbergraph_Chr_P0000_10;

// Function Chr_P0000.Chr_P0000_C.GetAdditionalCameraTargetLocations
// 0x0018 (0x0018 - 0x0000)
struct Chr_P0000_C_GetAdditionalCameraTargetLocations final
{
public:
	TArray<struct FVector>                        bpp__Locations__pf;                                // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Chr_P0000_C_GetAdditionalCameraTargetLocations;

// Function Chr_P0000.Chr_P0000_C.GetShardInfo
// 0x0030 (0x0030 - 0x0000)
struct Chr_P0000_C_GetShardInfo final
{
public:
	EShardType                                    bpp__ShardType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsEquip__pf;                                  // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPB_ST_ShardChangeInfo                 bpp__SradInfo__pf;                                 // 0x0004(0x002C)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_GetShardInfo;

// Function Chr_P0000.Chr_P0000_C.MULTICAST_ExecOuterDamageBlast
// 0x0010 (0x0010 - 0x0000)
struct Chr_P0000_C_MULTICAST_ExecOuterDamageBlast final
{
public:
	struct FVector                                bpp__Direction__pf;                                // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Distance__pf;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_MULTICAST_ExecOuterDamageBlast;

// Function Chr_P0000.Chr_P0000_C.MULTICAST_GuardConditionSetCollisionCondition
// 0x0010 (0x0010 - 0x0000)
struct Chr_P0000_C_MULTICAST_GuardConditionSetCollisionCondition final
{
public:
	bool                                          bpp__IsArts__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsMuteki__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCollisionObject*                     bpp__AttackCollision__pf;                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_MULTICAST_GuardConditionSetCollisionCondition;

// Function Chr_P0000.Chr_P0000_C.MULTICAST_SyncCharaSpeed
// 0x000C (0x000C - 0x0000)
struct Chr_P0000_C_MULTICAST_SyncCharaSpeed final
{
public:
	struct FVector                                bpp__CharaSpeed__pf;                               // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_MULTICAST_SyncCharaSpeed;

// Function Chr_P0000.Chr_P0000_C.MULTICAST_SyncRemoteStep
// 0x0003 (0x0003 - 0x0000)
struct Chr_P0000_C_MULTICAST_SyncRemoteStep final
{
public:
	EPBStep                                       bpp__NewStep__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActionRequestEntry                           bpp__NewActionRequest__pf;                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStepEntry                                    bpp__NewWildcard__pf;                              // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_MULTICAST_SyncRemoteStep;

// Function Chr_P0000.Chr_P0000_C.MULTICAST_SyncStepTimer
// 0x0004 (0x0004 - 0x0000)
struct Chr_P0000_C_MULTICAST_SyncStepTimer final
{
public:
	float                                         bpp__StepTimer__pf;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_MULTICAST_SyncStepTimer;

// Function Chr_P0000.Chr_P0000_C.MULTICAST_TriggerFakeAttach
// 0x0001 (0x0001 - 0x0000)
struct Chr_P0000_C_MULTICAST_TriggerFakeAttach final
{
public:
	bool                                          bpp__Attached__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_MULTICAST_TriggerFakeAttach;

// Function Chr_P0000.Chr_P0000_C.MULTICAST_Update_DirectionalTargetWorldLocations
// 0x0010 (0x0010 - 0x0000)
struct Chr_P0000_C_MULTICAST_Update_DirectionalTargetWorldLocations final
{
public:
	TArray<struct FVector>                        bpp__DirTarget_WorldLocations__pf__const;          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_MULTICAST_Update_DirectionalTargetWorldLocations;

// Function Chr_P0000.Chr_P0000_C.PopRemoteStep
// 0x0003 (0x0003 - 0x0000)
struct Chr_P0000_C_PopRemoteStep final
{
public:
	struct FRemoteStepTrigger                     bpp__RemoteStep__pf;                               // 0x0000(0x0003)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_PopRemoteStep;

// Function Chr_P0000.Chr_P0000_C.ReceivePossessed
// 0x0008 (0x0008 - 0x0000)
struct Chr_P0000_C_ReceivePossessed final
{
public:
	class AController*                            bpp__NewController__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_ReceivePossessed;

// Function Chr_P0000.Chr_P0000_C.RequestGuardConditionSetCollisionCondition
// 0x0010 (0x0010 - 0x0000)
struct Chr_P0000_C_RequestGuardConditionSetCollisionCondition final
{
public:
	bool                                          bpp__IsArts__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsMuteki__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCollisionObject*                     bpp__AttackCollision__pf;                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_RequestGuardConditionSetCollisionCondition;

// Function Chr_P0000.Chr_P0000_C.SERVER_EquipShardNotifyFromCharacterTick
// 0x0030 (0x0030 - 0x0000)
struct Chr_P0000_C_SERVER_EquipShardNotifyFromCharacterTick final
{
public:
	struct FPB_ST_ShardChangeInfo                 bpp__ShardChange__pf;                              // 0x0000(0x002C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsEquip__pf;                                  // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Chr_P0000_C_SERVER_EquipShardNotifyFromCharacterTick;

// Function Chr_P0000.Chr_P0000_C.SERVER_GuardConditionSetCollisionCondition
// 0x0010 (0x0010 - 0x0000)
struct Chr_P0000_C_SERVER_GuardConditionSetCollisionCondition final
{
public:
	bool                                          bpp__IsArts__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsMuteki__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCollisionObject*                     bpp__AttackCollision__pf;                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_SERVER_GuardConditionSetCollisionCondition;

// Function Chr_P0000.Chr_P0000_C.SERVER_OnNewShardAccepted
// 0x0008 (0x0008 - 0x0000)
struct Chr_P0000_C_SERVER_OnNewShardAccepted final
{
public:
	class AActor*                                 bpp__ItemDroper__pf;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_SERVER_OnNewShardAccepted;

// Function Chr_P0000.Chr_P0000_C.SERVER_OnNewShardDeclined
// 0x0008 (0x0008 - 0x0000)
struct Chr_P0000_C_SERVER_OnNewShardDeclined final
{
public:
	class AActor*                                 bpp__itemDropper__pf;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_SERVER_OnNewShardDeclined;

// Function Chr_P0000.Chr_P0000_C.SERVER_OnShardPromptVisibilityChanged
// 0x0010 (0x0010 - 0x0000)
struct Chr_P0000_C_SERVER_OnShardPromptVisibilityChanged final
{
public:
	class AActor*                                 bpp__itemDropper__pf;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Visible__pf;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Chr_P0000_C_SERVER_OnShardPromptVisibilityChanged;

// Function Chr_P0000.Chr_P0000_C.SERVER_SyncRemoteStep
// 0x0003 (0x0003 - 0x0000)
struct Chr_P0000_C_SERVER_SyncRemoteStep final
{
public:
	EPBStep                                       bpp__NewStep__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActionRequestEntry                           bpp__NewActionRequest__pf;                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStepEntry                                    bpp__NewWildcard__pf;                              // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_SERVER_SyncRemoteStep;

// Function Chr_P0000.Chr_P0000_C.SERVER_TriggerFakeAttach
// 0x0001 (0x0001 - 0x0000)
struct Chr_P0000_C_SERVER_TriggerFakeAttach final
{
public:
	bool                                          bpp__Attached__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_SERVER_TriggerFakeAttach;

// Function Chr_P0000.Chr_P0000_C.SetShardInfo
// 0x005C (0x005C - 0x0000)
struct Chr_P0000_C_SetShardInfo final
{
public:
	EShardType                                    bpp__ShardType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ChangeRequest__pf;                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__ShardID__pf;                                  // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Grade__pf;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__GradeValue__pf;                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Rank__pf;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__RankValue__pf;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Status__pf;                                   // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEnchantShardAttribute                        bpp__StatusType__pf;                               // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__OldEquip__pf;                                 // 0x0024(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsEquip__pf;                                  // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPB_ST_ShardChangeInfo                 bpp__ShardInfo__pf;                                // 0x0030(0x002C)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_SetShardInfo;

// Function Chr_P0000.Chr_P0000_C.SpawnActor_0
// 0x0018 (0x0018 - 0x0000)
struct Chr_P0000_C_SpawnActor_0 final
{
public:
	class FName                                   bpp__BulletID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__SockName__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBulletActor*                         bpp__BulletActor__pf;                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_SpawnActor_0;

// Function Chr_P0000.Chr_P0000_C.SyncRemoteStep
// 0x0003 (0x0003 - 0x0000)
struct Chr_P0000_C_SyncRemoteStep final
{
public:
	EPBStep                                       bpp__Step__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActionRequestEntry                           bpp__NewActionRequest__pf;                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStepEntry                                    bpp__NewWildcard__pf;                              // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_P0000_C_SyncRemoteStep;

// Function Chr_P0000.Chr_P0000_C.UnequipShardNotify_FromCharacterTick
// 0x0010 (0x0010 - 0x0000)
struct Chr_P0000_C_UnequipShardNotify_FromCharacterTick final
{
public:
	EShardType                                    bpp__ShardType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__OldEquip__pf;                                 // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEnchantShardAttribute                        bpp__StatusType__pf;                               // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Chr_P0000_C_UnequipShardNotify_FromCharacterTick;

}

