#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chr_N2004

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Chr_N2004.Chr_N2004_C.ExecuteUbergraph_Chr_N2004_2
// 0x0004 (0x0004 - 0x0000)
struct Chr_N2004_C_ExecuteUbergraph_Chr_N2004_2 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_N2004_C_ExecuteUbergraph_Chr_N2004_2;

// Function Chr_N2004.Chr_N2004_C.ExecuteUbergraph_Chr_N2004_4
// 0x0004 (0x0004 - 0x0000)
struct Chr_N2004_C_ExecuteUbergraph_Chr_N2004_4 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_N2004_C_ExecuteUbergraph_Chr_N2004_4;

// Function Chr_N2004.Chr_N2004_C.MULTICAST_SyncVelocity
// 0x000C (0x000C - 0x0000)
struct Chr_N2004_C_MULTICAST_SyncVelocity final
{
public:
	struct FVector                                bpp__Velocity__pf;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_N2004_C_MULTICAST_SyncVelocity;

// Function Chr_N2004.Chr_N2004_C.StartCrystalTransition
// 0x0010 (0x0010 - 0x0000)
struct Chr_N2004_C_StartCrystalTransition final
{
public:
	struct FVector                                bpp__ShaderColor__pf;                              // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Duration__pf;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Chr_N2004_C_StartCrystalTransition;

}

