#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Com_TimerControler

#include "Basic.hpp"

#include "Cmp_Root_classes.hpp"
#include "EPBTimerIndex_structs.hpp"


namespace SDK
{

// DynamicClass Com_TimerControler.Com_TimerControler_C
// 0x0020 (0x0270 - 0x0250)
class UCom_TimerControler_C final : public UCmp_Root_C
{
public:
	TArray<float>                                 Timer;                                             // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         Size;                                              // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Local_Time;                                        // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CallFunc__GetTime_Time;                            // 0x0268(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Variable;                                 // 0x026C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void _GetTime(float* bpp__Time__pf);
	void _Size(int32* bpp__Size__pf);
	void _ToInt(EPBTimerIndex bpp__Value__pf, int32* bpp__Index__pf);
	void GetTimer(EPBTimerIndex bpp__Index__pf, float* bpp__Time__pf);
	void IsFinishTimer(EPBTimerIndex bpp__Index__pf, float bpp__Time__pf, bool* bpp__IsFnish__pf);
	void StartTimer(EPBTimerIndex bpp__Index__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Com_TimerControler_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Com_TimerControler_C")
	}
	static class UCom_TimerControler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCom_TimerControler_C>();
	}
};
DUMPER7_ASSERTS_UCom_TimerControler_C;

}

