#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonMenuPickListWindow

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonMenuPickListWindow.CommonMenuPickListWindow_C
// 0x0040 (0x0298 - 0x0258)
class UCommonMenuPickListWindow_C final : public UPBUserWidget
{
public:
	class UImage*                                 back;                                              // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ListView;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Root;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UPickMenuList_C*>                ListButtons;                                       // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Top;                                               // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LAST;                                              // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Height;                                            // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddList(class UPickMenuList_C* Content);
	void ClearList();
	void RefreshList(TArray<EWeaponType>& Array, EWeaponType pick);
	void GetSelectList(class UPickMenuList_C** Output);
	void MoveCursor(int32 MoveVal);
	void UpdateCheck();
	void SetListCursor(ESlateVisibility Visiblity);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonMenuPickListWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonMenuPickListWindow_C")
	}
	static class UCommonMenuPickListWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonMenuPickListWindow_C>();
	}
};
DUMPER7_ASSERTS_UCommonMenuPickListWindow_C;

}

