#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonFade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonFade.CommonFade_C
// 0x0038 (0x02B8 - 0x0280)
class UCommonFade_C final : public UPBUserWidgetFade
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Filter;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Timer;                                             // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   FadeEndEvent;                                      // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_CommonFade(int32 EntryPoint);
	void FadeStartEvent_Event(float StartAlpha, float EndAlpha, float FadeTime, const struct FLinearColor& Color);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void StartFade(float StartAlpha, float EndAlpha, float FadeTime, const struct FLinearColor& FadeColor);
	void IsEnd(bool* IsEnd_0);
	void IsFade(bool* IsFade_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonFade_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonFade_C")
	}
	static class UCommonFade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonFade_C>();
	}
};
DUMPER7_ASSERTS_UCommonFade_C;

}

