#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonPopupButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonPopupButton.CommonPopupButton_C
// 0x0040 (0x0298 - 0x0258)
class UCommonPopupButton_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 back;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEffChoiceBP_C*                         EffChoice;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Label;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   text;                                              // 0x0278(0x0018)(Edit, BlueprintVisible)
	class FName                                   UniqueId;                                          // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CommonPopupButton(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void Initialize();
	void Setup();
	void SetButtonText(const class FText& Input);
	void SetCursorVisible(bool IsVisible_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonPopupButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonPopupButton_C")
	}
	static class UCommonPopupButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonPopupButton_C>();
	}
};
DUMPER7_ASSERTS_UCommonPopupButton_C;

}

