#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonSideSelecterItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonSideSelecterItem.CommonSideSelecterItem_C
// 0x00D8 (0x0330 - 0x0258)
class UCommonSideSelecterItem_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CommonSideSelectItemBase;                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Content;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEffChoiceBP_C*                         EffChoiceBP;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 icon;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USideSelecter_C*                        Selecter;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           SelecterText;                                      // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         CurrentIndex;                                      // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   text;                                              // 0x02A0(0x0018)(Edit, BlueprintVisible)
	class FText                                   helpText;                                          // 0x02B8(0x0018)(Edit, BlueprintVisible)
	class FText                                   HelpText_PS4;                                      // 0x02D0(0x0018)(Edit, BlueprintVisible)
	class FText                                   HelpText_Switch;                                   // 0x02E8(0x0018)(Edit, BlueprintVisible)
	class FText                                   HelpText_XboxOne;                                  // 0x0300(0x0018)(Edit, BlueprintVisible)
	bool                                          IsPC;                                              // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsActivate;                                        // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31A[0x2];                                      // 0x031A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InitialIndex;                                      // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsChange;                                          // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   UniqueId;                                          // 0x0324(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBConfigMenuSettings                         ConfigMenuSettingType;                             // 0x032C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGraphicsScalabilitySetting;                      // 0x032D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CommonSideSelecterItem(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetSelecterItems(class FText& Items);
	void UpdateSelectItem(int32 Index_0);
	void SetContentText(const class FText& InText);
	void IsContentPC(bool* isEnable);
	void GetSelecterIndex(int32* Index_0);
	void IsActivated(bool* isEnable);
	void Initialize();
	void Setup();
	void SetDispCursor(ESlateVisibility In_Visiblity);
	void InitSelectorAndSetInitialIndex(int32 InitialIndex_0);
	void SwitchSelecter(int32 Move);
	void IsChangeValue(bool* isEnable);
	void SetSelecter(int32 idx);
	void RevertSelecter();
	void GetInitialIndex(int32* Output);
	void ClearSelecter();
	void Refresh();
	void SetActivate(bool is_activate);
	void GetUniqueID(class FName* UniqueId_0);
	void ResetSelecterText();
	void GetHelpText(class FText* helpText_0);
	void RemoveSelector(int32 IndexToRemove);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonSideSelecterItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonSideSelecterItem_C")
	}
	static class UCommonSideSelecterItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonSideSelecterItem_C>();
	}
};
DUMPER7_ASSERTS_UCommonSideSelecterItem_C;

}

