#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonSubMenuLIst

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function CommonSubMenuLIst.CommonSubMenuLIst_C.ExecuteUbergraph_CommonSubMenuLIst
// 0x0008 (0x0008 - 0x0000)
struct CommonSubMenuLIst_C_ExecuteUbergraph_CommonSubMenuLIst final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonSubMenuLIst_C_ExecuteUbergraph_CommonSubMenuLIst;

// Function CommonSubMenuLIst.CommonSubMenuLIst_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CommonSubMenuLIst_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonSubMenuLIst_C_PreConstruct;

// Function CommonSubMenuLIst.CommonSubMenuLIst_C.SetDispCursor
// 0x0010 (0x0010 - 0x0000)
struct CommonSubMenuLIst_C_SetDispCursor final
{
public:
	bool                                          is_disp;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffChoiceBP_C*                         NewLocalVar_1;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonSubMenuLIst_C_SetDispCursor;

// Function CommonSubMenuLIst.CommonSubMenuLIst_C.SetNameText
// 0x0018 (0x0018 - 0x0000)
struct CommonSubMenuLIst_C_SetNameText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_CommonSubMenuLIst_C_SetNameText;

// Function CommonSubMenuLIst.CommonSubMenuLIst_C.SetNameColor
// 0x0028 (0x0028 - 0x0000)
struct CommonSubMenuLIst_C_SetNameColor final
{
public:
	struct FSlateColor                            InColorAndOpacity;                                 // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_CommonSubMenuLIst_C_SetNameColor;

// Function CommonSubMenuLIst.CommonSubMenuLIst_C.SetNameJustification
// 0x0001 (0x0001 - 0x0000)
struct CommonSubMenuLIst_C_SetNameJustification final
{
public:
	ETextJustify                                  InJustification;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonSubMenuLIst_C_SetNameJustification;

// Function CommonSubMenuLIst.CommonSubMenuLIst_C.SetUniqueID
// 0x0008 (0x0008 - 0x0000)
struct CommonSubMenuLIst_C_SetUniqueID final
{
public:
	class FName                                   Input;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonSubMenuLIst_C_SetUniqueID;

// Function CommonSubMenuLIst.CommonSubMenuLIst_C.GetUniqueID
// 0x0008 (0x0008 - 0x0000)
struct CommonSubMenuLIst_C_GetUniqueID final
{
public:
	class FName                                   UniqueId_0;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonSubMenuLIst_C_GetUniqueID;

// Function CommonSubMenuLIst.CommonSubMenuLIst_C.SetEnable
// 0x0001 (0x0001 - 0x0000)
struct CommonSubMenuLIst_C_SetEnable final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonSubMenuLIst_C_SetEnable;

// Function CommonSubMenuLIst.CommonSubMenuLIst_C.GetEnable
// 0x0004 (0x0004 - 0x0000)
struct CommonSubMenuLIst_C_GetEnable final
{
public:
	bool                                          is_true;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          is_enable;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TRUE_0;                                            // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonSubMenuLIst_C_GetEnable;

}

