#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonMenuHeader

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CommonMenuHeader.CommonMenuHeader_C.ExecuteUbergraph_CommonMenuHeader
// 0x0008 (0x0008 - 0x0000)
struct CommonMenuHeader_C_ExecuteUbergraph_CommonMenuHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonMenuHeader_C_ExecuteUbergraph_CommonMenuHeader;

// Function CommonMenuHeader.CommonMenuHeader_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CommonMenuHeader_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonMenuHeader_C_PreConstruct;

// Function CommonMenuHeader.CommonMenuHeader_C.StartTextScroll
// 0x0030 (0x0030 - 0x0000)
struct CommonMenuHeader_C_StartTextScroll final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X1;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y1;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonMenuHeader_C_StartTextScroll;

// Function CommonMenuHeader.CommonMenuHeader_C.SetBackImage
// 0x0008 (0x0008 - 0x0000)
struct CommonMenuHeader_C_SetBackImage final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonMenuHeader_C_SetBackImage;

// Function CommonMenuHeader.CommonMenuHeader_C.SetHeaderText
// 0x0018 (0x0018 - 0x0000)
struct CommonMenuHeader_C_SetHeaderText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_CommonMenuHeader_C_SetHeaderText;

// Function CommonMenuHeader.CommonMenuHeader_C.SetHeaderText_NotScroll
// 0x0020 (0x0020 - 0x0000)
struct CommonMenuHeader_C_SetHeaderText_NotScroll final
{
public:
	class FText                                   InfomationText;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonMenuHeader_C_SetHeaderText_NotScroll;

// Function CommonMenuHeader.CommonMenuHeader_C.SetTitleImage
// 0x0008 (0x0008 - 0x0000)
struct CommonMenuHeader_C_SetTitleImage final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonMenuHeader_C_SetTitleImage;

// Function CommonMenuHeader.CommonMenuHeader_C.UpdateHeader
// 0x0040 (0x0040 - 0x0000)
struct CommonMenuHeader_C_UpdateHeader final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             InTexture;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             TextureBuf;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TextBuf;                                           // 0x0028(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_CommonMenuHeader_C_UpdateHeader;

}

