#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonCheckBoxList

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CommonCheckBoxList.CommonCheckBoxList_C.ExecuteUbergraph_CommonCheckBoxList
// 0x0004 (0x0004 - 0x0000)
struct CommonCheckBoxList_C_ExecuteUbergraph_CommonCheckBoxList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonCheckBoxList_C_ExecuteUbergraph_CommonCheckBoxList;

// Function CommonCheckBoxList.CommonCheckBoxList_C.SetNameText
// 0x0018 (0x0018 - 0x0000)
struct CommonCheckBoxList_C_SetNameText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_CommonCheckBoxList_C_SetNameText;

// Function CommonCheckBoxList.CommonCheckBoxList_C.SetListCursor
// 0x0002 (0x0002 - 0x0000)
struct CommonCheckBoxList_C_SetListCursor final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Visible;                                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonCheckBoxList_C_SetListCursor;

// Function CommonCheckBoxList.CommonCheckBoxList_C.SetCheckBox
// 0x0001 (0x0001 - 0x0000)
struct CommonCheckBoxList_C_SetCheckBox final
{
public:
	bool                                          IsActive_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonCheckBoxList_C_SetCheckBox;

// Function CommonCheckBoxList.CommonCheckBoxList_C.SwitchCheckBox
// 0x0001 (0x0001 - 0x0000)
struct CommonCheckBoxList_C_SwitchCheckBox final
{
public:
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonCheckBoxList_C_SwitchCheckBox;

}

