#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonIconList

#include "Basic.hpp"


namespace SDK::Params
{

// Function CommonIconList.CommonIconList_C.ExecuteUbergraph_CommonIconList
// 0x0008 (0x0008 - 0x0000)
struct CommonIconList_C_ExecuteUbergraph_CommonIconList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonIconList_C_ExecuteUbergraph_CommonIconList;

// Function CommonIconList.CommonIconList_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CommonIconList_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonIconList_C_PreConstruct;

// Function CommonIconList.CommonIconList_C.SetDispCursor
// 0x0001 (0x0001 - 0x0000)
struct CommonIconList_C_SetDispCursor final
{
public:
	bool                                          is_on;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonIconList_C_SetDispCursor;

// Function CommonIconList.CommonIconList_C.SetNameText
// 0x0018 (0x0018 - 0x0000)
struct CommonIconList_C_SetNameText final
{
public:
	class FText                                   input_text;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_CommonIconList_C_SetNameText;

// Function CommonIconList.CommonIconList_C.SetIconImage
// 0x0004 (0x0004 - 0x0000)
struct CommonIconList_C_SetIconImage final
{
public:
	float                                         input_id;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonIconList_C_SetIconImage;

// Function CommonIconList.CommonIconList_C.SetNewIcon
// 0x0001 (0x0001 - 0x0000)
struct CommonIconList_C_SetNewIcon final
{
public:
	bool                                          is_on;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonIconList_C_SetNewIcon;

}

