#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConfigUserDataMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UIScroll_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ConfigUserDataMenu.ConfigUserDataMenu_C
// 0x0030 (0x02D8 - 0x02A8)
class UConfigUserDataMenu_C final : public UUIScroll_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ConfigUserDataMenu_C;               // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackkerIDSetter_C*                     BackkerIDSetter;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClanSetter_C*                          ClanSetter;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   EventSetMenuFocus;                                 // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_ConfigUserDataMenu(int32 EntryPoint);
	void Construct();
	void EventReturnConfigMenu();
	void SetInputFInish();
	void Initialize();
	void Setup();
	void SetBlockCursor(ESlateVisibility InVisibility);
	void GetDecideContent(int32* Output);
	void InputBackerID();
	void MoveCursor(int32 Move);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ConfigUserDataMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConfigUserDataMenu_C")
	}
	static class UConfigUserDataMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfigUserDataMenu_C>();
	}
};
DUMPER7_ASSERTS_UConfigUserDataMenu_C;

}

