#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConfigSelectMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ConfigSelectMenu.ConfigSelectMenu_C
// 0x0080 (0x02F8 - 0x0278)
class UConfigSelectMenu_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonEditMenu_Backup_C*               CommonEditMenu;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFadeWidget_C*                          FadeWidget;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonHelpMessage_C*                   HelpMessage;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventCloseMenu;                                    // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UConfigMenu_C*                          ConfigMenu;                                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBackToTitle_C*                         BackToTitle;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuitGameYesNo_C*                       QuitGameYesNo;                                     // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTemporaryDataLoadMenu_C*               TemporaryLoad;                                     // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTemporaryDataSaveMenu_C*               TemporarySave;                                     // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventReturnToGame;                                 // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UControlsMenu_C*                        ControlsMenu;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USuspendGameYesNo_C*                    SuspendYesNo;                                      // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentPauseController;                            // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ConfigSelectMenu(int32 EntryPoint);
	void OnPressedButton();
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void Construct();
	void カスタムイベント_0();
	void EventOpenConfigMenu();
	void EventOpenBackToTitle();
	void EventOpenQuitGame();
	void RemoveAll();
	void TemporaryLoadFinished();
	void TemporaryLoadMenuClosed();
	void SetupTemporaryLoadMenu();
	void OpenTemporaryLoadMenu();
	void TemporarySaveMenuClosed();
	void OpenTemporarySaveMenu();
	void CloseControlsMenu();
	void OpenContorolsMenu();
	void カスタムイベント_1();
	void EventOpenSuspendGame();
	void Initialize();
	void Setup();
	void OnStart();
	void OnSelectMenu();
	void DECIDE(int32 InteractingPlayerIndex, bool* IsSuccess);
	void SetCaption();
	void SetUniqueID(TArray<class FName>& input_key);
	void SetupMenu();
	void AddUniqueID(class FName input_key);
	void SetupCanpaignModeMenu();
	void SetupSpeedRunModeMenu();
	void IsPlayerButton(EPBGameKey InputButton, bool* IsSelect, int32* Player);
	void SetupOnlineModeMenu();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ConfigSelectMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConfigSelectMenu_C")
	}
	static class UConfigSelectMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfigSelectMenu_C>();
	}
};
DUMPER7_ASSERTS_UConfigSelectMenu_C;

}

