#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CraftRecipeList

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function CraftRecipeList.CraftRecipeList_C.SetDispCursor
// 0x0002 (0x0002 - 0x0000)
struct CraftRecipeList_C_SetDispCursor final
{
public:
	bool                                          is_on;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          disp_on;                                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CraftRecipeList_C_SetDispCursor;

// Function CraftRecipeList.CraftRecipeList_C.SetIconImage
// 0x0018 (0x0018 - 0x0000)
struct CraftRecipeList_C_SetIconImage final
{
public:
	class FString                                 input_path;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         icon_id;                                           // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CraftRecipeList_C_SetIconImage;

// Function CraftRecipeList.CraftRecipeList_C.SetCraftRecipeData
// 0x0088 (0x0088 - 0x0000)
struct CraftRecipeList_C_SetCraftRecipeData final
{
public:
	struct FPBArchiveCraftCatalogData             input_data;                                        // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_CraftRecipeList_C_SetCraftRecipeData;

// Function CraftRecipeList.CraftRecipeList_C.GetCraftRecipeData
// 0x0088 (0x0088 - 0x0000)
struct CraftRecipeList_C_GetCraftRecipeData final
{
public:
	struct FPBArchiveCraftCatalogData             RecipeData_0;                                      // 0x0000(0x0088)(Parm, OutParm)
};
DUMPER7_ASSERTS_CraftRecipeList_C_GetCraftRecipeData;

}

