#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DialogueCaptureCharacter_BP

#include "Basic.hpp"

#include "ProjectBlood_classes.hpp"


namespace SDK
{

// DynamicClass DialogueCaptureCharacter_BP.DialogueCaptureCharacter_BP_C
// 0x0050 (0x3470 - 0x3420)
#pragma pack(push, 0x1)
class alignas(0x10) ADialogueCaptureCharacter_BP_C : public ADialogueCaptureCharacter
{
public:
	class ULipSyncController*                     LipSyncController;                                 // 0x3420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USkeletalMeshComponent*>         CallFunc_GetComponentsByClass_ReturnValue;         // 0x3428(0x0010)(ExportObject, ZeroConstructor, Transient, DuplicateTransient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x3438(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x343C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x3440(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   K2Node_CustomEvent_AnimName1;                      // 0x3448(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             K2Node_CustomEvent_LipSyncData;                    // 0x3450(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   K2Node_CustomEvent_AnimName;                       // 0x3458(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x3460(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3464[0x4];                                     // 0x3464(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DialoguePlayAnim(class FName bpp__AnimName__pf);
	void DialoguePlayHeadAnim(class FName bpp__AnimName__pf);
	void DialogueSetLipSync(class UDataTable* bpp__LipSyncData__pf);
	void DialogueStopLipSync();
	void ReceiveBeginPlay();
	void ReceiveTick(float bpp__DeltaSeconds__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DialogueCaptureCharacter_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DialogueCaptureCharacter_BP_C")
	}
	static class ADialogueCaptureCharacter_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADialogueCaptureCharacter_BP_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ADialogueCaptureCharacter_BP_C;

}

