#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dialogue_TableItem

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct Dialogue_TableItem.Dialogue_TableItem
// 0x0090 (0x0090 - 0x0000)
struct FDialogue_TableItem final
{
public:
	class FName                                   SpeakerId_98_4545BC1649FF961776C879814ED04482;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Text_2_304456A840A1E72479BBA190DEC32D20;           // 0x0008(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   ResponseText_111_FDCE04EF439B7039860F51B389752F40; // 0x0020(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 Branches_101_EB181D3D4BACBDDA6BD19EA115A76FF2;     // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Traits_108_CF1C343E44F731ACC3FA90AB0BA698FA;       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Conditions_110_7AFA096940B02E71BDBFE88BB5E3F381;   // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PreAction_116_88FD9BDE4C99F3B78CD29FA5BB3A236C;    // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PostAction_117_BDEC452548220DE27B5C93A0991D6CB3;   // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             AudioClip_121_92CC0AA3427642A7B3FCFEBCF9EC7989;    // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDialogue_TableItem;

}

