#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DialogueChr_Andrealphus

#include "Basic.hpp"

#include "DialogueCaptureCharacter_BP_classes.hpp"


namespace SDK
{

// DynamicClass DialogueChr_Andrealphus.DialogueChr_Andrealphus_C
// 0x0190 (0x3600 - 0x3470)
class ADialogueChr_Andrealphus_C final : public ADialogueCaptureCharacter_BP_C
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh10;                                    // 0x3468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh9;                                     // 0x3470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh8;                                     // 0x3478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh7;                                     // 0x3480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh6;                                     // 0x3488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh5;                                     // 0x3490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh4;                                     // 0x3498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh3;                                     // 0x34A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh2;                                     // 0x34A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh1;                                     // 0x34B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x34B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstance>       MatRefBase;                                        // 0x34C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstance>       MatRefEye;                                         // 0x34E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstance>       MatRefFace;                                        // 0x3510(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstance>       MatRefEquip;                                       // 0x3538(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstance>       MatRefSkin;                                        // 0x3560(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 ShovelIns;                                         // 0x3588(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>           ShovelMeshSoftRef;                                 // 0x3590(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   ShovelABPSoftRef;                                  // 0x35B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class ADialogueCaptureCharacter* bpp__InCharacter__pf)> K2Node_CreateDelegate_OutputDelegate; // 0x35E0(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	class ADialogueCaptureCharacter*              K2Node_CustomEvent_InCharacter;                    // 0x35F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35F8[0x8];                                     // 0x35F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckShovelArmor();
	void GetAssetClass(const struct FSoftObjectPath& bpp__SoftClassPath__pf, class UClass** bpp__Class__pf);
	void GetAssetObject(const struct FSoftObjectPath& bpp__SoftObjectPath__pf, class UObject** bpp__AssetObject__pf);
	class USkeletalMeshComponent* GetBunnyHead();
	class USkeletalMeshComponent* GetBunnyParts();
	class USkeletalMeshComponent* GetPureDummy();
	void OnChangeModel_Event(class ADialogueCaptureCharacter* bpp__InCharacter__pf);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DialogueChr_Andrealphus_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DialogueChr_Andrealphus_C")
	}
	static class ADialogueChr_Andrealphus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADialogueChr_Andrealphus_C>();
	}
};
DUMPER7_ASSERTS_ADialogueChr_Andrealphus_C;

}

