#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DropItemData

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct DropItemData.DropItemData
// 0x0030 (0x0030 - 0x0000)
struct FDropItemData final
{
public:
	class FName                                   ID_12_0C3A18814753ED849EDAE0BFABDB741E;            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Name_11_E1E0032E454EC93DDD928185416B3B8B;          // 0x0008(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         Value_13_A3EE076C4E519F6FA52A8C939E4DC2D8;         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rate_14_C981CB164858970F4287E792FD6954A1;          // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOpened_15_7F5842BF4B400CEA66D6A886F18B4B84;      // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDropItemData;

}

