#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EffChoiceBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EffChoiceBP.EffChoiceBP_C
// 0x0028 (0x0280 - 0x0258)
class UEffChoiceBP_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Move;                                              // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Blink;                                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff;                                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EffChoiceBP(int32 EntryPoint);
	void Construct();
	void PlayBlink();
	void StopBlink();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EffChoiceBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EffChoiceBP_C")
	}
	static class UEffChoiceBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEffChoiceBP_C>();
	}
};
DUMPER7_ASSERTS_UEffChoiceBP_C;

}

