#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipSubInformationShard

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function EquipSubInformationShard.EquipSubInformationShard_C.ExecuteUbergraph_EquipSubInformationShard
// 0x0040 (0x0040 - 0x0000)
struct EquipSubInformationShard_C_ExecuteUbergraph_EquipSubInformationShard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_ExecuteUbergraph_EquipSubInformationShard;

// Function EquipSubInformationShard.EquipSubInformationShard_C.Tick
// 0x003C (0x003C - 0x0000)
struct EquipSubInformationShard_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_Tick;

// Function EquipSubInformationShard.EquipSubInformationShard_C.Setup
// 0x0008 (0x0008 - 0x0000)
struct EquipSubInformationShard_C_Setup final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_Setup;

// Function EquipSubInformationShard.EquipSubInformationShard_C.SetShardData
// 0x0180 (0x0180 - 0x0000)
struct EquipSubInformationShard_C_SetShardData final
{
public:
	struct FPBItemCatalogData                     Input;                                             // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FName                                   ID;                                                // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBShardMasterData                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x00F8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_SetShardData;

// Function EquipSubInformationShard.EquipSubInformationShard_C.UpdateStatus
// 0x0018 (0x0018 - 0x0000)
struct EquipSubInformationShard_C_UpdateStatus final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShardType                                    CallFunc_CarriedCatalogToShardType_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_UpdateStatus;

// Function EquipSubInformationShard.EquipSubInformationShard_C.OnTriggerShard
// 0x0018 (0x0018 - 0x0000)
struct EquipSubInformationShard_C_OnTriggerShard final
{
public:
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_OnTriggerShard;

// Function EquipSubInformationShard.EquipSubInformationShard_C.OnEffectiveShard
// 0x0018 (0x0018 - 0x0000)
struct EquipSubInformationShard_C_OnEffectiveShard final
{
public:
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_OnEffectiveShard;

// Function EquipSubInformationShard.EquipSubInformationShard_C.OnDirectionalShard
// 0x0018 (0x0018 - 0x0000)
struct EquipSubInformationShard_C_OnDirectionalShard final
{
public:
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_OnDirectionalShard;

// Function EquipSubInformationShard.EquipSubInformationShard_C.OnEnchantShard
// 0x0018 (0x0018 - 0x0000)
struct EquipSubInformationShard_C_OnEnchantShard final
{
public:
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_OnEnchantShard;

// Function EquipSubInformationShard.EquipSubInformationShard_C.OnFamiliarShrad
// 0x0018 (0x0018 - 0x0000)
struct EquipSubInformationShard_C_OnFamiliarShrad final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_OnFamiliarShrad;

// Function EquipSubInformationShard.EquipSubInformationShard_C.SetShardRank
// 0x0018 (0x0018 - 0x0000)
struct EquipSubInformationShard_C_SetShardRank final
{
public:
	int32                                         Rank;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCharacterInventoryComponent*         CallFunc_GetInventory_Inventory;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShardRank_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_SetShardRank;

// Function EquipSubInformationShard.EquipSubInformationShard_C.SetShardFamiliarLevel
// 0x0018 (0x0018 - 0x0000)
struct EquipSubInformationShard_C_SetShardFamiliarLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       CallFunc_GetPausePlayer_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetShardLevelValue_levelValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShardLevelValue_level;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_SetShardFamiliarLevel;

// Function EquipSubInformationShard.EquipSubInformationShard_C.SetShardCost
// 0x0008 (0x0008 - 0x0000)
struct EquipSubInformationShard_C_SetShardCost final
{
public:
	float                                         cost;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_SetShardCost;

// Function EquipSubInformationShard.EquipSubInformationShard_C.OnSkillShard
// 0x0020 (0x0020 - 0x0000)
struct EquipSubInformationShard_C_OnSkillShard final
{
public:
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShardSkilledEnchant_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_OnSkillShard;

// Function EquipSubInformationShard.EquipSubInformationShard_C.GetInventory
// 0x0010 (0x0010 - 0x0000)
struct EquipSubInformationShard_C_GetInventory final
{
public:
	class UPBCharacterInventoryComponent*         Inventory;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBBaseCharacter*                       CallFunc_GetPlayerCharacterPure_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_GetInventory;

// Function EquipSubInformationShard.EquipSubInformationShard_C.SetLocalPlayerIndex
// 0x0004 (0x0004 - 0x0000)
struct EquipSubInformationShard_C_SetLocalPlayerIndex final
{
public:
	int32                                         LocalPlayerIndex;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EquipSubInformationShard_C_SetLocalPlayerIndex;

}

