#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipSubInformationShard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EquipSubInformationShard.EquipSubInformationShard_C
// 0x02B0 (0x0508 - 0x0258)
class UEquipSubInformationShard_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Familiar;                                          // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OffCost;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Off;                                               // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       On;                                                // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UShardLevel_C*                          ShardFamiliarLevel;                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShardLevel_C*                          ShardLevel;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ShardMPCost::UShardMPCost_C*            ShardMPCost;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShardTypeInfo_C*                       ShardTypeInfo;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   text_1;                                            // 0x02A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   text_2;                                            // 0x02B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   text_3;                                            // 0x02D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Num_1;                                             // 0x02E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Num_2;                                             // 0x0300(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Num_3;                                             // 0x0318(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 Power;                                             // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Grade;                                             // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_0;                                            // 0x0344(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   text_4;                                            // 0x0350(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Num_4;                                             // 0x0368(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPBItemCatalogData                     itemData;                                          // 0x0380(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FPBShardMasterData                     ShardMasterData;                                   // 0x03F8(0x00F8)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FName>                           TriggerOverrideShards;                             // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         LocalPlayerIndex01;                                // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EquipSubInformationShard(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void Initialize();
	void Setup();
	void SetShardData(const struct FPBItemCatalogData& Input);
	void UpdateStatus();
	void OnTriggerShard();
	void OnEffectiveShard();
	void OnDirectionalShard();
	void OnEnchantShard();
	void OnFamiliarShrad();
	void SetShardRank();
	void SetShardGrade();
	void SetShardFamiliarLevel();
	void SetShardCost();
	void SetShardType();
	void OnSkillShard();
	void GetInventory(class UPBCharacterInventoryComponent** Inventory);
	void SetLocalPlayerIndex(int32 LocalPlayerIndex);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EquipSubInformationShard_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EquipSubInformationShard_C")
	}
	static class UEquipSubInformationShard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquipSubInformationShard_C>();
	}
};
DUMPER7_ASSERTS_UEquipSubInformationShard_C;

}

