#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FStruct_TreasureBox

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct FStruct_TreasureBox.FStruct_TreasureBox
// 0x0030 (0x0030 - 0x0000)
struct FFStruct_TreasureBox final
{
public:
	class FName                                   EffectID_2_13AD6BA241F0F5861B0680859CCE9F63;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Items_28_489D241E47FA0FD2D6B2EC8FD11D065A;         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstance*>              Material_12_CDF2CB9947B09048692671890C3DEF39;      // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          UMG_Graphic_Up_Button_Pushed_36_F9B81031438598310153B29403E44F59; // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFStruct_TreasureBox;

}

