#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadSet

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GamepadSet.GamepadSet_C
// 0x00D8 (0x0330 - 0x0258)
class UGamepadSet_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 back;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Content;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEffChoiceBP_C*                         EffChoiceBP;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeyAssignBlock_C*                      KeyPad;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   myId;                                              // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   text;                                              // 0x0288(0x0018)(Edit, BlueprintVisible)
	class FText                                   helpText;                                          // 0x02A0(0x0018)(Edit, BlueprintVisible)
	bool                                          IsChange;                                          // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsActivate;                                        // 0x02B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBConfigMenuKeybinds                         KeyBindType;                                       // 0x02BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBGameKey                                    KeyAction;                                         // 0x02BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBGamePadKey                                 InitialPad;                                        // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPBGamePadKey, float>                    IconMap;                                           // 0x02C0(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FKey                                   InitialKey;                                        // 0x0310(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsPcOnlyKeybind;                                   // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GamepadSet(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetContentText(const class FText& Input);
	void SetContentColor();
	void SetKeyIcon();
	void SetChanged();
	void SetListCursor(ESlateVisibility InVisibility);
	void SwitchMode(bool IsOn);
	void IsActivated(bool* IsActivate_0);
	void SetBindedPad(EPBGamePadKey Input, bool* didSucceed);
	void GetBinded(EPBGamePadKey* BindedButton, struct FKey* Bindedkey);
	void Initialize();
	void Setup();
	void RevertBindingsToInitialValues();
	void SetInitialKeys();
	void IsChanged(bool* IsChanged_0);
	void SetBindedKey(const struct FKey& Input, bool* didSucceed);
	void GetHelpText(class FText* helpText_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GamepadSet_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GamepadSet_C")
	}
	static class UGamepadSet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamepadSet_C>();
	}
};
DUMPER7_ASSERTS_UGamepadSet_C;

}

