#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamePadsMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GamePadsMenu.GamePadsMenu_C
// 0x00B8 (0x0310 - 0x0258)
class UGamePadsMenu_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        Controls;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFadeWidget_C*                          FadeWidget;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamePad_PS4_C*                         GamePad_PS4;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamePad_Stadia_C*                      GamePad_Stadia;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamePad_Switch_C*                      GamePad_Switch;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamePad_SwitchPro_C*                   GamePad_SwitchPro;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamePad_X1_C*                          GamePad_X1;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamePadSubMenu_C*                      GamePadSubMenu;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGamePadSubMenuClassic_C*               GamePadSubMenuClassic;                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LegalDisclaimer;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        SubMenus;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<EPBHardwareType, int32>                  Platforms;                                         // 0x02B8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	EPBHardwareType                               Hardware;                                          // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GamePadsMenu(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void UpdateMenu();
	void SetupControler();
	void GetControlerIndex(int32* Value);
	void SetupPlatformDisclaimer();
	void GetSubMenuIndex(int32* Index_0);
	void SetupSubMenu();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GamePadsMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GamePadsMenu_C")
	}
	static class UGamePadsMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamePadsMenu_C>();
	}
};
DUMPER7_ASSERTS_UGamePadsMenu_C;

}

