#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameModeFunctionLibrary

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ChildOfLightGameflowMenuEnum_structs.hpp"


namespace SDK::Params
{

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.ActivateChildOfLightGameflowMenu
// 0x0020 (0x0020 - 0x0000)
struct GameModeFunctionLibrary_C_ActivateChildOfLightGameflowMenu final
{
public:
	EChildOfLightGameflowMenuEnum                 bpp__State__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Activated__pf;                                // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBUserWidgetPauseMenu*                 bpp__CreatedWidget__pf;                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_ActivateChildOfLightGameflowMenu;

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.AllAuroraModelsDebugFlag
// 0x0010 (0x0010 - 0x0000)
struct GameModeFunctionLibrary_C_AllAuroraModelsDebugFlag final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__AllAuroraModelsDebugFlag__pf;                 // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_AllAuroraModelsDebugFlag;

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.CanFlyDebugFlag
// 0x0010 (0x0010 - 0x0000)
struct GameModeFunctionLibrary_C_CanFlyDebugFlag final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__CanFlyDebugFlag__pf;                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_CanFlyDebugFlag;

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.CheckGameClear
// 0x0010 (0x0010 - 0x0000)
struct GameModeFunctionLibrary_C_CheckGameClear final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_CheckGameClear;

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.CheckPlayerType
// 0x0020 (0x0020 - 0x0000)
struct GameModeFunctionLibrary_C_CheckPlayerType final
{
public:
	TArray<EPBGameModePlayer>                     bpp__PlayerList__pf;                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_CheckPlayerType;

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.GetBossRushGameMode
// 0x0010 (0x0010 - 0x0000)
struct GameModeFunctionLibrary_C_GetBossRushGameMode final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_GetBossRushGameMode;

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.GetCaptureGameMode
// 0x0010 (0x0010 - 0x0000)
struct GameModeFunctionLibrary_C_GetCaptureGameMode final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_GetCaptureGameMode;

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.GetChildOfLightPlayerMode
// 0x0010 (0x0010 - 0x0000)
struct GameModeFunctionLibrary_C_GetChildOfLightPlayerMode final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_GetChildOfLightPlayerMode;

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.GetEventShouldBeSkippedMode
// 0x0010 (0x0010 - 0x0000)
struct GameModeFunctionLibrary_C_GetEventShouldBeSkippedMode final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_GetEventShouldBeSkippedMode;

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.GetMainStartGameMode
// 0x0010 (0x0010 - 0x0000)
struct GameModeFunctionLibrary_C_GetMainStartGameMode final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_GetMainStartGameMode;

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.GetRandomizerGameMode
// 0x0010 (0x0010 - 0x0000)
struct GameModeFunctionLibrary_C_GetRandomizerGameMode final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_GetRandomizerGameMode;

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.GetSkipBossCutscenes
// 0x0010 (0x0010 - 0x0000)
struct GameModeFunctionLibrary_C_GetSkipBossCutscenes final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_GetSkipBossCutscenes;

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.GetSpinOffLastBattle
// 0x0010 (0x0010 - 0x0000)
struct GameModeFunctionLibrary_C_GetSpinOffLastBattle final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_GetSpinOffLastBattle;

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.GetSpinOffPlayerMode
// 0x0010 (0x0010 - 0x0000)
struct GameModeFunctionLibrary_C_GetSpinOffPlayerMode final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_GetSpinOffPlayerMode;

// Function GameModeFunctionLibrary.GameModeFunctionLibrary_C.ModeInfo_IsHardMode
// 0x0010 (0x0010 - 0x0000)
struct GameModeFunctionLibrary_C_ModeInfo_IsHardMode final
{
public:
	class UObject*                                bpp____WorldContext__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameModeFunctionLibrary_C_ModeInfo_IsHardMode;

}

