#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GaugeShadow

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function GaugeShadow.GaugeShadow_C.ExecuteUbergraph_GaugeShadow
// 0x0004 (0x0004 - 0x0000)
struct GaugeShadow_C_ExecuteUbergraph_GaugeShadow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GaugeShadow_C_ExecuteUbergraph_GaugeShadow;

// Function GaugeShadow.GaugeShadow_C.SetFrameShadow
// 0x0010 (0x0010 - 0x0000)
struct GaugeShadow_C_SetFrameShadow final
{
public:
	class UTexture2D*                             input_texture;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GaugeShadow_C_SetFrameShadow;

}

