#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GuideBlock

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "ControllGuideData_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GuideBlock.GuideBlock_C
// 0x0070 (0x02C8 - 0x0258)
class UGuideBlock_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       blinkOff;                                          // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       blinkOn;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             GuideText;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 icon;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MapMarkerIcon;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FControllGuideData                     Param;                                             // 0x0290(0x0038)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_GuideBlock(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Initialize();
	void Setup();
	void SetGuideInfo(const struct FControllGuideData& Input);
	void SetIconImage(EPBGameKey KeyType);
	void SetGuideText(const class FText& InText);
	void SetBlink(bool Blink);
	void GetParam(struct FControllGuideData* Param_0);
	void UpdateIconImage();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GuideBlock_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GuideBlock_C")
	}
	static class UGuideBlock_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGuideBlock_C>();
	}
};
DUMPER7_ASSERTS_UGuideBlock_C;

}

