#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IAccessableCharacterControler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function IAccessableCharacterControler.IAccessableCharacterControler_C.ChrCntroler_SetBool
// 0x0008 (0x0008 - 0x0000)
struct IAccessableCharacterControler_C_ChrCntroler_SetBool final
{
public:
	int32                                         bpp__Index__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessableCharacterControler_C_ChrCntroler_SetBool;

// Function IAccessableCharacterControler.IAccessableCharacterControler_C.ChrControler_ExecCommand
// 0x000C (0x000C - 0x0000)
struct IAccessableCharacterControler_C_ChrControler_ExecCommand final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessableCharacterControler_C_ChrControler_ExecCommand;

// Function IAccessableCharacterControler.IAccessableCharacterControler_C.ChrControler_IsBattleReady
// 0x0001 (0x0001 - 0x0000)
struct IAccessableCharacterControler_C_ChrControler_IsBattleReady final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessableCharacterControler_C_ChrControler_IsBattleReady;

// Function IAccessableCharacterControler.IAccessableCharacterControler_C.ChrControler_SetIsBattleReady
// 0x0002 (0x0002 - 0x0000)
struct IAccessableCharacterControler_C_ChrControler_SetIsBattleReady final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessableCharacterControler_C_ChrControler_SetIsBattleReady;

// Function IAccessableCharacterControler.IAccessableCharacterControler_C.ChrCtr_GetVectorValue
// 0x0010 (0x0010 - 0x0000)
struct IAccessableCharacterControler_C_ChrCtr_GetVectorValue final
{
public:
	int32                                         bpp__Index__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Vectorvalue__pf;                              // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessableCharacterControler_C_ChrCtr_GetVectorValue;

// Function IAccessableCharacterControler.IAccessableCharacterControler_C.ChrCtr_SetFloatValue
// 0x0010 (0x0010 - 0x0000)
struct IAccessableCharacterControler_C_ChrCtr_SetFloatValue final
{
public:
	class FName                                   bpp__Type__pf;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Value__pf;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__return__pf;                                   // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessableCharacterControler_C_ChrCtr_SetFloatValue;

// Function IAccessableCharacterControler.IAccessableCharacterControler_C.SetCrackDecal
// 0x001C (0x001C - 0x0000)
struct IAccessableCharacterControler_C_SetCrackDecal final
{
public:
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__NormalVector__pf;                             // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessableCharacterControler_C_SetCrackDecal;

}

