#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IAcceptableBulletInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function IAcceptableBulletInfo.IAcceptableBulletInfo_C.BulletInfo_AddDamage
// 0x0008 (0x0008 - 0x0000)
struct IAcceptableBulletInfo_C_BulletInfo_AddDamage final
{
public:
	float                                         bpp__Damage__pf;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableBulletInfo_C_BulletInfo_AddDamage;

// Function IAcceptableBulletInfo.IAcceptableBulletInfo_C.BulletInfo_Destroy
// 0x0001 (0x0001 - 0x0000)
struct IAcceptableBulletInfo_C_BulletInfo_Destroy final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAcceptableBulletInfo_C_BulletInfo_Destroy;

// Function IAcceptableBulletInfo.IAcceptableBulletInfo_C.BulletInfo_GetBoolParameter
// 0x000C (0x000C - 0x0000)
struct IAcceptableBulletInfo_C_BulletInfo_GetBoolParameter final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableBulletInfo_C_BulletInfo_GetBoolParameter;

// Function IAcceptableBulletInfo.IAcceptableBulletInfo_C.BulletInfo_RemoveDamage
// 0x0001 (0x0001 - 0x0000)
struct IAcceptableBulletInfo_C_BulletInfo_RemoveDamage final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAcceptableBulletInfo_C_BulletInfo_RemoveDamage;

// Function IAcceptableBulletInfo.IAcceptableBulletInfo_C.BulletInfo_SetActor
// 0x0010 (0x0010 - 0x0000)
struct IAcceptableBulletInfo_C_BulletInfo_SetActor final
{
public:
	class AActor*                                 bpp__ActorReference__pf;                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableBulletInfo_C_BulletInfo_SetActor;

// Function IAcceptableBulletInfo.IAcceptableBulletInfo_C.BulletInfo_SetBoolParamter
// 0x000C (0x000C - 0x0000)
struct IAcceptableBulletInfo_C_BulletInfo_SetBoolParamter final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableBulletInfo_C_BulletInfo_SetBoolParamter;

// Function IAcceptableBulletInfo.IAcceptableBulletInfo_C.BulletInfo_SetChrIns
// 0x0010 (0x0010 - 0x0000)
struct IAcceptableBulletInfo_C_BulletInfo_SetChrIns final
{
public:
	class APBBaseCharacter*                       bpp__ChrIns__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableBulletInfo_C_BulletInfo_SetChrIns;

// Function IAcceptableBulletInfo.IAcceptableBulletInfo_C.BulletInfo_SetDamageID
// 0x000C (0x000C - 0x0000)
struct IAcceptableBulletInfo_C_BulletInfo_SetDamageID final
{
public:
	class FName                                   bpp__DamageMasterID__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableBulletInfo_C_BulletInfo_SetDamageID;

// Function IAcceptableBulletInfo.IAcceptableBulletInfo_C.BulletInfo_SetFloatValue
// 0x000C (0x000C - 0x0000)
struct IAcceptableBulletInfo_C_BulletInfo_SetFloatValue final
{
public:
	int32                                         bpp__Index__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Value__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableBulletInfo_C_BulletInfo_SetFloatValue;

// Function IAcceptableBulletInfo.IAcceptableBulletInfo_C.BulletInfo_SetIsPlayer
// 0x0002 (0x0002 - 0x0000)
struct IAcceptableBulletInfo_C_BulletInfo_SetIsPlayer final
{
public:
	bool                                          bpp__IsPlayer__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAcceptableBulletInfo_C_BulletInfo_SetIsPlayer;

// Function IAcceptableBulletInfo.IAcceptableBulletInfo_C.BulletInfo_SetNameValue
// 0x0010 (0x0010 - 0x0000)
struct IAcceptableBulletInfo_C_BulletInfo_SetNameValue final
{
public:
	int32                                         bpp__Index__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Value__pf;                                    // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableBulletInfo_C_BulletInfo_SetNameValue;

// Function IAcceptableBulletInfo.IAcceptableBulletInfo_C.BulletInfo_SetOffsetVector
// 0x0010 (0x0010 - 0x0000)
struct IAcceptableBulletInfo_C_BulletInfo_SetOffsetVector final
{
public:
	struct FVector                                bpp__OffsetVector__pf;                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableBulletInfo_C_BulletInfo_SetOffsetVector;

// Function IAcceptableBulletInfo.IAcceptableBulletInfo_C.BulletInfo_SetOwnerInstance
// 0x0010 (0x0010 - 0x0000)
struct IAcceptableBulletInfo_C_BulletInfo_SetOwnerInstance final
{
public:
	class AActor*                                 bpp__Instance__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableBulletInfo_C_BulletInfo_SetOwnerInstance;

// Function IAcceptableBulletInfo.IAcceptableBulletInfo_C.BulletInfo_SetVectorParameter
// 0x0018 (0x0018 - 0x0000)
struct IAcceptableBulletInfo_C_BulletInfo_SetVectorParameter final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__VectorParameter__pf;                          // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableBulletInfo_C_BulletInfo_SetVectorParameter;

}

