#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IAccessablePlayerInfo

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ESubSubStep_structs.hpp"
#include "EPB_PlayerStance_structs.hpp"
#include "ESubStep_structs.hpp"
#include "EPB_PlayerCtr_FloatParameterType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EPB_PlayerInfoVectorType_structs.hpp"
#include "EPB_P0000_GunDamageType_structs.hpp"
#include "EPB_PlayerInfoBoolType_structs.hpp"
#include "EPB_AttackStance_structs.hpp"
#include "Engine_structs.hpp"
#include "EPB_ActionRequestCategory_structs.hpp"
#include "EPB_N1011_EnchantType_structs.hpp"
#include "EPB_ExecCommandType_structs.hpp"


namespace SDK::Params
{

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_AccelWorld
// 0x0002 (0x0002 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_AccelWorld final
{
public:
	bool                                          bpp__Stop__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_AccelWorld;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_BookClose
// 0x0001 (0x0001 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_BookClose final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_BookClose;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_EndFacialAnimation
// 0x0001 (0x0001 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_EndFacialAnimation final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_EndFacialAnimation;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_EventDealDamageInfo
// 0x0048 (0x0048 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_EventDealDamageInfo final
{
public:
	class FName                                   bpp__DamageID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsHit__pf;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBBloodColor                                 bpp__BloodColor__pf;                               // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__DamageValue__pf;                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       bpp__ChrIns__pf;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__HitWorldLocation__pf;                         // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsCritical__pf;                               // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsBullet__pf;                                 // 0x0025(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__HitBone__pf;                                  // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttackAttribute                              bpp__EffectiveAttribute__pf;                       // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCollisionObject*                     bpp__AttackCollision__pf;                          // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_EventDealDamageInfo;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_ExecChairDamamage
// 0x0001 (0x0001 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_ExecChairDamamage final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_ExecChairDamamage;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_ExecCommand
// 0x0024 (0x0024 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_ExecCommand final
{
public:
	EPB_ExecCommandType                           bpp__CommandType__pf;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__BoolParameter__pf;                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__FloatParameter__pf;                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__IntParameter__pf;                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__VectorPrameter__pf;                           // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__NameParameter__pf;                            // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_ExecCommand;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_FlipRequest
// 0x0002 (0x0002 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_FlipRequest final
{
public:
	bool                                          bpp__IsRight__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_FlipRequest;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_GetDirectionalHandWorldLocation
// 0x000C (0x000C - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_GetDirectionalHandWorldLocation final
{
public:
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_GetDirectionalHandWorldLocation;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_GetForwardVector
// 0x000C (0x000C - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_GetForwardVector final
{
public:
	struct FVector                                bpp__WorldDirection__pf;                           // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_GetForwardVector;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_GetTriggerHandWorldLocation
// 0x000C (0x000C - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_GetTriggerHandWorldLocation final
{
public:
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_GetTriggerHandWorldLocation;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_JumpAttackLateralMoveReverse
// 0x0002 (0x0002 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_JumpAttackLateralMoveReverse final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_JumpAttackLateralMoveReverse;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_JumpkickOff
// 0x0001 (0x0001 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_JumpkickOff final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_JumpkickOff;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_LaunchGun
// 0x0020 (0x0020 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_LaunchGun final
{
public:
	class FName                                   bpp__BulletID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__SocketName__pf;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsArts__pf;                                   // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsLaunch__pf;                                 // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBulletActor*                         bpp__BulletInstance__pf;                           // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_LaunchGun;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_PlayShardVoice
// 0x0002 (0x0002 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_PlayShardVoice final
{
public:
	EShardType                                    bpp__ShardType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_PlayShardVoice;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_ReleaseInvert
// 0x0014 (0x0014 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_ReleaseInvert final
{
public:
	float                                         bpp__Distance__pf;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Dir__pf;                                      // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDamageIfNotInvert__pf;                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_ReleaseInvert;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_RequestEnchant
// 0x0004 (0x0004 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_RequestEnchant final
{
public:
	bool                                          bpp__Request__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ForceEnchantType__pf;                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_N1011_EnchantType                         bpp__EnchantType__pf;                              // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_RequestEnchant;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetActionRequestCondition
// 0x0002 (0x0002 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetActionRequestCondition final
{
public:
	EPB_ActionRequestCategory                     bpp__ActionRequestCategory__pf;                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetActionRequestCondition;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetAimEffectCondition
// 0x000C (0x000C - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetAimEffectCondition final
{
public:
	class FName                                   bpp__ShardID__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetAimEffectCondition;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetAnimBool
// 0x0003 (0x0003 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetAnimBool final
{
public:
	EAnimBoolArray                                bpp__AnimBoolType__pf;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetAnimBool;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetBoolParameter
// 0x0003 (0x0003 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetBoolParameter final
{
public:
	EPB_PlayerInfoBoolType                        bpp__ParameterType__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ParameterValue__pf;                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetBoolParameter;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetChairMagicRecoverRate
// 0x0008 (0x0008 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetChairMagicRecoverRate final
{
public:
	float                                         bpp__MagicRecoverSpeedRate__pf;                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetChairMagicRecoverRate;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetDefaultBrakeRate
// 0x0008 (0x0008 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetDefaultBrakeRate final
{
public:
	float                                         bpp__BrakeRate__pf;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetDefaultBrakeRate;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetDirectionalShardEnable
// 0x0002 (0x0002 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetDirectionalShardEnable final
{
public:
	bool                                          bpp__Enable__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetDirectionalShardEnable;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetDisenableStandUpChairByeKey
// 0x0001 (0x0001 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetDisenableStandUpChairByeKey final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetDisenableStandUpChairByeKey;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetEquipEnchantParameter
// 0x0003 (0x0003 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetEquipEnchantParameter final
{
public:
	ECarriedCatalog                               bpp__EquipType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsUnEquip__pf;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetEquipEnchantParameter;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetEquipMeshVisible
// 0x0007 (0x0007 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetEquipMeshVisible final
{
public:
	bool                                          bpp__CapVisible__pf;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__HeadVisible__pf;                              // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Accesarry1Visible__pf;                        // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Accesarry2Visible__pf;                        // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__MufflerVisible__pf;                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__HairVisible__pf;                              // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetEquipMeshVisible;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetEventAttack
// 0x0001 (0x0001 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetEventAttack final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetEventAttack;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetFakeMoonWarpSetting
// 0x0010 (0x0010 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetFakeMoonWarpSetting final
{
public:
	struct FVector                                bpp__WarpTargetLocation__pf;                       // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetFakeMoonWarpSetting;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetFloatParameter
// 0x000C (0x000C - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetFloatParameter final
{
public:
	EPB_PlayerCtr_FloatParameterType              bpp__ParameterType__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__ParameterValue__pf;                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetFloatParameter;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetIsInnerBloodPool
// 0x0002 (0x0002 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetIsInnerBloodPool final
{
public:
	bool                                          bpp__IsInner__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetIsInnerBloodPool;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetMirroringReverse
// 0x0002 (0x0002 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetMirroringReverse final
{
public:
	bool                                          bpp__Reverse__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetMirroringReverse;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetReflectionMaxDistance
// 0x0008 (0x0008 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetReflectionMaxDistance final
{
public:
	float                                         bpp__MaxDistance__pf;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetReflectionMaxDistance;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetShardBulletActor
// 0x0018 (0x0018 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetShardBulletActor final
{
public:
	EShardType                                    bpp__ShardType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBulletActor*                         bpp__BulleIns__pf;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetShardBulletActor;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetShardEnchantParameter
// 0x0014 (0x0014 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetShardEnchantParameter final
{
public:
	class FName                                   bpp__ShardID__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsUnEquip__pf;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__Rank__pf;                                     // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetShardEnchantParameter;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetSnapShot
// 0x0040 (0x0040 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetSnapShot final
{
public:
	struct FPoseSnapshot                          bpp__SnapShot__pf;                                 // 0x0000(0x0038)(Parm, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetSnapShot;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetUseEmissive
// 0x002C (0x002C - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetUseEmissive final
{
public:
	bool                                          bpp__Use__pf;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__FlashDuration__pf;                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__EmissiveColor__pf;                            // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Priority__pf;                                 // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__EmissiveMin__pf;                              // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__EmissiveMax__pf;                              // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__EmissiveContrast__pf;                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Duration__pf;                                 // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetUseEmissive;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SetWaterFallSpeedRate
// 0x000C (0x000C - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SetWaterFallSpeedRate final
{
public:
	float                                         bpp__VerticalSpeedRate__pf;                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__HorizontalSpeedRate__pf;                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SetWaterFallSpeedRate;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SpawnBullet
// 0x0040 (0x0040 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SpawnBullet final
{
public:
	class FName                                   bpp__BulletID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SpawnWorldLocation__pf;                       // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__TargetWorldLocation__pf;                      // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBulletDirection                              bpp__DirectionType__pf;                            // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               bpp__SpawnerType__pf;                              // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsOverRoom__pf;                               // 0x0022(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__ShardID__pf;                                  // 0x0024(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSpawn__pf;                                  // 0x002C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBulletActor*                         bpp__BulletIns__pf;                                // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 bpp__BulletSubActor__pf;                           // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SpawnBullet;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SpawnBulletEx
// 0x0360 (0x0360 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SpawnBulletEx final
{
public:
	class FName                                   bpp__BulletID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBBulletParameter                     bpp__BulletParamter__pf;                           // 0x0008(0x01E0)(Parm, NativeAccessSpecifierPublic)
	struct FPBBallisticParameter                  bpp__BallisticParameter__pf;                       // 0x01E8(0x0140)(Parm, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SpawnWorldLocation__pf;                       // 0x0328(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__TargetWorldLocation__pf;                      // 0x0334(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBulletDirection                              bpp__DirectionType__pf;                            // 0x0340(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               bpp__SpawnerType__pf;                              // 0x0341(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsOverRoom__pf;                               // 0x0342(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_343[0x1];                                      // 0x0343(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__ShardID__pf;                                  // 0x0344(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSpawn__pf;                                  // 0x034C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBulletActor*                         bpp__BulletIns__pf;                                // 0x0350(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 bpp__BulletSubActor__pf;                           // 0x0358(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SpawnBulletEx;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SpawnEffect
// 0x0040 (0x0040 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SpawnEffect final
{
public:
	class FName                                   bpp__EffectID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SpawnWorldLocation__pf;                       // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Scale__pf;                                    // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__TimeDilation__pf;                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__RotationVector__pf;                           // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               bpp__SpawnType__pf;                                // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSpawn__pf;                                  // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APBParticle*                            bpp__EffectInstance__pf;                           // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*               bpp__ParticleSystemComponent__pf;                  // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SpawnEffect;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_SpawnWeaponTrail
// 0x000C (0x000C - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_SpawnWeaponTrail final
{
public:
	class FName                                   bpp__SocketName__pf;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_AttackStance                              bpp__StanceType__pf;                               // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_SpawnWeaponTrail;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_StandUpFromChair
// 0x0001 (0x0001 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_StandUpFromChair final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_StandUpFromChair;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_StartBookRead
// 0x0001 (0x0001 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_StartBookRead final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_StartBookRead;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_StartFacialAnimation
// 0x0002 (0x0002 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_StartFacialAnimation final
{
public:
	EPBFacialExpression                           bpp__FacialType__pf;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_StartFacialAnimation;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_TransForceStep
// 0x0005 (0x0005 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_TransForceStep final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_TransForceStep;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_UpdateMasteryAttackRate
// 0x0018 (0x0018 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_UpdateMasteryAttackRate final
{
public:
	class FName                                   bpp__WeaponID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsCheckShard__pf;                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__ShardID__pf;                                  // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsEquip__pf;                                  // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0015(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_UpdateMasteryAttackRate;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerCtr_WarpRequest
// 0x0018 (0x0018 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerCtr_WarpRequest final
{
public:
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__return__pf;                                   // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerCtr_WarpRequest;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerInfo_GetActionRequestManager
// 0x0008 (0x0008 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerInfo_GetActionRequestManager final
{
public:
	class UOBJ_ActionRequest_C*                   bpp__ActReqMan__pf;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerInfo_GetActionRequestManager;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerInfo_GetAimDirectionVector
// 0x0010 (0x0010 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerInfo_GetAimDirectionVector final
{
public:
	bool                                          bpp__IsAiming__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__WorldVector__pf;                              // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerInfo_GetAimDirectionVector;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerInfo_GetAimDirectionWorldVector
// 0x000C (0x000C - 0x0000)
struct IAccessablePlayerInfo_C_PlayerInfo_GetAimDirectionWorldVector final
{
public:
	struct FVector                                bpp__WorldVector__pf;                              // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerInfo_GetAimDirectionWorldVector;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerInfo_GetAimRotation
// 0x000C (0x000C - 0x0000)
struct IAccessablePlayerInfo_C_PlayerInfo_GetAimRotation final
{
public:
	struct FRotator                               bpp__Rotation__pf;                                 // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerInfo_GetAimRotation;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerInfo_GetBoolValue
// 0x0002 (0x0002 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerInfo_GetBoolValue final
{
public:
	EPB_PlayerInfoBoolType                        bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerInfo_GetBoolValue;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerInfo_GetBulletInfo
// 0x0014 (0x0014 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerInfo_GetBulletInfo final
{
public:
	int32                                         bpp__ConsumeNum__pf;                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__DamageRate__pf;                               // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__DamageMasterID__pf;                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsNotConsume__pf;                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsHoming__pf;                                 // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_P0000_GunDamageType                       bpp__DamageType__pf;                               // 0x0012(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerInfo_GetBulletInfo;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerInfo_GetEquipActor
// 0x0018 (0x0018 - 0x0000)
struct IAccessablePlayerInfo_C_PlayerInfo_GetEquipActor final
{
public:
	ECarriedCatalog                               bpp__EquipType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEQBP_Root_C*                           bpp__EquipActor__pf;                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsValid__pf;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAccessablePlayerInfo_C_PlayerInfo_GetEquipActor;

// Function IAccessablePlayerInfo.IAccessablePlayerInfo_C.PlayerInfo_GetEquipItemID
// 0x000C (0x000C - 0x0000)
struct IAccessablePlayerInfo_C_PlayerInfo_GetEquipItemID final
{
public:
	ECarriedCatalog                               bpp__EquipType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsPrevEquip__pf;                              // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
