#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InitialInteractionScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InitialInteractionScreen.InitialInteractionScreen_C
// 0x0030 (0x0270 - 0x0240)
class UInitialInteractionScreen_C final : public UPBInitialInteractionScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTitleCursor_BP_C*                      PressAnyKey;                                       // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextPanel_C*                     SwitchProfile;                                     // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVersionNumber_C*                       VersionNumber;                                     // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnFinished;                                        // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_InitialInteractionScreen(int32 EntryPoint);
	void BeginInitialInteractionScreen();
	void Hide();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("InitialInteractionScreen_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InitialInteractionScreen_C")
	}
	static class UInitialInteractionScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInitialInteractionScreen_C>();
	}
};
DUMPER7_ASSERTS_UInitialInteractionScreen_C;

}

