#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Int_ShovelArmor

#include "Basic.hpp"


namespace SDK::Params
{

// Function Int_ShovelArmor.Int_ShovelArmor_C.BeginShovelArmor
// 0x0001 (0x0001 - 0x0000)
struct Int_ShovelArmor_C_BeginShovelArmor final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Int_ShovelArmor_C_BeginShovelArmor;

// Function Int_ShovelArmor.Int_ShovelArmor_C.BeginShovelDown
// 0x0001 (0x0001 - 0x0000)
struct Int_ShovelArmor_C_BeginShovelDown final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Int_ShovelArmor_C_BeginShovelDown;

// Function Int_ShovelArmor.Int_ShovelArmor_C.EndShovelArmor
// 0x0001 (0x0001 - 0x0000)
struct Int_ShovelArmor_C_EndShovelArmor final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Int_ShovelArmor_C_EndShovelArmor;

// Function Int_ShovelArmor.Int_ShovelArmor_C.EndShovelDown
// 0x0001 (0x0001 - 0x0000)
struct Int_ShovelArmor_C_EndShovelDown final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Int_ShovelArmor_C_EndShovelDown;

// Function Int_ShovelArmor.Int_ShovelArmor_C.ShovelArmor_Off
// 0x0001 (0x0001 - 0x0000)
struct Int_ShovelArmor_C_ShovelArmor_Off final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Int_ShovelArmor_C_ShovelArmor_Off;

// Function Int_ShovelArmor.Int_ShovelArmor_C.ShovelArmor_Spawn
// 0x0001 (0x0001 - 0x0000)
struct Int_ShovelArmor_C_ShovelArmor_Spawn final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Int_ShovelArmor_C_ShovelArmor_Spawn;

}

