#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemListItem

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ItemListItem.ItemListItem_C.ExecuteUbergraph_ItemListItem
// 0x0004 (0x0004 - 0x0000)
struct ItemListItem_C_ExecuteUbergraph_ItemListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemListItem_C_ExecuteUbergraph_ItemListItem;

// Function ItemListItem.ItemListItem_C.SetNewIcon
// 0x0001 (0x0001 - 0x0000)
struct ItemListItem_C_SetNewIcon final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemListItem_C_SetNewIcon;

// Function ItemListItem.ItemListItem_C.GetItemData
// 0x0100 (0x0100 - 0x0000)
struct ItemListItem_C_GetItemData final
{
public:
	struct FPBItemCatalogData                     itemData_0;                                        // 0x0000(0x0078)(Parm, OutParm, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         inventry;                                          // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemCatalogData                     CallFunc_GetItemDataById_itemData;                 // 0x0088(0x0078)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemListItem_C_GetItemData;

// Function ItemListItem.ItemListItem_C.SetDescription
// 0x0018 (0x0018 - 0x0000)
struct ItemListItem_C_SetDescription final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_ItemListItem_C_SetDescription;

// Function ItemListItem.ItemListItem_C.SetNumber
// 0x0020 (0x0020 - 0x0000)
struct ItemListItem_C_SetNumber final
{
public:
	int32                                         Number_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          infinite;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isInfinite;                                        // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
DUMPER7_ASSERTS_ItemListItem_C_SetNumber;

// Function ItemListItem.ItemListItem_C.SetEquipIcon
// 0x0001 (0x0001 - 0x0000)
struct ItemListItem_C_SetEquipIcon final
{
public:
	bool                                          IsEquip;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemListItem_C_SetEquipIcon;

// Function ItemListItem.ItemListItem_C.IsEquipedItem
// 0x0028 (0x0028 - 0x0000)
struct ItemListItem_C_IsEquipedItem final
{
public:
	int32                                         Slot_0;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEquip;                                           // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         slot_id;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCharacterInventoryComponent*         Inventory;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEquipedItem_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemListItem_C_IsEquipedItem;

// Function ItemListItem.ItemListItem_C.SetDispCursor
// 0x0010 (0x0010 - 0x0000)
struct ItemListItem_C_SetDispCursor final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffChoiceBP_C*                         NewLocalVar_1;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemListItem_C_SetDispCursor;

// Function ItemListItem.ItemListItem_C.SetSelectEnable
// 0x0001 (0x0001 - 0x0000)
struct ItemListItem_C_SetSelectEnable final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemListItem_C_SetSelectEnable;

// Function ItemListItem.ItemListItem_C.UnsetNewIcon
// 0x0010 (0x0010 - 0x0000)
struct ItemListItem_C_UnsetNewIcon final
{
public:
	class UPBCharacterInventoryComponent*         inventry;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemListItem_C_UnsetNewIcon;

// Function ItemListItem.ItemListItem_C.SetConsumedIcon
// 0x0001 (0x0001 - 0x0000)
struct ItemListItem_C_SetConsumedIcon final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemListItem_C_SetConsumedIcon;

// Function ItemListItem.ItemListItem_C.GetCraftItem
// 0x0138 (0x0138 - 0x0000)
struct ItemListItem_C_GetCraftItem final
{
public:
	class UPBCraftManager*                        ターゲット;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBCraftMasterData                     CraftOut;                                          // 0x0008(0x0090)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0098(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBCraftMasterData                     CallFunc_GetCraftById_CraftOut;                    // 0x00A0(0x0090)()
	bool                                          CallFunc_GetCraftById_ReturnValue;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemListItem_C_GetCraftItem;

// Function ItemListItem.ItemListItem_C.GetPosessionVacantNum
// 0x0020 (0x0020 - 0x0000)
struct ItemListItem_C_GetPosessionVacantNum final
{
public:
	int32                                         ret;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         Inventory;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemPosessionMax_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemListItem_C_GetPosessionVacantNum;

// Function ItemListItem.ItemListItem_C.SetVisibleNum
// 0x0002 (0x0002 - 0x0000)
struct ItemListItem_C_SetVisibleNum final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              NumVisible;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemListItem_C_SetVisibleNum;

// Function ItemListItem.ItemListItem_C.IsMatchItemCategory
// 0x00A8 (0x00A8 - 0x0000)
struct ItemListItem_C_IsMatchItemCategory final
{
public:
	TArray<ECarriedCatalog>                       Caegories;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          isEnable;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NewLocalVar_0;                                     // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ECarriedCatalog                               Element;                                           // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarriedCatalog                               CallFunc_Array_Get_Item;                           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemCatalogData                     CallFunc_GetItemData_itemData;                     // 0x0028(0x0078)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemListItem_C_IsMatchItemCategory;

// Function ItemListItem.ItemListItem_C.SetShardRank
// 0x0020 (0x0020 - 0x0000)
struct ItemListItem_C_SetShardRank final
{
public:
	int32                                         Rank;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCharacterInventoryComponent*         Inventory;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShardRank_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemListItem_C_SetShardRank;

// Function ItemListItem.ItemListItem_C.ItemCraft
// 0x0018 (0x0018 - 0x0000)
struct ItemListItem_C_ItemCraft final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCraftManager*                        CallFunc_GetCraftManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CookNewItem_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemListItem_C_ItemCraft;

// Function ItemListItem.ItemListItem_C.ItemDismantle
// 0x0010 (0x0010 - 0x0000)
struct ItemListItem_C_ItemDismantle final
{
public:
	class UPBCraftManager*                        CallFunc_GetCraftManager_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DismantleItem_ReturnValue;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemListItem_C_ItemDismantle;

// Function ItemListItem.ItemListItem_C.SetItemInfo
// 0x0080 (0x0080 - 0x0000)
struct ItemListItem_C_SetItemInfo final
{
public:
	struct FPBItemCatalogData                     Item;                                              // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          MaxedOut;                                          // 0x0078(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue1;           // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemListItem_C_SetItemInfo;

// Function ItemListItem.ItemListItem_C.SetNameText
// 0x0018 (0x0018 - 0x0000)
struct ItemListItem_C_SetNameText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_ItemListItem_C_SetNameText;

// Function ItemListItem.ItemListItem_C.SetIconImage
// 0x0004 (0x0004 - 0x0000)
struct ItemListItem_C_SetIconImage final
{
public:
	float                                         CallFunc_Conv_StringToFloat_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemListItem_C_SetIconImage;

// Function ItemListItem.ItemListItem_C.SetFavoriteIcon
// 0x0001 (0x0001 - 0x0000)
struct ItemListItem_C_SetFavoriteIcon final
{
public:
	bool                                          IsFavorite_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemListItem_C_SetFavoriteIcon;

// Function ItemListItem.ItemListItem_C.IsFavoriteItem
// 0x0020 (0x0020 - 0x0000)
struct ItemListItem_C_IsFavoriteItem final
{
public:
	bool                                          IsFavorite_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         slot_id;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         Inventory;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFavoriteItem_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemListItem_C_IsFavoriteItem;

// Function ItemListItem.ItemListItem_C.UpdateTextColor
// 0x0050 (0x0050 - 0x0000)
struct ItemListItem_C_UpdateTextColor final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor1;                     // 0x0028(0x0028)()
};
DUMPER7_ASSERTS_ItemListItem_C_UpdateTextColor;

// Function ItemListItem.ItemListItem_C.RandomItemCraft
// 0x0158 (0x0158 - 0x0000)
struct ItemListItem_C_RandomItemCraft final
{
public:
	class FName                                   randomId;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBCraftMasterData                     CraftRecipe;                                       // 0x0008(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         ReturnValue;                                       // 0x0098(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBGameInstance*                        CallFunc_GetPBGameInstancePure_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCraftManager*                        CallFunc_GetCraftManager_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBCraftMasterData                     CallFunc_CreateRecipeFromIds_PBCraftMasterData;    // 0x00B8(0x0090)()
	class UPBCraftManager*                        CallFunc_GetCraftManager_ReturnValue1;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CookNewRandomItem_ReturnValue;            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CookNewRandomItem_ReturnValue1;           // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemListItem_C_RandomItemCraft;

// Function ItemListItem.ItemListItem_C.CreateRecipeFromIds
// 0x0450 (0x0450 - 0x0000)
struct ItemListItem_C_CreateRecipeFromIds final
{
public:
	class FName                                   Output_ID;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Ingredient_ID;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBCraftMasterData                     In_Random_Recipe;                                  // 0x0010(0x0090)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPBCraftMasterData                     PBCraftMasterData;                                 // 0x00A0(0x0090)(Parm, OutParm)
	struct FPBCraftMasterData                     RecipeResult;                                      // 0x0130(0x0090)(Edit, BlueprintVisible)
	struct FPBCraftMasterData                     randomRecipe;                                      // 0x01C0(0x0090)(Edit, BlueprintVisible)
	struct FPBCraftMasterData                     OriginalRecipe;                                    // 0x0250(0x0090)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBGameInstance*                        CallFunc_GetPBGameInstancePure_ReturnValue;        // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2[0x2];                                      // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBGameInstance*                        CallFunc_GetPBGameInstancePure_ReturnValue1;       // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select1_Default;                            // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x030D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E[0x2];                                      // 0x030E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCraftManager*                        CallFunc_GetCraftManager_ReturnValue;              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCraftManager*                        CallFunc_GetCraftManager_ReturnValue1;             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBCraftMasterData                     CallFunc_GetCraftRecipeById_CraftOut;              // 0x0320(0x0090)()
	bool                                          CallFunc_GetCraftRecipeById_ReturnValue;           // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBCraftMasterData                     CallFunc_GetCraftRecipeById_CraftOut1;             // 0x03B8(0x0090)()
	bool                                          CallFunc_GetCraftRecipeById_ReturnValue1;          // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemListItem_C_CreateRecipeFromIds;

// Function ItemListItem.ItemListItem_C.SetSoldOut
// 0x0001 (0x0001 - 0x0000)
struct ItemListItem_C_SetSoldOut final
{
public:
	bool                                          IsSoldOut;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemListItem_C_SetSoldOut;

// Function ItemListItem.ItemListItem_C.SetPending
// 0x0001 (0x0001 - 0x0000)
struct ItemListItem_C_SetPending final
{
public:
	bool                                          IsPending;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemListItem_C_SetPending;

}

