#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mr_MultiBlock_New2

#include "Basic.hpp"

#include "ProjectBlood_classes.hpp"


namespace SDK
{

// DynamicClass Mr_MultiBlock_New2.Mr_MultiBlock_New2_C
// 0x0020 (0x0550 - 0x0530)
class AMr_MultiBlock_New2_C final : public APBWorldCollisionMeshBase
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        Scene;                                             // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0544(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Depth;                                             // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          flipX;                                             // 0x054C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          flipY;                                             // 0x054D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          flipZ;                                             // 0x054E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54F[0x1];                                      // 0x054F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Mr_MultiBlock_New2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Mr_MultiBlock_New2_C")
	}
	static class AMr_MultiBlock_New2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMr_MultiBlock_New2_C>();
	}
};
DUMPER7_ASSERTS_AMr_MultiBlock_New2_C;

}

