#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NumberOnlyTextBox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.ExecuteUbergraph_NumberOnlyTextBox
// 0x0098 (0x0098 - 0x0000)
struct NumberOnlyTextBox_C_ExecuteUbergraph_NumberOnlyTextBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text1;                  // 0x0020(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0040(0x0018)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x005C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_ExecuteUbergraph_NumberOnlyTextBox;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.Tick
// 0x003C (0x003C - 0x0000)
struct NumberOnlyTextBox_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_Tick;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct NumberOnlyTextBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_PreConstruct;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.BndEvt__TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct NumberOnlyTextBox_C_BndEvt__TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   text_0;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_BndEvt__TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.BndEvt__TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct NumberOnlyTextBox_C_BndEvt__TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   text_0;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_BndEvt__TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.OnTick
// 0x0001 (0x0001 - 0x0000)
struct NumberOnlyTextBox_C_OnTick final
{
public:
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_OnTick;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.Invalidate
// 0x00A8 (0x00A8 - 0x0000)
struct NumberOnlyTextBox_C_Invalidate final
{
public:
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0010(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue1;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue1;                     // 0x0038(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue2;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_Invalidate;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.Activate
// 0x0030 (0x0030 - 0x0000)
struct NumberOnlyTextBox_C_Activate final
{
public:
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0000(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue1;                     // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_Activate;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.OnTextCommited
// 0x0006 (0x0006 - 0x0000)
struct NumberOnlyTextBox_C_OnTextCommited final
{
public:
	ETextCommit                                   Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextCommit                                   NewLocalVar_0;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName1_CmpSuccess;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_OnTextCommited;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.GetInputText
// 0x0028 (0x0028 - 0x0000)
struct NumberOnlyTextBox_C_GetInputText final
{
public:
	class FText                                   text_0;                                            // 0x0000(0x0018)(Parm, OutParm)
	class FString                                 Name_0;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_GetInputText;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.OnDecideInput
// 0x0001 (0x0001 - 0x0000)
struct NumberOnlyTextBox_C_OnDecideInput final
{
public:
	bool                                          CallFunc_IsReturnFocus_is_enable;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_OnDecideInput;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.OnCancelInput
// 0x0001 (0x0001 - 0x0000)
struct NumberOnlyTextBox_C_OnCancelInput final
{
public:
	bool                                          CallFunc_IsReturnFocus_is_enable;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_OnCancelInput;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.IsReturnFocus
// 0x0020 (0x0020 - 0x0000)
struct NumberOnlyTextBox_C_IsReturnFocus final
{
public:
	bool                                          is_enable;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      Owner;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUserFocus_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_IsReturnFocus;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.SetTextColor
// 0x0050 (0x0050 - 0x0000)
struct NumberOnlyTextBox_C_SetTextColor final
{
public:
	struct FSlateColor                            Input;                                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateColor                            Color;                                             // 0x0028(0x0028)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_SetTextColor;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.SetInputText
// 0x0030 (0x0030 - 0x0000)
struct NumberOnlyTextBox_C_SetInputText final
{
public:
	class FText                                   Input;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   txt;                                               // 0x0018(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_SetInputText;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.UpdateDefault
// 0x0018 (0x0018 - 0x0000)
struct NumberOnlyTextBox_C_UpdateDefault final
{
public:
	class FText                                   CallFunc_GetInputText_Text;                        // 0x0000(0x0018)()
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_UpdateDefault;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.UpdateText
// 0x0070 (0x0070 - 0x0000)
struct NumberOnlyTextBox_C_UpdateText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 STR;                                               // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	class FString                                 CallFunc_TrimInvalidChars_Out;                     // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_UpdateText;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.PlayBlink
// 0x0008 (0x0008 - 0x0000)
struct NumberOnlyTextBox_C_PlayBlink final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_PlayBlink;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.SetCommitedText
// 0x0018 (0x0018 - 0x0000)
struct NumberOnlyTextBox_C_SetCommitedText final
{
public:
	class FText                                   input_text;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_SetCommitedText;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.GetCommitedText
// 0x0030 (0x0030 - 0x0000)
struct NumberOnlyTextBox_C_GetCommitedText final
{
public:
	class FText                                   Output;                                            // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_GetCommitedText;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.UpdateCommitedText
// 0x0030 (0x0030 - 0x0000)
struct NumberOnlyTextBox_C_UpdateCommitedText final
{
public:
	class FText                                   txt;                                               // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetInputText_Text;                        // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_UpdateCommitedText;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.HideTextShowContent
// 0x0008 (0x0008 - 0x0000)
struct NumberOnlyTextBox_C_HideTextShowContent final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_HideTextShowContent;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.TrimInvalidChars
// 0x0078 (0x0078 - 0x0000)
struct NumberOnlyTextBox_C_TrimInvalidChars final
{
public:
	class FString                                 In;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Out;                                               // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue;  // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumber_IsNumber;                        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_TrimInvalidChars;

// Function NumberOnlyTextBox.NumberOnlyTextBox_C.IsNumber
// 0x0018 (0x0018 - 0x0000)
struct NumberOnlyTextBox_C_IsNumber final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsNumber_0;                                        // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_NumberOnlyTextBox_C_IsNumber;

}

