#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NumberOnlyTextBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NumberOnlyTextBox.NumberOnlyTextBox_C
// 0x00A8 (0x0300 - 0x0258)
class UNumberOnlyTextBox_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Blink;                                             // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Content;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       TextBox;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   text;                                              // 0x0278(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	UMulticastDelegateProperty_                   EventDecideInput;                                  // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Default;                                           // 0x02A0(0x0018)(Edit, BlueprintVisible)
	UMulticastDelegateProperty_                   EventCancelInput;                                  // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Length;                                            // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isEnable;                                          // 0x02CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OldText;                                           // 0x02D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   CurrentText;                                       // 0x02E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_NumberOnlyTextBox(int32 EntryPoint);
	void RevertText();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BndEvt__TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& text_0);
	void BndEvt__TextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& text_0, ETextCommit CommitMethod);
	void カスタムイベント_1();
	void カスタムイベント_0();
	void Initialize();
	void Setup();
	void OnTick();
	void Invalidate();
	void Activate();
	void OnTextCommited(ETextCommit Param);
	void Reset();
	void GetInputText(class FText* text_0);
	void OnDecideInput();
	void OnCancelInput();
	void IsReturnFocus(bool* is_enable);
	void SetTextColor(const struct FSlateColor& Input);
	void SetInputText(const class FText& Input);
	void UpdateDefault();
	void UpdateText(const class FText& InText);
	void PlayBlink();
	void SetCommitedText(const class FText& input_text);
	void GetCommitedText(class FText* Output);
	void UpdateCommitedText();
	void HideTextShowContent();
	void TrimInvalidChars(const class FString& In, class FString* Out);
	void IsNumber(const class FString& String, bool* IsNumber_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NumberOnlyTextBox_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NumberOnlyTextBox_C")
	}
	static class UNumberOnlyTextBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNumberOnlyTextBox_C>();
	}
};
DUMPER7_ASSERTS_UNumberOnlyTextBox_C;

}

