#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_ExecCommon

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "EPB_ExecCommonList_structs.hpp"


namespace SDK::Params
{

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.Exec_Active
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ExecCommon_C_Exec_Active final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_Exec_Active;

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.Exec_Damage
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ExecCommon_C_Exec_Damage final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_Exec_Damage;

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.Exec_Dead
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ExecCommon_C_Exec_Dead final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_Exec_Dead;

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.Exec_Fall
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ExecCommon_C_Exec_Fall final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_Exec_Fall;

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.Exec_Land
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ExecCommon_C_Exec_Land final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_Exec_Land;

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.Exec_NotActive
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ExecCommon_C_Exec_NotActive final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_Exec_NotActive;

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.Exec_Template
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ExecCommon_C_Exec_Template final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_Exec_Template;

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.Exec_Turn
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ExecCommon_C_Exec_Turn final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_Exec_Turn;

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.ExecCommon
// 0x0002 (0x0002 - 0x0000)
struct OBJ_ExecCommon_C_ExecCommon final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_ExecCommonList                            bpp__ExecType__pf;                                 // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_ExecCommon;

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.GetExecMainStep
// 0x0002 (0x0002 - 0x0000)
struct OBJ_ExecCommon_C_GetExecMainStep final
{
public:
	EPB_ExecCommonList                            bpp__ExecType__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__WildCard__pf;                                 // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_GetExecMainStep;

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.GetExecWildCard
// 0x0002 (0x0002 - 0x0000)
struct OBJ_ExecCommon_C_GetExecWildCard final
{
public:
	EPB_ExecCommonList                            bpp__ExecType__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_GetExecWildCard;

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.SetExecMainStep
// 0x0002 (0x0002 - 0x0000)
struct OBJ_ExecCommon_C_SetExecMainStep final
{
public:
	EPB_ExecCommonList                            bpp__ExecType__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_SetExecMainStep;

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.SetExecMainSteps
// 0x0007 (0x0007 - 0x0000)
struct OBJ_ExecCommon_C_SetExecMainSteps final
{
public:
	EPBStep                                       bpp__Dead__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__Damage__pf;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__Fall__pf;                                     // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__Land__pf;                                     // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__Turn__pf;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__Active__pf;                                   // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__NotActive__pf;                                // 0x0006(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_SetExecMainSteps;

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.SetExecWildCard
// 0x0002 (0x0002 - 0x0000)
struct OBJ_ExecCommon_C_SetExecWildCard final
{
public:
	EPB_ExecCommonList                            bpp__ExecType__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_SetExecWildCard;

// Function OBJ_ExecCommon.OBJ_ExecCommon_C.SetExecWildCards
// 0x0007 (0x0007 - 0x0000)
struct OBJ_ExecCommon_C_SetExecWildCards final
{
public:
	EStepEntry                                    bpp__Dead__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStepEntry                                    bpp__Damage__pf;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStepEntry                                    bpp__Fall__pf;                                     // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStepEntry                                    bpp__Land__pf;                                     // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStepEntry                                    bpp__Turn__pf;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStepEntry                                    bpp__Active__pf;                                   // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStepEntry                                    bpp__NotActive__pf;                                // 0x0006(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExecCommon_C_SetExecWildCards;

}

