#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_KeyInfo

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function OBJ_KeyInfo.OBJ_KeyInfo_C.GetLetGoTime
// 0x0008 (0x0008 - 0x0000)
struct OBJ_KeyInfo_C_GetLetGoTime final
{
public:
	EPBGameKey                                    bpp__KeyType__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Time__pf;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_KeyInfo_C_GetLetGoTime;

// Function OBJ_KeyInfo.OBJ_KeyInfo_C.IsKey
// 0x0002 (0x0002 - 0x0000)
struct OBJ_KeyInfo_C_IsKey final
{
public:
	EPBGameKey                                    bpp__KeyType__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_KeyInfo_C_IsKey;

// Function OBJ_KeyInfo.OBJ_KeyInfo_C.UpdateEffectiveShardKey
// 0x0001 (0x0001 - 0x0000)
struct OBJ_KeyInfo_C_UpdateEffectiveShardKey final
{
public:
	bool                                          bpp__IsKey__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_KeyInfo_C_UpdateEffectiveShardKey;

// Function OBJ_KeyInfo.OBJ_KeyInfo_C.UpdateKeyInfo
// 0x0002 (0x0002 - 0x0000)
struct OBJ_KeyInfo_C_UpdateKeyInfo final
{
public:
	EPBGameKey                                    bpp__KeyEnum__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsKey__pf;                                    // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_KeyInfo_C_UpdateKeyInfo;

}

