#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_ActiveSensorControler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function OBJ_ActiveSensorControler.OBJ_ActiveSensorControler_C.CheckActiveSensor
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActiveSensorControler_C_CheckActiveSensor final
{
public:
	bool                                          bpp__IsSuccess__pf;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActiveSensorControler_C_CheckActiveSensor;

// Function OBJ_ActiveSensorControler.OBJ_ActiveSensorControler_C.CheckDamage
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActiveSensorControler_C_CheckDamage final
{
public:
	bool                                          bpp__IsSuccess__pf;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActiveSensorControler_C_CheckDamage;

// Function OBJ_ActiveSensorControler.OBJ_ActiveSensorControler_C.CheckDidDealDamage
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActiveSensorControler_C_CheckDidDealDamage final
{
public:
	bool                                          bpp__IsSuccess__pf;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActiveSensorControler_C_CheckDidDealDamage;

// Function OBJ_ActiveSensorControler.OBJ_ActiveSensorControler_C.CheckNoActiveSensor
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActiveSensorControler_C_CheckNoActiveSensor final
{
public:
	bool                                          bpp__IsSuccess__pf;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActiveSensorControler_C_CheckNoActiveSensor;

// Function OBJ_ActiveSensorControler.OBJ_ActiveSensorControler_C.CheckScreenOut
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActiveSensorControler_C_CheckScreenOut final
{
public:
	bool                                          bpp__IsSuccess__pf;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActiveSensorControler_C_CheckScreenOut;

// Function OBJ_ActiveSensorControler.OBJ_ActiveSensorControler_C.DeleteActiveSensor
// 0x0004 (0x0004 - 0x0000)
struct OBJ_ActiveSensorControler_C_DeleteActiveSensor final
{
public:
	int32                                         bpp__ID__pf__const;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActiveSensorControler_C_DeleteActiveSensor;

// Function OBJ_ActiveSensorControler.OBJ_ActiveSensorControler_C.DeleteNoActiveSensor
// 0x0004 (0x0004 - 0x0000)
struct OBJ_ActiveSensorControler_C_DeleteNoActiveSensor final
{
public:
	int32                                         bpp__ID__pf__const;                                // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActiveSensorControler_C_DeleteNoActiveSensor;

// Function OBJ_ActiveSensorControler.OBJ_ActiveSensorControler_C.GetIsActive
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActiveSensorControler_C_GetIsActive final
{
public:
	bool                                          bpp__Is__pf;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActiveSensorControler_C_GetIsActive;

// Function OBJ_ActiveSensorControler.OBJ_ActiveSensorControler_C.GetStartPoint
// 0x000C (0x000C - 0x0000)
struct OBJ_ActiveSensorControler_C_GetStartPoint final
{
public:
	struct FVector                                bpp__Pos__pf;                                      // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActiveSensorControler_C_GetStartPoint;

// Function OBJ_ActiveSensorControler.OBJ_ActiveSensorControler_C.SetActiveSensor
// 0x0018 (0x0018 - 0x0000)
struct OBJ_ActiveSensorControler_C_SetActiveSensor final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Width__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Height__pf;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Offset__pf;                                   // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActiveSensorControler_C_SetActiveSensor;

// Function OBJ_ActiveSensorControler.OBJ_ActiveSensorControler_C.SetConditions
// 0x0005 (0x0005 - 0x0000)
struct OBJ_ActiveSensorControler_C_SetConditions final
{
public:
	bool                                          bpp__ActiveSensor__pf;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__NoActiveSensor__pf;                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Damage__pf;                                   // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__DiaDealDamage__pf;                            // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ScreenOut__pf;                                // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActiveSensorControler_C_SetConditions;

// Function OBJ_ActiveSensorControler.OBJ_ActiveSensorControler_C.SetNoActiveSensor
// 0x0018 (0x0018 - 0x0000)
struct OBJ_ActiveSensorControler_C_SetNoActiveSensor final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Width__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Height__pf;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Offset__pf;                                   // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActiveSensorControler_C_SetNoActiveSensor;

}

