#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_ActionCheck

#include "Basic.hpp"

#include "Obj_Root_classes.hpp"
#include "ESubSubStep_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ESubStep_structs.hpp"
#include "EPB_AttackNo_structs.hpp"


namespace SDK
{

// DynamicClass OBJ_ActionCheck.OBJ_ActionCheck_C
// 0x0028 (0x00C8 - 0x00A0)
class UOBJ_ActionCheck_C final : public UOBJ_Root_C
{
public:
	class UCmp_StepCondition_C*                   CndIns;                                            // 0x00A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnIntervalTime;                                  // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsStopFlag;                                        // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_ActiveSensorControler_C*           ActInfo;                                           // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_Event_ChrIns_OBJ_ActionCheck_C;             // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBStepBase*                            K2Node_Event_StepIns_OBJ_ActionCheck_C;            // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void Check_Active(bool* bpp__IsExec__pf);
	void Check_Attack(bool* bpp__IsExec__pf);
	void CHECK_DAMAGE(bool* bpp__IsExec__pf);
	void Check_Dash(bool* bpp__IsExec__pf);
	void Check_Dead(bool* bpp__IsExec__pf);
	void Check_Evasion(bool* bpp__IsExec__pf);
	void Check_Fall(bool* bpp__IsExec__pf);
	void Check_Land(bool* bpp__IsExec__pf);
	void Check_Move(float bpp__MustInitrate__pf, float bpp__MustBestRate__pf, float bpp__DisEnableInitrate__pf, float bpp__DisEnableBestRate__pf, bool* bpp__IsExec__pf, bool* bpp__IsInit__pf, bool* bpp__IsBest__pf, float* bpp__Initrate__pf, float* bpp__BestRate__pf);
	void Check_NotActive(bool* bpp__IsExec__pf);
	void Check_Template(bool* bpp__IsExec__pf);
	void Check_Turn(const struct FVector& bpp__Position__pf, bool* bpp__IsExec__pf);
	void Exec_Active(EStepEntry bpp__WildCard__pf, EPBStep bpp__MainStep__pf, ESubStep bpp__SubStep__pf, ESubSubStep bpp__SubSubStep__pf, bool* bpp__IsExec__pf);
	void Exec_Attack(EStepEntry bpp__WildCard__pf, EPBStep bpp__MainStep__pf, ESubStep bpp__SubStep__pf, ESubSubStep bpp__SubSubStep__pf, EPB_AttackNo bpp__AttackNo__pf, bool* bpp__IsExec__pf);
	void Exec_Common(bool bpp__IsNotUseDead__pf, bool bpp__IsNotUseDamage__pf, bool bpp__IsNotUseFall__pf, bool bpp__IsNotUseLand__pf, bool bpp__IsNotUseTurn__pf, bool bpp__IsNotUseNotActive__pf, bool* bpp__IsExec__pf);
	void Exec_Idle(EStepEntry bpp__ActiveWildCard__pf, EPBStep bpp__ActiveMainStep__pf, ESubStep bpp__ActiveSubStep__pf, ESubSubStep bpp__ActiveSubSubStep__pf, EStepEntry bpp__NotActiveWildCard__pf, EPBStep bpp__NotActiveMainStep__pf, ESubStep bpp__NotActiveSubStep__pf, ESubSubStep bpp__NotActiveSubSubStep__pf, bool* bpp__IsExec__pf);
	void Exec_Move(EStepEntry bpp__WildCard__pf, EPBStep bpp__MainStep__pf, ESubStep bpp__SubStep__pf, ESubSubStep bpp__SubSubStep__pf, float bpp__MustInitrate__pf, float bpp__MustBestRate__pf, float bpp__DisEnableInitrate__pf, float bpp__DisEnableBestRate__pf, bool* bpp__IsExec__pf, bool* bpp__IsInit__pf, bool* bpp__IsBest__pf);
	void Exec_MoveStop(EStepEntry bpp__WildCard__pf, EPBStep bpp__MainStep__pf, ESubStep bpp__SubStep__pf, ESubSubStep bpp__SubSubStep__pf, float bpp__Duration__pf, float bpp__ReachDist__pf, float bpp__MinimumTime__pf, const struct FVector& bpp__DestPosition__pf, bool bpp__IsStopNearEnemy__pf, bool* bpp__IsExec__pf);
	void Exec_NotActive(EStepEntry bpp__WildCard__pf, EPBStep bpp__MainStep__pf, ESubStep bpp__SubStep__pf, ESubSubStep bpp__SubSubStep__pf, bool* bpp__IsExec__pf);
	void Exec_Template(EStepEntry bpp__WildCard__pf, EPBStep bpp__MainStep__pf, ESubStep bpp__SubStep__pf, ESubSubStep bpp__SubSubStep__pf, bool* bpp__IsExec__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OBJ_ActionCheck_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OBJ_ActionCheck_C")
	}
	static class UOBJ_ActionCheck_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOBJ_ActionCheck_C>();
	}
};
DUMPER7_ASSERTS_UOBJ_ActionCheck_C;

}

