#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_ExecCommon

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Obj_Root_classes.hpp"
#include "EPB_ExecCommonList_structs.hpp"


namespace SDK
{

// DynamicClass OBJ_ExecCommon.OBJ_ExecCommon_C
// 0x0050 (0x00F0 - 0x00A0)
class UOBJ_ExecCommon_C final : public UOBJ_Root_C
{
public:
	TArray<EStepEntry>                            ExecWildCard;                                      // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVector                                TurnTargetPosition;                                // 0x00B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnInterval;                                      // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOBJ_ActiveSensorControler_C*           ActInfo;                                           // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EPBStep>                               ExecMainStep;                                      // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          IsTrunFlipRotation;                                // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       K2Node_Event_ChrIns_OBJ_ExecCommon_C;              // 0x00E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBStepBase*                            K2Node_Event_StepIns_OBJ_ExecCommon_C;             // 0x00E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void Exec_Active(bool* bpp__IsExec__pf);
	void Exec_Damage(bool* bpp__IsExec__pf);
	void Exec_Dead(bool* bpp__IsExec__pf);
	void Exec_Fall(bool* bpp__IsExec__pf);
	void Exec_Land(bool* bpp__IsExec__pf);
	void Exec_NotActive(bool* bpp__IsExec__pf);
	void Exec_Template(bool* bpp__IsExec__pf);
	void Exec_Turn(bool* bpp__IsExec__pf);
	void ExecCommon(bool* bpp__IsExec__pf, EPB_ExecCommonList* bpp__ExecType__pf);
	void GetExecMainStep(EPB_ExecCommonList bpp__ExecType__pf, EPBStep* bpp__WildCard__pf);
	void GetExecWildCard(EPB_ExecCommonList bpp__ExecType__pf, EStepEntry* bpp__WildCard__pf);
	void SetExecMainStep(EPB_ExecCommonList bpp__ExecType__pf, EPBStep bpp__MainStep__pf);
	void SetExecMainSteps(EPBStep bpp__Dead__pf, EPBStep bpp__Damage__pf, EPBStep bpp__Fall__pf, EPBStep bpp__Land__pf, EPBStep bpp__Turn__pf, EPBStep bpp__Active__pf, EPBStep bpp__NotActive__pf);
	void SetExecWildCard(EPB_ExecCommonList bpp__ExecType__pf, EStepEntry bpp__WildCard__pf);
	void SetExecWildCards(EStepEntry bpp__Dead__pf, EStepEntry bpp__Damage__pf, EStepEntry bpp__Fall__pf, EStepEntry bpp__Land__pf, EStepEntry bpp__Turn__pf, EStepEntry bpp__Active__pf, EStepEntry bpp__NotActive__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OBJ_ExecCommon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OBJ_ExecCommon_C")
	}
	static class UOBJ_ExecCommon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOBJ_ExecCommon_C>();
	}
};
DUMPER7_ASSERTS_UOBJ_ExecCommon_C;

}

