#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_LandInfo

#include "Basic.hpp"

#include "Obj_Root_classes.hpp"


namespace SDK
{

// DynamicClass OBJ_LandInfo.OBJ_LandInfo_C
// 0x0060 (0x0100 - 0x00A0)
class UOBJ_LandInfo_C final : public UOBJ_Root_C
{
public:
	class UBoxComponent*                          RoomVolume;                                        // 0x00A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsExistRoomVolume;                                 // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CenterX;                                           // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentX;                                           // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CenterZ;                                           // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentZ;                                           // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SafeRight;                                         // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SafeLeft;                                          // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SafeTop;                                           // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SafeBottom;                                        // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          ChaosRoomCollision;                                // 0x00D0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ProcFrame;                                         // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentSafeRightDist;                              // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentSafeLeftDist;                               // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentSafeTopDist;                                // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentSafeBottomDist;                             // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       K2Node_Event_ChrIns_OBJ_LandInfo_C;                // 0x00F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBStepBase*                            K2Node_Event_StepIns_OBJ_LandInfo_C;               // 0x00F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void CalcRoomPositionRate(float bpp__Origin__pf, float bpp__Extent__pf, float bpp__Current__pf, float* bpp__Rate__pf);
	void CheckOverRoom(float bpp__Dist__pf, const struct FVector& bpp__Direction__pf, bool* bpp__IsSafeHorizontal__pf, float* bpp__HorizontalDist__pf, bool* bpp__IsSafeVertical__pf, float* bpp__VerticalDist__pf);
	void GetBackDistance(int32 bpp__BackBlock__pf, float* bpp__WallDistance__pf, float* bpp__CliffDistance__pf);
	void GetCeillPosition(const struct FVector& bpp__BasePosition__pf, struct FVector* bpp__CeillPosition__pf);
	void GetCurrentSafeDist(const struct FVector& bpp__Position__pf, float* bpp__RightDist__pf, float* bpp__LeftDist__pf, float* bpp__TopDist__pf, float* bpp__BottomDist__pf);
	void GetFrontBackDistance(int32 bpp__FrontBlock__pf, int32 bpp__BackBlock__pf, float* bpp__FrontDistance__pf, float* bpp__BackDistance__pf);
	void GetFrontDistance(int32 bpp__FrontBlock__pf, float* bpp__WallDistance__pf, float* bpp__CliffDistance__pf);
	void GetGroundSurfaceEffect(class FName bpp__TableID__pf, class FName* bpp__EffectID__pf);
	void GetRoomPosition(const struct FVector& bpp__TargetPosition__pf, float* bpp__XPosition__pf, float* bpp__ZPosition__pf);
	void GetRoomSurplus(const struct FVector& bpp__Position__pf, float* bpp__Right__pf, float* bpp__Left__pf, float* bpp__Top__pf, float* bpp__Bottom__pf);
	void GetRoomWorldLocationInfo(struct FPB_ST_RoomLocationInfo* bpp__CenterWorldLocation__pf);
	void GetWallCliffDistance(int32 bpp__Block__pf, float* bpp__WallDistance__pf, float* bpp__CliffDistance__pf);
	void GetWallCliffMoveDirectionDistance(int32 bpp__Block__pf, const struct FVector& bpp__Position__pf, float* bpp__WallDistance__pf, float* bpp__CliffDistance__pf);
	void GetWallDistFAndB(float bpp__Dist__pf, float* bpp__Front__pf, float* bpp__Back__pf);
	void GetWaterLocation(bool* bpp__IsInWater__pf, struct FVector* bpp__CenterLocation__pf, float* bpp__HalfWidth__pf, float* bpp__HalfHeight__pf);
	void GetWorldLocationFromRoomRate(float bpp__XRate__pf, float bpp__ZRate__pf, float* bpp__XPosition__pf, float* bpp__ZPosition__pf);
	void IntToWorldDirection(int32 bpp__ChrBlock__pf, int32* bpp__WorldBlock__pf);
	void IsSafeArea(bool* bpp__IsHorizontal__pf, bool* bpp__IsVertical__pf, bool* bpp__IsRight__pf, bool* bpp__IsTop__pf);
	void IsSafeAreaPosition(const struct FVector& bpp__Position__pf, bool* bpp__IsHorizontal__pf, bool* bpp__IsVertical__pf, bool* bpp__IsRight__pf, bool* bpp__IsTop__pf);
	void IsTouchWall(bool* bpp__IsTouch__pf, bool* bpp__IsForward__pf, struct FVector* bpp__Position__pf, struct FVector* bpp__Normal__pf);
	void ReturnSafeDist(float* bpp__RightDist__pf, float* bpp__LeftDist__pf, float* bpp__TopDist__pf, float* bpp__BottomDist__pf);
	void SetChaosRoomSetting(class UBoxComponent* bpp__ChaosRoomCollision__pf);
	void SetRoomInfo();
	void SetRoomSetting();
	void SetSafeAreaByDist(float bpp__RightDist__pf, float bpp__LeftDist__pf, float bpp__TopDist__pf, float bpp__BottomDist__pf, float* bpp__SafeRightDist__pf, float* bpp__SafeLeftDist__pf, float* bpp__SafeTopDist__pf, float* bpp__SafeBottomDist__pf);
	void SetSafeAreaByRate(float bpp__RightRate__pf, float bpp__LeftRate__pf, float bpp__TopRate__pf, float bpp__BottomRate__pf, float* bpp__SafeRightDist__pf, float* bpp__SafeLeftDist__pf, float* bpp__SafeTopDist__pf, float* bpp__SafeBottomDist__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OBJ_LandInfo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OBJ_LandInfo_C")
	}
	static class UOBJ_LandInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOBJ_LandInfo_C>();
	}
};
DUMPER7_ASSERTS_UOBJ_LandInfo_C;

}

