#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Obj_Root

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Obj_Root.OBJ_Root_C.BeginPlay
// 0x0008 (0x0008 - 0x0000)
struct OBJ_Root_C_BeginPlay final
{
public:
	class AActor*                                 bpp__TouchedActor__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Root_C_BeginPlay;

// Function Obj_Root.OBJ_Root_C.CustomEvent
// 0x0010 (0x0010 - 0x0000)
struct OBJ_Root_C_CustomEvent final
{
public:
	class APBBaseCharacter*                       bpp__ChrIns__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBStepBase*                            bpp__StepIns__pf;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Root_C_CustomEvent;

// Function Obj_Root.OBJ_Root_C.DeltaSecondValue
// 0x0008 (0x0008 - 0x0000)
struct OBJ_Root_C_DeltaSecondValue final
{
public:
	float                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__return__pf;                                   // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Root_C_DeltaSecondValue;

// Function Obj_Root.OBJ_Root_C.EndPlay
// 0x0010 (0x0010 - 0x0000)
struct OBJ_Root_C_EndPlay final
{
public:
	class AActor*                                 bpp__Actor__pf;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                bpp__EndPlayReason__pf;                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_Root_C_EndPlay;

// Function Obj_Root.OBJ_Root_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct OBJ_Root_C_Initialize final
{
public:
	class APBBaseCharacter*                       bpp__ChrIns__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBStepBase*                            bpp__StepIns__pf;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Root_C_Initialize;

// Function Obj_Root.OBJ_Root_C.OwnerBeginPlay
// 0x0001 (0x0001 - 0x0000)
struct OBJ_Root_C_OwnerBeginPlay final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Root_C_OwnerBeginPlay;

// Function Obj_Root.OBJ_Root_C.OwnerEndPlay
// 0x0001 (0x0001 - 0x0000)
struct OBJ_Root_C_OwnerEndPlay final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Root_C_OwnerEndPlay;

// Function Obj_Root.OBJ_Root_C.Update_PostStep
// 0x0001 (0x0001 - 0x0000)
struct OBJ_Root_C_Update_PostStep final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Root_C_Update_PostStep;

// Function Obj_Root.OBJ_Root_C.Update_PreStep
// 0x0001 (0x0001 - 0x0000)
struct OBJ_Root_C_Update_PreStep final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Root_C_Update_PreStep;

}

