#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_CharacterEventManager

#include "Basic.hpp"

#include "PBST_StepCommandParameters_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Obj_Root_classes.hpp"
#include "EPB_CharacterEventActionList_structs.hpp"


namespace SDK
{

// DynamicClass OBJ_CharacterEventManager.OBJ_CharacterEventManager_C
// 0x0088 (0x0128 - 0x00A0)
class UOBJ_CharacterEventManager_C final : public UOBJ_Root_C
{
public:
	TArray<bool>                                  EventRequest;                                      // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<float>                                 RequestValue;                                      // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FPBST_StepCommandParameters>    Requestparameter;                                  // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<bool>                                  EventRequestByKey;                                 // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          IsByKey;                                           // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBVirtualController*                   VirCon;                                            // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawRotation;                                       // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  PlayrRequest;                                      // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	EPBGameKey                                    InputMoveKey;                                      // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFinishLookAt;                                    // 0x0109(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FinishLookAtLocation;                              // 0x010C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_Event_ChrIns_OBJ_CharacterEventManager_C;   // 0x0118(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBStepBase*                            K2Node_Event_StepIns_OBJ_CharacterEventManager_C;  // 0x0120(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ClearAllPlayerRequest();
	void ExecCommand();
	void ExecEventCrouchEnd(bool* bpp__IsExec__pf);
	void ExecEventCrouchStart(bool* bpp__IsExec__pf);
	void ExecEventDead(bool* bpp__IsExec__pf);
	void ExecEventDelete(bool* bpp__IsExec__pf);
	void ExecEventIdle(bool* bpp__IsExec__pf);
	void ExecEventMagic(bool* bpp__IsExec__pf);
	void ExecEventMove(bool* bpp__IsExec__pf);
	void ExecEventStop(bool* bpp__IsExec__pf);
	void ExecEventTurn(bool* bpp__IsExec__pf);
	void ExecEventWarp(bool* bpp__IsExec__pf);
	void GetParameter(EPB_CharacterEventActionList bpp__Parameter__pf, struct FPBST_StepCommandParameters* bpp__ParameterValue__pf);
	void GetValue(EPB_CharacterEventActionList bpp__Event__pf, float* bpp__Value__pf);
	void IsPlayerRequest(EPB_CharacterEventActionList bpp__Type__pf, bool* bpp__IsRequest__pf);
	void IsRequest(EPB_CharacterEventActionList bpp__Event__pf, bool* bpp__IsRequest__pf);
	void IsRequestByKey(EPB_CharacterEventActionList bpp__Event__pf, bool* bpp__IsRequest__pf);
	void ReceiveEvent(class FName bpp__Command__pf, float bpp__FloatValue__pf);
	void ReceiveEventByKey(const struct FPBST_StepCommandParameters& bpp__Parameter__pf);
	void ResetAllRequest();
	void SetPlayerRequest(EPB_CharacterEventActionList bpp__Type__pf, bool bpp__Request__pf);
	void SetRequest(EPB_CharacterEventActionList bpp__Event__pf, bool bpp__IsRequest__pf, float bpp__Value__pf);
	void SetRequestByKey(EPB_CharacterEventActionList bpp__Event__pf, bool bpp__IsRequest__pf, const struct FPBST_StepCommandParameters& bpp__Value__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OBJ_CharacterEventManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OBJ_CharacterEventManager_C")
	}
	static class UOBJ_CharacterEventManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOBJ_CharacterEventManager_C>();
	}
};
DUMPER7_ASSERTS_UOBJ_CharacterEventManager_C;

}

