#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_DirControler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ColorData_structs.hpp"


namespace SDK::Params
{

// Function OBJ_DirControler.OBJ_DirControler_C.AccRotateAngle
// 0x0034 (0x0034 - 0x0000)
struct OBJ_DirControler_C_AccRotateAngle final
{
public:
	struct FVector                                bpp__StartPosition__pf;                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__DestPosition__pf;                             // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Conficient__pf;                               // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__ReachAngleDist__pf;                           // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ReachAngleMagnet__pf;                         // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__Direction__pf;                                // 0x0024(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsReach__pf;                                  // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_DirControler_C_AccRotateAngle;

// Function OBJ_DirControler.OBJ_DirControler_C.AddAngle
// 0x0010 (0x0010 - 0x0000)
struct OBJ_DirControler_C_AddAngle final
{
public:
	float                                         bpp__Angle__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Vector__pf;                                   // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_DirControler_C_AddAngle;

// Function OBJ_DirControler.OBJ_DirControler_C.AngleToVector
// 0x0010 (0x0010 - 0x0000)
struct OBJ_DirControler_C_AngleToVector final
{
public:
	float                                         bpp__Angle__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Vector__pf;                                   // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_DirControler_C_AngleToVector;

// Function OBJ_DirControler.OBJ_DirControler_C.GetCurrentAngle
// 0x0004 (0x0004 - 0x0000)
struct OBJ_DirControler_C_GetCurrentAngle final
{
public:
	float                                         bpp__Angle__pf;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_DirControler_C_GetCurrentAngle;

// Function OBJ_DirControler.OBJ_DirControler_C.GetFromedAngle
// 0x001C (0x001C - 0x0000)
struct OBJ_DirControler_C_GetFromedAngle final
{
public:
	struct FVector                                bpp__Base__pf;                                     // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Target__pf;                                   // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Angle__pf;                                    // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_DirControler_C_GetFromedAngle;

// Function OBJ_DirControler.OBJ_DirControler_C.GetLineRate
// 0x001C (0x001C - 0x0000)
struct OBJ_DirControler_C_GetLineRate final
{
public:
	struct FVector                                bpp__Base__pf;                                     // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Target__pf;                                   // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Rate__pf;                                     // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_DirControler_C_GetLineRate;

// Function OBJ_DirControler.OBJ_DirControler_C.IsPlusDirection
// 0x0010 (0x0010 - 0x0000)
struct OBJ_DirControler_C_IsPlusDirection final
{
public:
	struct FVector                                bpp__TargetPosition__pf;                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsPlus__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_DirControler_C_IsPlusDirection;

// Function OBJ_DirControler.OBJ_DirControler_C.SetAngleFromPosition
// 0x000C (0x000C - 0x0000)
struct OBJ_DirControler_C_SetAngleFromPosition final
{
public:
	struct FVector                                bpp__Position__pf;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_DirControler_C_SetAngleFromPosition;

// Function OBJ_DirControler.OBJ_DirControler_C.SetArrowParameter
// 0x0020 (0x0020 - 0x0000)
struct OBJ_DirControler_C_SetArrowParameter final
{
public:
	bool                                          bpp__IsDisp__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__Scale__pf;                                    // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColorData                             bpp__Corlor__pf;                                   // 0x0010(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_DirControler_C_SetArrowParameter;

// Function OBJ_DirControler.OBJ_DirControler_C.SetDispArrow
// 0x0001 (0x0001 - 0x0000)
struct OBJ_DirControler_C_SetDispArrow final
{
public:
	bool                                          bpp__IsDisp__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_DirControler_C_SetDispArrow;

// Function OBJ_DirControler.OBJ_DirControler_C.SetTargetAngle
// 0x0010 (0x0010 - 0x0000)
struct OBJ_DirControler_C_SetTargetAngle final
{
public:
	float                                         bpp__Angle__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Vector__pf;                                   // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_DirControler_C_SetTargetAngle;

// Function OBJ_DirControler.OBJ_DirControler_C.StartAngle
// 0x0010 (0x0010 - 0x0000)
struct OBJ_DirControler_C_StartAngle final
{
public:
	float                                         bpp__AngleSpeed__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MaxSpeed__pf;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Accel__pf;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Brake__pf;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_DirControler_C_StartAngle;

// Function OBJ_DirControler.OBJ_DirControler_C.UpdateAngle
// 0x0014 (0x0014 - 0x0000)
struct OBJ_DirControler_C_UpdateAngle final
{
public:
	float                                         bpp__ReachAngle__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__TargetPosition__pf;                           // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsReach__pf;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_DirControler_C_UpdateAngle;

// Function OBJ_DirControler.OBJ_DirControler_C.UpdateHoming
// 0x0014 (0x0014 - 0x0000)
struct OBJ_DirControler_C_UpdateHoming final
{
public:
	float                                         bpp__ReachDistance__pf;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__TargetPosition__pf;                           // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsReach__pf;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_DirControler_C_UpdateHoming;

// Function OBJ_DirControler.OBJ_DirControler_C.UpdateHomingRate
// 0x0018 (0x0018 - 0x0000)
struct OBJ_DirControler_C_UpdateHomingRate final
{
public:
	float                                         bpp__ReachDistance__pf;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__TargetPosition__pf;                           // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Rate__pf;                                     // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsReach__pf;                                  // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_DirControler_C_UpdateHomingRate;

// Function OBJ_DirControler.OBJ_DirControler_C.UpdateIidaAngle
// 0x0014 (0x0014 - 0x0000)
struct OBJ_DirControler_C_UpdateIidaAngle final
{
public:
	struct FVector                                bpp__TargetPosition__pf;                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Conficient__pf;                               // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsReach__pf;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_DirControler_C_UpdateIidaAngle;

// Function OBJ_DirControler.OBJ_DirControler_C.UpdateIidaHoming
// 0x0020 (0x0020 - 0x0000)
struct OBJ_DirControler_C_UpdateIidaHoming final
{
public:
	float                                         bpp__ReachDistance__pf;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__TargetPosition__pf;                           // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Conficient__pf;                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MinSpeed__pf;                                 // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MaxSpeed__pf;                                 // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsReach__pf;                                  // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_DirControler_C_UpdateIidaHoming;

// Function OBJ_DirControler.OBJ_DirControler_C.UpdateSpeed
// 0x0004 (0x0004 - 0x0000)
struct OBJ_DirControler_C_UpdateSpeed final
{
public:
	float                                         bpp__Speed__pf;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_DirControler_C_UpdateSpeed;

}

