#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJEX_WarpEffectControler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Obj_Root_classes.hpp"
#include "EPB_WarpState_structs.hpp"


namespace SDK
{

// DynamicClass OBJEX_WarpEffectControler.OBJEX_WarpEffectControler_C
// 0x0080 (0x0120 - 0x00A0)
class UOBJEX_WarpEffectControler_C final : public UOBJ_Root_C
{
public:
	class FName                                   startBoneName;                                     // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WarpStartLocation;                                 // 0x00A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WarpStartChangeCounter;                            // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WarpCommonTime;                                    // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WarpStartSpreadTime;                               // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InnerState;                                        // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WarpWaitTime;                                      // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WarpStartFinishTime;                               // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WarpWaitFinishTime;                                // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WarpEndLocation;                                   // 0x00D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBParticle*                            effect;                                            // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WarpEffectScale;                                   // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            In_EffectScaleCurves;                              // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            Out_EffectScaleCurves;                             // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPlayerWarp;                                      // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WarpStartOffset;                                   // 0x0104(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_Event_ChrIns_OBJEX_WarpEffectControler_C;   // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBStepBase*                            K2Node_Event_StepIns_OBJEX_WarpEffectControler_C;  // 0x0118(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetIsPlayerWarp(bool bpp__IsWarp__pf, bool* bpp__return__pf);
	void SetWarpStartOffset(const struct FVector& bpp__WarpStartOffset__pf);
	void UpdateWarpEffect(class FName bpp__StartBoneName__pf, float bpp__SpreadTime__pf, float bpp__WaitTime__pf, float bpp__ShrinkTime__pf, float bpp__FinishWaitTime__pf, float bpp__WarpEffectScale__pf, bool bpp__IsWarpStay__pf, EPB_WarpState* bpp__State__pf);
	void UpdateWarpEffect_BRV(float bpp__StartToWarpTime__pf, float bpp__WarpToFinishTime__pf, EPB_WarpState* bpp__State__pf);
	void UpdateWarpEffectLocation(const struct FVector& bpp__StartWorldLocation__pf, const struct FVector& bpp__EndWorldLocation__pf, bool* bpp__return__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OBJEX_WarpEffectControler_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OBJEX_WarpEffectControler_C")
	}
	static class UOBJEX_WarpEffectControler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOBJEX_WarpEffectControler_C>();
	}
};
DUMPER7_ASSERTS_UOBJEX_WarpEffectControler_C;

}

