#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJEX_WarpEffectControler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EPB_WarpState_structs.hpp"


namespace SDK::Params
{

// Function OBJEX_WarpEffectControler.OBJEX_WarpEffectControler_C.SetIsPlayerWarp
// 0x0002 (0x0002 - 0x0000)
struct OBJEX_WarpEffectControler_C_SetIsPlayerWarp final
{
public:
	bool                                          bpp__IsWarp__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJEX_WarpEffectControler_C_SetIsPlayerWarp;

// Function OBJEX_WarpEffectControler.OBJEX_WarpEffectControler_C.SetWarpStartOffset
// 0x000C (0x000C - 0x0000)
struct OBJEX_WarpEffectControler_C_SetWarpStartOffset final
{
public:
	struct FVector                                bpp__WarpStartOffset__pf;                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJEX_WarpEffectControler_C_SetWarpStartOffset;

// Function OBJEX_WarpEffectControler.OBJEX_WarpEffectControler_C.UpdateWarpEffect
// 0x0020 (0x0020 - 0x0000)
struct OBJEX_WarpEffectControler_C_UpdateWarpEffect final
{
public:
	class FName                                   bpp__StartBoneName__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__SpreadTime__pf;                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__WaitTime__pf;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__ShrinkTime__pf;                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__FinishWaitTime__pf;                           // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__WarpEffectScale__pf;                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsWarpStay__pf;                               // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_WarpState                                 bpp__State__pf;                                    // 0x001D(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJEX_WarpEffectControler_C_UpdateWarpEffect;

// Function OBJEX_WarpEffectControler.OBJEX_WarpEffectControler_C.UpdateWarpEffect_BRV
// 0x000C (0x000C - 0x0000)
struct OBJEX_WarpEffectControler_C_UpdateWarpEffect_BRV final
{
public:
	float                                         bpp__StartToWarpTime__pf;                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__WarpToFinishTime__pf;                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_WarpState                                 bpp__State__pf;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJEX_WarpEffectControler_C_UpdateWarpEffect_BRV;

// Function OBJEX_WarpEffectControler.OBJEX_WarpEffectControler_C.UpdateWarpEffectLocation
// 0x001C (0x001C - 0x0000)
struct OBJEX_WarpEffectControler_C_UpdateWarpEffectLocation final
{
public:
	struct FVector                                bpp__StartWorldLocation__pf;                       // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__EndWorldLocation__pf;                         // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJEX_WarpEffectControler_C_UpdateWarpEffectLocation;

}

