#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJP_EquipManager

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "EPB_EquipSpecialEffectFloatValue_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PBST_EquipInfo_structs.hpp"


namespace SDK::Params
{

// Function OBJP_EquipManager.OBJP_EquipManager_C.ActiveAccessoryProcess
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipManager_C_ActiveAccessoryProcess final
{
public:
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_ActiveAccessoryProcess;

// Function OBJP_EquipManager.OBJP_EquipManager_C.ActiveBodyProcess
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipManager_C_ActiveBodyProcess final
{
public:
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_ActiveBodyProcess;

// Function OBJP_EquipManager.OBJP_EquipManager_C.ActiveHeadProcess
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipManager_C_ActiveHeadProcess final
{
public:
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_ActiveHeadProcess;

// Function OBJP_EquipManager.OBJP_EquipManager_C.ActiveMufflerProcess
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipManager_C_ActiveMufflerProcess final
{
public:
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_ActiveMufflerProcess;

// Function OBJP_EquipManager.OBJP_EquipManager_C.ActiveProcess
// 0x0014 (0x0014 - 0x0000)
struct OBJP_EquipManager_C_ActiveProcess final
{
public:
	ECarriedCatalog                               bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0004(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_ActiveProcess;

// Function OBJP_EquipManager.OBJP_EquipManager_C.ActiveWeaponProcess
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipManager_C_ActiveWeaponProcess final
{
public:
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_ActiveWeaponProcess;

// Function OBJP_EquipManager.OBJP_EquipManager_C.ConvertTypeCarrigeToEquip
// 0x0002 (0x0002 - 0x0000)
struct OBJP_EquipManager_C_ConvertTypeCarrigeToEquip final
{
public:
	ECarriedCatalog                               bpp__CarriedType__pf;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBEquipModelType                             bpp__EquipType__pf;                                // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_ConvertTypeCarrigeToEquip;

// Function OBJP_EquipManager.OBJP_EquipManager_C.DeactiveAccessoryProcess
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipManager_C_DeactiveAccessoryProcess final
{
public:
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_DeactiveAccessoryProcess;

// Function OBJP_EquipManager.OBJP_EquipManager_C.DeactiveBodyProcess
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipManager_C_DeactiveBodyProcess final
{
public:
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_DeactiveBodyProcess;

// Function OBJP_EquipManager.OBJP_EquipManager_C.DeactiveHeadProcess
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipManager_C_DeactiveHeadProcess final
{
public:
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_DeactiveHeadProcess;

// Function OBJP_EquipManager.OBJP_EquipManager_C.DeactiveMufflerProcess
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipManager_C_DeactiveMufflerProcess final
{
public:
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_DeactiveMufflerProcess;

// Function OBJP_EquipManager.OBJP_EquipManager_C.DeactiveProcess
// 0x0014 (0x0014 - 0x0000)
struct OBJP_EquipManager_C_DeactiveProcess final
{
public:
	ECarriedCatalog                               bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0004(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_DeactiveProcess;

// Function OBJP_EquipManager.OBJP_EquipManager_C.DeactiveWeaponProcess
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipManager_C_DeactiveWeaponProcess final
{
public:
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_DeactiveWeaponProcess;

// Function OBJP_EquipManager.OBJP_EquipManager_C.EquipCallBack
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipManager_C_EquipCallBack final
{
public:
	ECarriedCatalog                               bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsActive__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__ItemId__pf;                                   // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_EquipCallBack;

// Function OBJP_EquipManager.OBJP_EquipManager_C.GetCurrentEquipInfo
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipManager_C_GetCurrentEquipInfo final
{
public:
	ECarriedCatalog                               bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0004(0x000C)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_GetCurrentEquipInfo;

// Function OBJP_EquipManager.OBJP_EquipManager_C.GetCurrentEuqipInfo
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipManager_C_GetCurrentEuqipInfo final
{
public:
	ECarriedCatalog                               bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0004(0x000C)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_GetCurrentEuqipInfo;

// Function OBJP_EquipManager.OBJP_EquipManager_C.GetEquipFloatValue
// 0x0008 (0x0008 - 0x0000)
struct OBJP_EquipManager_C_GetEquipFloatValue final
{
public:
	EPB_EquipSpecialEffectFloatValue              bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__return__pf;                                   // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_GetEquipFloatValue;

// Function OBJP_EquipManager.OBJP_EquipManager_C.GetEquipItemID
// 0x000C (0x000C - 0x0000)
struct OBJP_EquipManager_C_GetEquipItemID final
{
public:
	ECarriedCatalog                               bpp__EquipType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsPrevEquip__pf;                              // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__ItemId__pf;                                   // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_GetEquipItemID;

// Function OBJP_EquipManager.OBJP_EquipManager_C.GetWeaponActor
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipManager_C_GetWeaponActor final
{
public:
	class AEQBP_Root_C*                           bpp__WeaponActor__pf;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 bpp__WeaponMesh__pf;                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_GetWeaponActor;

// Function OBJP_EquipManager.OBJP_EquipManager_C.IsEquip
// 0x0018 (0x0018 - 0x0000)
struct OBJP_EquipManager_C_IsEquip final
{
public:
	class APB_Chr_Root_C*                         bpp__ChrIns__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__EquipId__pf;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsEquip__pf;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_IsEquip;

// Function OBJP_EquipManager.OBJP_EquipManager_C.LoadSound
// 0x000C (0x000C - 0x0000)
struct OBJP_EquipManager_C_LoadSound final
{
public:
	class FName                                   bpp__ItemMasterID__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_LoadSound;

// Function OBJP_EquipManager.OBJP_EquipManager_C.MakeEquipInfo
// 0x0018 (0x0018 - 0x0000)
struct OBJP_EquipManager_C_MakeEquipInfo final
{
public:
	ECarriedCatalog                               bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__ID__pf;                                       // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x000C(0x000C)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_MakeEquipInfo;

// Function OBJP_EquipManager.OBJP_EquipManager_C.SetEquipFloatValue
// 0x000C (0x000C - 0x0000)
struct OBJP_EquipManager_C_SetEquipFloatValue final
{
public:
	EPB_EquipSpecialEffectFloatValue              bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__FloatValue__pf;                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__return__pf;                                   // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_SetEquipFloatValue;

// Function OBJP_EquipManager.OBJP_EquipManager_C.SetEquipInfo
// 0x0014 (0x0014 - 0x0000)
struct OBJP_EquipManager_C_SetEquipInfo final
{
public:
	ECarriedCatalog                               bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBST_EquipInfo                        bpp__EquipInfo__pf;                                // 0x0004(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_SetEquipInfo;

// Function OBJP_EquipManager.OBJP_EquipManager_C.SpawnBullet
// 0x0020 (0x0020 - 0x0000)
struct OBJP_EquipManager_C_SpawnBullet final
{
public:
	class FName                                   bpp__BulletID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SpawnWorldLocation__pf;                       // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBulletDirection                              bpp__SpawnDirectionType__pf;                       // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               bpp__SpawnerType__pf;                              // 0x0015(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsOverRoom__pf;                               // 0x0016(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSpawn__pf;                                  // 0x0017(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBulletActor*                         bpp__BulletInstance__pf;                           // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_SpawnBullet;

// Function OBJP_EquipManager.OBJP_EquipManager_C.SpawnBulletEx
// 0x0340 (0x0340 - 0x0000)
struct OBJP_EquipManager_C_SpawnBulletEx final
{
public:
	class FName                                   bpp__BulletID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBBulletParameter                     bpp__BulletParameter__pf;                          // 0x0008(0x01E0)(Parm, NativeAccessSpecifierPublic)
	struct FPBBallisticParameter                  bpp__BallisticParameter__pf;                       // 0x01E8(0x0140)(Parm, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SpawnWorldLocation__pf;                       // 0x0328(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBulletDirection                              bpp__SpawnDirectionType__pf;                       // 0x0334(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               bpp__SpawnerType__pf;                              // 0x0335(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsOverRoom__pf;                               // 0x0336(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSpawn__pf;                                  // 0x0337(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBulletActor*                         bpp__BulletInstance__pf;                           // 0x0338(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_SpawnBulletEx;

// Function OBJP_EquipManager.OBJP_EquipManager_C.SpawnEffect
// 0x0038 (0x0038 - 0x0000)
struct OBJP_EquipManager_C_SpawnEffect final
{
public:
	class FName                                   bpp__EffectID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SpawnWorldLocation__pf;                       // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Scale__pf;                                    // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__TimeDilation__pf;                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__RotationVector__pf;                           // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               bpp__SpawnerType__pf;                              // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Spawner__pf;                                  // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSpawn__pf;                                  // 0x002A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APBParticle*                            bpp__EffectInstance__pf;                           // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_SpawnEffect;

// Function OBJP_EquipManager.OBJP_EquipManager_C.UnloadSound
// 0x000C (0x000C - 0x0000)
struct OBJP_EquipManager_C_UnloadSound final
{
public:
	class FName                                   bpp__ItemMasterID__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_UnloadSound;

// Function OBJP_EquipManager.OBJP_EquipManager_C.WeaponDispCallBack
// 0x0002 (0x0002 - 0x0000)
struct OBJP_EquipManager_C_WeaponDispCallBack final
{
public:
	bool                                          bpp__IsDisp__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipManager_C_WeaponDispCallBack;

}

