#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJP_AimEffectControler

#include "Basic.hpp"

#include "Obj_Root_classes.hpp"
#include "PB_ST_AimEffectParameter_structs.hpp"


namespace SDK
{

// DynamicClass OBJP_AimEffectControler.OBJP_AimEffectControler_C
// 0x00A0 (0x0140 - 0x00A0)
class UOBJP_AimEffectControler_C final : public UOBJ_Root_C
{
public:
	struct FPB_ST_AimEffectParameter              AimEffectParameter;                                // 0x00A0(0x0024)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBParticle*                            AimEffect;                                         // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PrevIsRight;                                       // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PrevIsAiming;                                      // 0x00D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachSocket;                                      // 0x00D4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimEffectOffset;                                   // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsVisibleAimEffect;                                // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsVisibleAncorEffect;                              // 0x00E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AncorEffectOffset;                                 // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBParticle*                            AncorEffect;                                       // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AncorEffectScale;                                  // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       K2Node_Event_ChrIns_OBJP_AimEffectControler_C;     // 0x00F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBStepBase*                            K2Node_Event_StepIns_OBJP_AimEffectControler_C;    // 0x0100(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_OBJP_AimEffectControler_C; // 0x0108(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	TScriptInterface<class IIAccessablePlayerInfo_C> K2Node_DynamicCast_AsIAccessable_Player_Info;   // 0x0118(0x0010)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_PlayerCtr_SpawnEffect_IsSpawn;            // 0x0129(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APBParticle*                            CallFunc_PlayerCtr_SpawnEffect_EffectInstance;     // 0x0130(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*               CallFunc_PlayerCtr_SpawnEffect_ParticleSystemComponent; // 0x0138(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void DelayedInit();
	void GetAimOffsetLength(float* bpp__Length__pf);
	void GetAncorEffectWorldLocation(struct FVector* bpp__WorldLocation__pf);
	void SetAncorEffect();
	void SetEffectCondition(class FName bpp__ShardID__pf, bool* bpp__IsSpawn__pf, class APBParticle** bpp__EffectIns__pf);
	void UpdateAncorEffectLocation();
	void UpdateEffectLocation(class APBParticle* bpp__TargetEffect__pf, float bpp__OffsetLength__pf, bool* bpp__return__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OBJP_AimEffectControler_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OBJP_AimEffectControler_C")
	}
	static class UOBJP_AimEffectControler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOBJP_AimEffectControler_C>();
	}
};
DUMPER7_ASSERTS_UOBJP_AimEffectControler_C;

}

