#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJP_AimEffectControler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function OBJP_AimEffectControler.OBJP_AimEffectControler_C.GetAimOffsetLength
// 0x0004 (0x0004 - 0x0000)
struct OBJP_AimEffectControler_C_GetAimOffsetLength final
{
public:
	float                                         bpp__Length__pf;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_AimEffectControler_C_GetAimOffsetLength;

// Function OBJP_AimEffectControler.OBJP_AimEffectControler_C.GetAncorEffectWorldLocation
// 0x000C (0x000C - 0x0000)
struct OBJP_AimEffectControler_C_GetAncorEffectWorldLocation final
{
public:
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_AimEffectControler_C_GetAncorEffectWorldLocation;

// Function OBJP_AimEffectControler.OBJP_AimEffectControler_C.SetEffectCondition
// 0x0018 (0x0018 - 0x0000)
struct OBJP_AimEffectControler_C_SetEffectCondition final
{
public:
	class FName                                   bpp__ShardID__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSpawn__pf;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBParticle*                            bpp__EffectIns__pf;                                // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_AimEffectControler_C_SetEffectCondition;

// Function OBJP_AimEffectControler.OBJP_AimEffectControler_C.UpdateEffectLocation
// 0x0010 (0x0010 - 0x0000)
struct OBJP_AimEffectControler_C_UpdateEffectLocation final
{
public:
	class APBParticle*                            bpp__TargetEffect__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__OffsetLength__pf;                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_AimEffectControler_C_UpdateEffectLocation;

}

