#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJP_EquipBuffParameter

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.ConvertCarryToShardType
// 0x0002 (0x0002 - 0x0000)
struct OBJP_EquipBuffParameter_C_ConvertCarryToShardType final
{
public:
	ECarriedCatalog                               bpp__EquipType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EShardType                                    bpp__ShardType__pf;                                // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_ConvertCarryToShardType;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.GetEnchantTypeDefaultValue
// 0x0008 (0x0008 - 0x0000)
struct OBJP_EquipBuffParameter_C_GetEnchantTypeDefaultValue final
{
public:
	EPBEquipSpecialAttribute                      bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Value__pf;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_GetEnchantTypeDefaultValue;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.GetEnchantValue
// 0x000C (0x000C - 0x0000)
struct OBJP_EquipBuffParameter_C_GetEnchantValue final
{
public:
	EPBEquipSpecialAttribute                      bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Value__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__return__pf;                                   // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_GetEnchantValue;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.GetGradeAndRankValue
// 0x0014 (0x0014 - 0x0000)
struct OBJP_EquipBuffParameter_C_GetGradeAndRankValue final
{
public:
	class FName                                   bpp__ItemId__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               bpp__GetType__pf;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__GradeValue__pf;                               // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__RankValue__pf;                                // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_GetGradeAndRankValue;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.GetMasteryTypeFromShardID
// 0x000C (0x000C - 0x0000)
struct OBJP_EquipBuffParameter_C_GetMasteryTypeFromShardID final
{
public:
	class FName                                   bpp__ShardID__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBEquipSpecialAttribute                      bpp__MasteryType__pf;                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_GetMasteryTypeFromShardID;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.GetMasteryTypeFromWeaponID
// 0x000C (0x000C - 0x0000)
struct OBJP_EquipBuffParameter_C_GetMasteryTypeFromWeaponID final
{
public:
	class FName                                   bpp__WeaponID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBEquipSpecialAttribute                      bpp__MasteryType__pf;                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_GetMasteryTypeFromWeaponID;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.GetParameterIndex
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipBuffParameter_C_GetParameterIndex final
{
public:
	class FName                                   bpp__ShardName__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBEquipSpecialAttribute                      bpp__Type__pf;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__Index__pf;                                    // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_GetParameterIndex;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.GetParameterRankValue
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipBuffParameter_C_GetParameterRankValue final
{
public:
	class FName                                   bpp__ShardName__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFind__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__RankValue__pf;                                // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_GetParameterRankValue;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.GetRowFromItemID
// 0x0030 (0x0030 - 0x0000)
struct OBJP_EquipBuffParameter_C_GetRowFromItemID final
{
public:
	class FName                                   bpp__ItemId__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           bpp__EnchantMasterID__pf;                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EPBEquipSpecialAttribute>              bpp__Attributes__pf;                               // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFind__pf;                                   // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_GetRowFromItemID;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.GetSpecialAttributeValue
// 0x0008 (0x0008 - 0x0000)
struct OBJP_EquipBuffParameter_C_GetSpecialAttributeValue final
{
public:
	EPBEquipSpecialAttribute                      bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsRate__pf;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Value__pf;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_GetSpecialAttributeValue;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.GetSpecialAttribyteTypeFromShardID
// 0x000C (0x000C - 0x0000)
struct OBJP_EquipBuffParameter_C_GetSpecialAttribyteTypeFromShardID final
{
public:
	class FName                                   bpp__ShardID__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBEquipSpecialAttribute                      bpp__EquipType__pf;                                // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_GetSpecialAttribyteTypeFromShardID;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.GetWeaponTypeFromID
// 0x000C (0x000C - 0x0000)
struct OBJP_EquipBuffParameter_C_GetWeaponTypeFromID final
{
public:
	class FName                                   bpp__WeaponID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponType                                   bpp__WeaponType__pf;                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_GetWeaponTypeFromID;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.Inner_SetEnchantParameter
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipBuffParameter_C_Inner_SetEnchantParameter final
{
public:
	class FName                                   bpp__ParameterName__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__ParameterValue__pf;                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_Inner_SetEnchantParameter;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.IsMasteryShard
// 0x000C (0x000C - 0x0000)
struct OBJP_EquipBuffParameter_C_IsMasteryShard final
{
public:
	class FName                                   bpp__ShardID__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsMastery__pf;                                // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_IsMasteryShard;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.LaterSummaryProcess
// 0x0001 (0x0001 - 0x0000)
struct OBJP_EquipBuffParameter_C_LaterSummaryProcess final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_LaterSummaryProcess;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.SetEquipEnchantParameter
// 0x0004 (0x0004 - 0x0000)
struct OBJP_EquipBuffParameter_C_SetEquipEnchantParameter final
{
public:
	ECarriedCatalog                               bpp__EquipType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsUnEquip__pf;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFind__pf;                                   // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBEquipSpecialAttribute                      bpp__return__pf;                                   // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_SetEquipEnchantParameter;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.SetMasteryAttackRate
// 0x0018 (0x0018 - 0x0000)
struct OBJP_EquipBuffParameter_C_SetMasteryAttackRate final
{
public:
	bool                                          bpp__IsEquip__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__WeaponID__pf;                                 // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__ShardID__pf;                                  // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_SetMasteryAttackRate;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.SetMasteryAttackRateByEquip
// 0x0014 (0x0014 - 0x0000)
struct OBJP_EquipBuffParameter_C_SetMasteryAttackRateByEquip final
{
public:
	bool                                          bpp__IsEquip__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__WeaponID__pf;                                 // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__ShardID__pf;                                  // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_SetMasteryAttackRateByEquip;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.SetShardEnchantParameter
// 0x0014 (0x0014 - 0x0000)
struct OBJP_EquipBuffParameter_C_SetShardEnchantParameter final
{
public:
	class FName                                   bpp__ShardName__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsUnEquip__pf;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__Rank__pf;                                     // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBEquipSpecialAttribute                      bpp__AttribyteType__pf;                            // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_SetShardEnchantParameter;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.UpdateBadStatusAttackValue
// 0x0001 (0x0001 - 0x0000)
struct OBJP_EquipBuffParameter_C_UpdateBadStatusAttackValue final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_UpdateBadStatusAttackValue;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.UpdateDeepSinker
// 0x0001 (0x0001 - 0x0000)
struct OBJP_EquipBuffParameter_C_UpdateDeepSinker final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_UpdateDeepSinker;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.UpdateEnchantParameter
// 0x0010 (0x0010 - 0x0000)
struct OBJP_EquipBuffParameter_C_UpdateEnchantParameter final
{
public:
	EPBEquipSpecialAttribute                      bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsUnEquip__pf;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__ItemId__pf;                                   // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_UpdateEnchantParameter;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.UpdateEnchantParameterByItemID
// 0x0014 (0x0014 - 0x0000)
struct OBJP_EquipBuffParameter_C_UpdateEnchantParameterByItemID final
{
public:
	class FName                                   bpp__ItemId__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               bpp__EquipType__pf;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsUnEquip__pf;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__Rank__pf;                                     // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_UpdateEnchantParameterByItemID;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.UpdateEnemyKillAttackValue
// 0x0001 (0x0001 - 0x0000)
struct OBJP_EquipBuffParameter_C_UpdateEnemyKillAttackValue final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_UpdateEnemyKillAttackValue;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.UpdateMapTraverseAttackValue
// 0x0001 (0x0001 - 0x0000)
struct OBJP_EquipBuffParameter_C_UpdateMapTraverseAttackValue final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_UpdateMapTraverseAttackValue;

// Function OBJP_EquipBuffParameter.OBJP_EquipBuffParameter_C.UpdateMoneyAttackValue
// 0x0001 (0x0001 - 0x0000)
struct OBJP_EquipBuffParameter_C_UpdateMoneyAttackValue final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJP_EquipBuffParameter_C_UpdateMoneyAttackValue;

}

