#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJP_ShardManager

#include "Basic.hpp"

#include "Obj_Root_classes.hpp"
#include "PB_ST_ShardInfo_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "EPB_WaterStaus_structs.hpp"


namespace SDK
{

// DynamicClass OBJP_ShardManager.OBJP_ShardManager_C
// 0x00D8 (0x0178 - 0x00A0)
class UOBJP_ShardManager_C final : public UOBJ_Root_C
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class APB_Chr_Root_C*                         PlayerIns;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPB_ST_ShardInfo>               CurrentShardInfo;                                  // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FPB_ST_ShardInfo>               PrevShardInfo;                                     // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<bool>                                  SkillInfo;                                         // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FName>                           SkillIndex;                                        // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         ConsumeMPRate;                                     // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBParticle*                            AimEffectIns;                                      // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Reflectionary;                                     // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBulletActor*                         EffectiveBulletIns;                                // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class APBBulletSubActorBase*> SkillMap;                                        // 0x0118(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_Event_ChrIns_OBJP_ShardManager_C;           // 0x0168(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBStepBase*                            K2Node_Event_StepIns_OBJP_ShardManager_C;          // 0x0170(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void AddSkillBuffer(class FName bpp__ShardID__pf, bool* bpp__return__pf);
	void CheckEnchantAndSkill(EShardType bpp__ShardType__pf, class FName bpp__ShardID__pf, bool bpp__IsActive__pf, bool* bpp__IsShouldSpawn__pf);
	void DeleteShard(bool* bpp__Value__pf);
	void Directional_Activate();
	void Directional_Deactivate();
	void Effective_Activate();
	void Effective_Deactivate();
	void Enchant_Activate();
	void Enchant_Deactivate();
	void EquipInfo_AttackTiming(bool bpp__IsStart__pf, bool bpp__IsFinish__pf, bool* bpp__return__pf);
	void EquipInfo_ChangeWeaponTiming(bool* bpp__return__pf);
	void EquipInfo_DealDamageEvent(class FName bpp__DamageID__pf, bool bpp__IsHit__pf, EPBBloodColor bpp__BloodColor__pf, float bpp__DamageValue__pf, class APBBaseCharacter* bpp__ChrIns__pf, const struct FVector& bpp__HitWorldLocation__pf, bool bpp__IsCritical__pf, bool bpp__IsBullet__pf, class FName bpp__DealDamageBone__pf, EAttackAttribute bpp__EffectiveAttribute__pf, class UPBCollisionObject* bpp__AttackCollision__pf, bool* bpp__return__pf);
	void EquipInfo_EnterAttackProcess(EPBStep bpp__Step__pf, bool* bpp__return__pf);
	void EquipInfo_ExecCommand(class FName bpp__Command__pf, float bpp__FloatValue__pf, bool* bpp__return__pf);
	void EquipInfo_ExitAttackProcess(EPBStep bpp__Step__pf, bool* bpp__return__pf);
	void EquipInfo_SetVectorParameter(class FName bpp__Command__pf, const struct FVector& bpp__Value__pf, bool* bpp__return__pf);
	void EquipInfo_SpawnBullet(class FName bpp__BulletID__pf, class FName bpp__SocketName__pf, EBulletDirection bpp__BulletDirection__pf, ECarriedCatalog bpp__SpawnType__pf, bool* bpp__return__pf);
	void EquipInfo_WaterProcess(EPB_WaterStaus bpp__Type__pf, bool* bpp__return__pf);
	void EquipInfo_WeaponDisp(bool bpp__IsDisp__pf, bool* bpp__return__pf);
	void EquipShard(EShardType bpp__ShardType__pf, struct FPB_ST_ShardInfo* bpp__ShardInfo__pf);
	void Familiar_Activate();
	void Familiar_Deactivate();
	void GetCharacterShardInfo(class ACharacter* bpp__character__pf, EShardType bpp__ShardType__pf, bool bpp__IsEquip__pf, struct FPB_ST_ShardInfo* bpp__PB_ST_ShardInfo__pf, bool* bpp__FoundValidInfo__pf);
	void GetCurrentShardInfo(EShardType bpp__Type__pf, struct FPB_ST_ShardInfo* bpp__Info__pf);
	void GetShardData(class FName bpp__ShardID__pf, struct FPBShardMasterData* bpp__ShardData__pf, bool* bpp__FoundData__pf);
	void GetShardInfo(EShardType bpp__Type__pf, bool bpp__IsCurrent__pf, struct FPB_ST_ShardInfo* bpp__Info__pf);
	void GetSkillBullet(class FName bpp__SkillID__pf, bool* bpp__IsFind__pf, class APBBulletSubActorBase** bpp__BulletInstance__pf);
	void GetSkillIndex(class FName bpp__SkillName__pf, int32* bpp__Index__pf);
	void GetSkillShardInfo(class FName bpp__SkillName__pf, struct FPB_ST_ShardInfo* bpp__ShardInfo__pf);
	void HasSkill(class FName bpp__SkillName__pf, bool* bpp__HasSkill__pf);
	void Inner_RemoveSkillBulletActor(class FName bpp__ShardID__pf, bool* bpp__return__pf);
	void IsEquipShard(EShardType bpp__ShardType__pf, class FName bpp__ShardID__pf, bool* bpp__IsEquip__pf);
	void IsMasteryShard(class FName bpp__ShardID__pf, bool* bpp__return__pf);
	void RestartShard(bool* bpp__IsExecute__pf);
	void SetCurrentShardInfo(struct FPB_ST_ShardChangeInfo* bpp__ChangeInfo__pf, bool bpp__IsCurrent__pf, struct FPB_ST_ShardInfo* bpp__Info__pf);
	void SetShardInfo(EShardType bpp__Type__pf, bool bpp__IsCurrent__pf, const struct FPB_ST_ShardInfo& bpp__Info__pf);
	void Shard_IsTriggerShardNotDisable(bool* bpp__return__pf);
	void Skill_Activate();
	void Skill_Deactivate();
	void SpawnEnchantSkillInstance(EShardType bpp__ShardType__pf, class FName bpp__ShardID__pf, class APBBulletActor** bpp__BulletInstance__pf);
	void Spawner_Effect(class FName bpp__EffectID__pf, const struct FVector& bpp__WorldLocation__pf, float bpp__Scale__pf, float bpp__TimeDilation__pf, const struct FVector& bpp__RotationWorldVector__pf, bool* bpp__IsSpawn__pf, class APBParticle** bpp__EffectInstance__pf);
	void Spawner_Initialize(class APB_Chr_Root_C* bpp__ChrRootInstance__pf, bool* bpp__return__pf);
	void Spawner_SpawnBullet(class FName bpp__BulletID__pf, const struct FVector& bpp__SpawnWorldLocation__pf, EBulletDirection bpp__DirectionType__pf, bool bpp__IsOverRoom__pf, bool* bpp__IsSpawn__pf, class APBBulletActor** bpp__BulletInstance__pf);
	void Spawner_SpawnBulletEx(class FName bpp__BulletID__pf, const struct FPBBulletParameter& bpp__BulletParameter__pf, const struct FPBBallisticParameter& bpp__BallisticParameter__pf, const struct FVector& bpp__SpawnWorldLocation__pf, EBulletDirection bpp__DirectionType__pf, bool bpp__IsOverRoom__pf, bool* bpp__IsSpawn__pf, class APBBulletActor** bpp__BulletInstance__pf);
	void Trigger_Activate();
	void Trigger_Deactivate();
	void UnequipShard(EShardType bpp__ShardType__pf, struct FPB_ST_ShardInfo* bpp__ShardInfo__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OBJP_ShardManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OBJP_ShardManager_C")
	}
	static class UOBJP_ShardManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOBJP_ShardManager_C>();
	}
};
DUMPER7_ASSERTS_UOBJP_ShardManager_C;

}

