#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OCCharacterBP

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "PopupParam_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// DynamicClass OCCharacterBP.OCCharacterBP_C
// 0x0360 (0x36A0 - 0x3340)
class AOCCharacterBP_C : public AOCCharacter
{
public:
	class UTextRenderComponent*                   TextRender;                                        // 0x3338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<bool>                                  WildCardBools;                                     // 0x3340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<bool>                                  ChangedWildCards;                                  // 0x3350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<int32>                                 UpdatedIndexes;                                    // 0x3360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          Init;                                              // 0x3370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3371[0x7];                                     // 0x3371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBItemCatalogData                     ItemCatalog;                                       // 0x3378(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget_ChaosQuestUpdate_C*             QuestUpdateWidget;                                 // 0x33F0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBUserWidgetPauseMenu*                 SpawnedWidget;                                     // 0x33F8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBUserWidget*                          StatusPopup;                                       // 0x3400(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x3408(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               Category;                                          // 0x3410(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3411[0x3];                                     // 0x3411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ID2;                                               // 0x3414(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasReplicatedWildCardThisFrame;                    // 0x341C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_341D[0x3];                                     // 0x341D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomStream                          RandomStream;                                      // 0x3420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         RandomSeed;                                        // 0x3428(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_342C[0x4];                                     // 0x342C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  WildCardsThisFrame;                                // 0x3430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<int32>                                 WildCardsDelayReset;                               // 0x3440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         WildCardDelayFrameValue;                           // 0x3450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChaosInventoryItem                    CallFunc_GetCurrentEquipmentByCategory_Item;       // 0x3454(0x000C)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	class FText                                   K2Node_CustomEvent_Message1;                       // 0x3460(0x0018)(Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	struct FPopupParam                            K2Node_MakeStruct_PopupParam;                      // 0x3478(0x0040)(Transient, DuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   K2Node_CustomEvent_Id1;                            // 0x34B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               K2Node_CustomEvent_Category2;                      // 0x34C0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34C1[0x3];                                     // 0x34C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_IdP2;                           // 0x34C4(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34CC[0x4];                                     // 0x34CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBUserWidget*                          CallFunc_Create_ReturnValue;                       // 0x34D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CallFunc_GetItemDisplayName_ItemName;              // 0x34D8(0x0010)(ZeroConstructor, Transient, DuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x34E8(0x0040)(Transient, DuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   K2Node_CustomEvent_Id;                             // 0x3528(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               K2Node_CustomEvent_Category1;                      // 0x3530(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3531[0x7];                                     // 0x3531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBUserWidgetPauseMenu*                 CallFunc_Create_ReturnValue1;                      // 0x3538(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABP_ChaosPlayerController_C*            K2Node_DynamicCast_AsBP_Chaos_Player_Controller;   // 0x3540(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x3548(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3549[0x7];                                     // 0x3549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetItemDisplayName_ItemName1;             // 0x3550(0x0010)(ZeroConstructor, Transient, DuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x3560(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3564[0x4];                                     // 0x3564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x3568(0x0040)(Transient, DuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x35A8(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	TArray<bool>                                  K2Node_CustomEvent_BoolArray;                      // 0x35B8(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	TArray<int32>                                 K2Node_CustomEvent_UpdatedIndex;                   // 0x35C8(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class UPBAnimInstance*                        K2Node_DynamicCast_AsPBAnim_Instance;              // 0x35D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x35E0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35E1[0x3];                                     // 0x35E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x35E4(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x35E8(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	class UPBAnimInstance*                        K2Node_DynamicCast_AsPBAnim_Instance1;             // 0x35F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x3600(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStepEntry                                    K2Node_Event_wildCard;                             // 0x3601(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_Event_flag;                                 // 0x3602(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3603[0x5];                                     // 0x3603(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBAnimInstance*                        K2Node_DynamicCast_AsPBAnim_Instance2;             // 0x3608(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x3610(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3611[0x3];                                     // 0x3611(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x3614(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_Array_Get_Item;                           // 0x3618(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3619[0x3];                                     // 0x3619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item1;                          // 0x361C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_WarpAfterUISelection_DoWarp;              // 0x3620(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3621[0x3];                                     // 0x3621(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x3624(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	ECarriedCatalog                               K2Node_CustomEvent_category;                       // 0x3634(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3635[0x3];                                     // 0x3635(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_itemId;                         // 0x3638(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBP_ChaosModeLogic_C*                   K2Node_DynamicCast_AsBP_Chaos_Mode_Logic;          // 0x3640(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x3648(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3649[0x7];                                     // 0x3649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ChaosModeLogic_C*                   K2Node_DynamicCast_AsBP_Chaos_Mode_Logic1;         // 0x3650(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x3658(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3659[0x7];                                     // 0x3659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Message;                        // 0x3660(0x0018)(Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class FText                                   Temp_text_Variable;                                // 0x3678(0x0018)(Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class UUserWidget*                            CallFunc_Create_ReturnValue4;                      // 0x3690(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallFunc_BreakRandomStream_InitialSeed;            // 0x3698(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_369C[0x4];                                     // 0x369C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Client_ShowReward(class FName bpp__ID__pf, ECarriedCatalog bpp__Category__pf);
	void EnableChaosItemSwaps();
	void ExecuteUbergraph_OCCharacterBP_2(int32 bpp__EntryPoint__pf);
	void ForceLocalWildCard(EStepEntry bpp__EntryType__pf, bool bpp__Flag__pf);
	void GetCurrentEquipmentByCategory(ECarriedCatalog bpp__Category__pf, struct FChaosInventoryItem* bpp__Item__pf);
	void GetItemDisplayName(class FName bpp__ItemId__pf, class FString* bpp__ItemName__pf);
	void MultiCast_ConfirmChaosWidgetComplete();
	void OnRep_RandomSeed();
	void OnSetWildCard(EStepEntry bpp__WildCard__pf, bool bpp__Flag__pf);
	void ReceiveBeginPlay();
	void ReceiveTick(float bpp__DeltaSeconds__pf);
	void ReplicateWildCards();
	void SELECT_NO();
	void SELECT_YES();
	void SendBoolArrays(const TArray<bool>& bpp__BoolArray__pf__const, const TArray<int32>& bpp__UpdatedIndex__pf__const);
	void Server_ConfirmChaosWidgetComplete();
	void ServerEquip(ECarriedCatalog bpp__Category__pf, const class FName& bpp__itemId__pf__const);
	void ServerSpawnItem();
	void SetWildCardBool(int32 bpp__WildCard__pf, bool bpp__Flag__pf);
	void ShowChaosNotificationUI(const class FText& bpp__Message__pf__const);
	void ShowChaosUI(const class FText& bpp__Message__pf__const);
	void ShowRewardUI(class FName bpp__ID__pf, ECarriedCatalog bpp__Category__pf, class FName bpp__IdP2__pf);
	void SpawnSwapInfoWidget(bool bpp__FollowPlayer__pf, class UPBUserWidgetPauseMenu** bpp__SwapInfo__pf);
	void TryInitializeWildCards();
	void UpdateDelayedWildCards();
	void WarpAfterUISelection(bool* bpp__DoWarp__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OCCharacterBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OCCharacterBP_C")
	}
	static class AOCCharacterBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOCCharacterBP_C>();
	}
};
DUMPER7_ASSERTS_AOCCharacterBP_C;

}

