#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OCPCBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function OCPCBP.OCPCBP_C.CanShowLoadScreen
// 0x0001 (0x0001 - 0x0000)
struct OCPCBP_C_CanShowLoadScreen final
{
public:
	bool                                          bpp__CanShow__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OCPCBP_C_CanShowLoadScreen;

// Function OCPCBP.OCPCBP_C.CLIENT_OpenChest
// 0x0010 (0x0010 - 0x0000)
struct OCPCBP_C_CLIENT_OpenChest final
{
public:
	class APBBronzeTreasureBox_BP_C*              bpp__ChestBaseClassInstance__pf;                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       bpp__character__pf;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OCPCBP_C_CLIENT_OpenChest;

// Function OCPCBP.OCPCBP_C.ExecuteUbergraph_OCPCBP_1
// 0x0004 (0x0004 - 0x0000)
struct OCPCBP_C_ExecuteUbergraph_OCPCBP_1 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OCPCBP_C_ExecuteUbergraph_OCPCBP_1;

// Function OCPCBP.OCPCBP_C.ExecuteUbergraph_OCPCBP_7
// 0x0004 (0x0004 - 0x0000)
struct OCPCBP_C_ExecuteUbergraph_OCPCBP_7 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OCPCBP_C_ExecuteUbergraph_OCPCBP_7;

// Function OCPCBP.OCPCBP_C.GetCurrentLoadState
// 0x0020 (0x0020 - 0x0000)
struct OCPCBP_C_GetCurrentLoadState final
{
public:
	bool                                          bpp__IsComplete__pf;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   bpp__LoadScreenText__pf;                           // 0x0008(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OCPCBP_C_GetCurrentLoadState;

// Function OCPCBP.OCPCBP_C.GetDetailedLoadState
// 0x0038 (0x0038 - 0x0000)
struct OCPCBP_C_GetDetailedLoadState final
{
public:
	bool                                          bpp__IsComplete__pf;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   bpp__LocalisedState__pf;                           // 0x0008(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FText                                   bpp__DetailedStateForDebug__pf;                    // 0x0020(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OCPCBP_C_GetDetailedLoadState;

// Function OCPCBP.OCPCBP_C.Multicast_UpdateGameInstance
// 0x0008 (0x0008 - 0x0000)
struct OCPCBP_C_Multicast_UpdateGameInstance final
{
public:
	bool                                          bpp__Ready__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__Index__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OCPCBP_C_Multicast_UpdateGameInstance;

// Function OCPCBP.OCPCBP_C.OnPreClientTravel
// 0x0010 (0x0010 - 0x0000)
struct OCPCBP_C_OnPreClientTravel final
{
public:
	class FString                                 bpp__PendingURL__pf__const;                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OCPCBP_C_OnPreClientTravel;

// Function OCPCBP.OCPCBP_C.OWNER_InitForNewLevel
// 0x0001 (0x0001 - 0x0000)
struct OCPCBP_C_OWNER_InitForNewLevel final
{
public:
	EPBGameModeType                               bpp__Mode__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OCPCBP_C_OWNER_InitForNewLevel;

// Function OCPCBP.OCPCBP_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct OCPCBP_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                bpp__EndPlayReason__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OCPCBP_C_ReceiveEndPlay;

// Function OCPCBP.OCPCBP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct OCPCBP_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OCPCBP_C_ReceiveTick;

// Function OCPCBP.OCPCBP_C.SERVER_OpenChest
// 0x0010 (0x0010 - 0x0000)
struct OCPCBP_C_SERVER_OpenChest final
{
public:
	class APBBronzeTreasureBox_BP_C*              bpp__ChestBaseClassInstance__pf;                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       bpp__character__pf;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OCPCBP_C_SERVER_OpenChest;

// Function OCPCBP.OCPCBP_C.SERVER_SetClientPing
// 0x0004 (0x0004 - 0x0000)
struct OCPCBP_C_SERVER_SetClientPing final
{
public:
	int32                                         bpp__ClientPing__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OCPCBP_C_SERVER_SetClientPing;

}

