#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PB_Chr_Root

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PB_Enum_CommonBoolBufferEntry_structs.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function PB_Chr_Root.PB_Chr_Root_C.AddSkeletalMeshComponent
// 0x0020 (0x0020 - 0x0000)
struct PB_Chr_Root_C_AddSkeletalMeshComponent final
{
public:
	class USkeletalMesh*                          bpp__SkeletalMesh__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        bpp__ParentComponent__pf;                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 bpp__AnimInstance__pf;                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 bpp__SkeletalMeshComponent__pf;                    // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_AddSkeletalMeshComponent;

// Function PB_Chr_Root.PB_Chr_Root_C.CreateDynamicMaterialInstance
// 0x0008 (0x0008 - 0x0000)
struct PB_Chr_Root_C_CreateDynamicMaterialInstance final
{
public:
	class UMeshComponent*                         bpp__Mesh__pf;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_CreateDynamicMaterialInstance;

// Function PB_Chr_Root.PB_Chr_Root_C.DestroySkeletalMeshComponent
// 0x0010 (0x0010 - 0x0000)
struct PB_Chr_Root_C_DestroySkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 bpp__SkeletalMeshComponent__pf;                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PB_Chr_Root_C_DestroySkeletalMeshComponent;

// Function PB_Chr_Root.PB_Chr_Root_C.Event_CallVetorEvent
// 0x0020 (0x0020 - 0x0000)
struct PB_Chr_Root_C_Event_CallVetorEvent final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        bpp__VectorInfo__pf;                               // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Event_CallVetorEvent;

// Function PB_Chr_Root.PB_Chr_Root_C.ExecCameraShake
// 0x001C (0x001C - 0x0000)
struct PB_Chr_Root_C_ExecCameraShake final
{
public:
	float                                         bpp__Duration__pf;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__PitchAmp__pf;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__PitchFreq__pf;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__YawAmp__pf;                                   // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__YawFreq__pf;                                  // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__RollAmp__pf;                                  // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__RollFreq__pf;                                 // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_ExecCameraShake;

// Function PB_Chr_Root.PB_Chr_Root_C.ExecSystemRotation
// 0x0004 (0x0004 - 0x0000)
struct PB_Chr_Root_C_ExecSystemRotation final
{
public:
	float                                         bpp__RotationValue__pf;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_ExecSystemRotation;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_AIMoveDirection
// 0x0004 (0x0004 - 0x0000)
struct PB_Chr_Root_C_Get_AIMoveDirection final
{
public:
	float                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_AIMoveDirection;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_AttackNo
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_AttackNo final
{
public:
	EAttackEntry                                  bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_AttackNo;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_CharacterStance
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_CharacterStance final
{
public:
	ECharacterStance                              bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_CharacterStance;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_DamageType
// 0x0004 (0x0004 - 0x0000)
struct PB_Chr_Root_C_Get_DamageType final
{
public:
	int32                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_DamageType;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_DecalCount
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_DecalCount final
{
public:
	EDistanceType                                 bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_DecalCount;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_DistanceType
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_DistanceType final
{
public:
	EDistanceType                                 bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_DistanceType;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_Float
// 0x0008 (0x0008 - 0x0000)
struct PB_Chr_Root_C_Get_Float final
{
public:
	EMoFloatArray                                 bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Value__pf;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_Float;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_Int
// 0x0008 (0x0008 - 0x0000)
struct PB_Chr_Root_C_Get_Int final
{
public:
	EMoIntArray                                   bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__Value__pf;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_Int;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsAIBattle
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsAIBattle final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsAIBattle;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsAIDash
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsAIDash final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsAIDash;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsAim
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsAim final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsAim;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsAmblleraAttacking
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsAmblleraAttacking final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsAmblleraAttacking;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsAmblleraFlying
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsAmblleraFlying final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsAmblleraFlying;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsCannotJump
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsCannotJump final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsCannotJump;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsClimbing
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsClimbing final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsClimbing;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsCrouchStart
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsCrouchStart final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsCrouchStart;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsDamageBack
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsDamageBack final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsDamageBack;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsDash
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsDash final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsDash;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsDirectional
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsDirectional final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsDirectional;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsDirectionalSharding
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsDirectionalSharding final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsDirectionalSharding;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsEnemyDash
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsEnemyDash final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsEnemyDash;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsFallStart
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsFallStart final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsFallStart;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsFloating
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsFloating final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsFloating;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsIdleStart
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsIdleStart final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsIdleStart;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsInputMovePower
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsInputMovePower final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsInputMovePower;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsJumpDirect
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsJumpDirect final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsJumpDirect;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsJumping
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsJumping final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsJumping;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsJumpTwo
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsJumpTwo final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsJumpTwo;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsLongAttack
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsLongAttack final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsLongAttack;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsLoopContinue
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsLoopContinue final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsLoopContinue;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsMirroring
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsMirroring final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsMirroring;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsMirroringLap
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsMirroringLap final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsMirroringLap;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsMirroringReverse
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsMirroringReverse final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsMirroringReverse;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsPermitAim
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsPermitAim final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsPermitAim;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsRStickFixing
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsRStickFixing final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsRStickFixing;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsSlant
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsSlant final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsSlant;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsSystemMoving
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsSystemMoving final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsSystemMoving;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsTurn
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsTurn final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsTurn;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_IsUmblleraing
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_IsUmblleraing final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_IsUmblleraing;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_JumpDistance
// 0x0004 (0x0004 - 0x0000)
struct PB_Chr_Root_C_Get_JumpDistance final
{
public:
	float                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_JumpDistance;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_LandingType
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_LandingType final
{
public:
	ELandingType                                  bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_LandingType;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_MFlag
// 0x0002 (0x0002 - 0x0000)
struct PB_Chr_Root_C_Get_MFlag final
{
public:
	EMoBoolArray                                  bpp__Index__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_MFlag;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_RandomBool
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_RandomBool final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_RandomBool;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_RStickAngle
// 0x0004 (0x0004 - 0x0000)
struct PB_Chr_Root_C_Get_RStickAngle final
{
public:
	float                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_RStickAngle;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_RSTickAngleBuffer
// 0x0004 (0x0004 - 0x0000)
struct PB_Chr_Root_C_Get_RSTickAngleBuffer final
{
public:
	float                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_RSTickAngleBuffer;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_StateCondition
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_StateCondition final
{
public:
	EStateCondition                               bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_StateCondition;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_TargetDistance
// 0x0004 (0x0004 - 0x0000)
struct PB_Chr_Root_C_Get_TargetDistance final
{
public:
	float                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_TargetDistance;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_Template
// 0x0002 (0x0002 - 0x0000)
struct PB_Chr_Root_C_Get_Template final
{
public:
	bool                                          bpp__Index__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_Template;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_WeaponType
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_WeaponType final
{
public:
	EWeaponType                                   bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_WeaponType;

// Function PB_Chr_Root.PB_Chr_Root_C.Get_WpnSPEntry
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Get_WpnSPEntry final
{
public:
	EWpnSPEntry                                   bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Get_WpnSPEntry;

// Function PB_Chr_Root.PB_Chr_Root_C.GetLStickInput
// 0x0008 (0x0008 - 0x0000)
struct PB_Chr_Root_C_GetLStickInput final
{
public:
	float                                         bpp__Power__pf;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Dir__pf;                                      // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_GetLStickInput;

// Function PB_Chr_Root.PB_Chr_Root_C.GetWpnSPID
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_GetWpnSPID final
{
public:
	EWpnSPEntry                                   bpp__NewParam__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_GetWpnSPID;

// Function PB_Chr_Root.PB_Chr_Root_C.IKFootTrace
// 0x0010 (0x0010 - 0x0000)
struct PB_Chr_Root_C_IKFootTrace final
{
public:
	float                                         bpp__TraceDistance__pf;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Socket__pf;                                   // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__IKOffset__pf;                                 // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_IKFootTrace;

// Function PB_Chr_Root.PB_Chr_Root_C.OnReceiveEvent
// 0x0020 (0x0020 - 0x0000)
struct PB_Chr_Root_C_OnReceiveEvent final
{
public:
	class APBEventListenerManager*                bpp__eventManager__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__eventKey__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__eventSubKey__pf;                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__eventSender__pf;                              // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_OnReceiveEvent;

// Function PB_Chr_Root.PB_Chr_Root_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                bpp__EndPlayReason__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_ReceiveEndPlay;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_AmblleraCount
// 0x0004 (0x0004 - 0x0000)
struct PB_Chr_Root_C_Set_AmblleraCount final
{
public:
	int32                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_AmblleraCount;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_BloodSteel
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_BloodSteel final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_BloodSteel;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_CharacterStance
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_CharacterStance final
{
public:
	ECharacterStance                              bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_CharacterStance;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_DecalCount
// 0x0004 (0x0004 - 0x0000)
struct PB_Chr_Root_C_Set_DecalCount final
{
public:
	int32                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_DecalCount;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_FaceAngle
// 0x000C (0x000C - 0x0000)
struct PB_Chr_Root_C_Set_FaceAngle final
{
public:
	float                                         bpp__Add__pf;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__DeltaTime__pf;                                // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Value__pf;                                    // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_FaceAngle;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_Float
// 0x0008 (0x0008 - 0x0000)
struct PB_Chr_Root_C_Set_Float final
{
public:
	EMoFloatArray                                 bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Value__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_Float;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsAim
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsAim final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsAim;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsAmblleraAttacking
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsAmblleraAttacking final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsAmblleraAttacking;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsBool
// 0x0002 (0x0002 - 0x0000)
struct PB_Chr_Root_C_Set_IsBool final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoBoolArray                                  bpp__Kind__pf;                                     // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsBool;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsCannotJump
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsCannotJump final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsCannotJump;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsCannotMirroring
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsCannotMirroring final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsCannotMirroring;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsCannotTurn
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsCannotTurn final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsCannotTurn;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsDirectionalSharding
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsDirectionalSharding final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsDirectionalSharding;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsEnableAngularVelocity
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsEnableAngularVelocity final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsEnableAngularVelocity;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsImpossibleFall
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsImpossibleFall final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsImpossibleFall;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsJumpDouble
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsJumpDouble final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsJumpDouble;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsLoopContinue
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsLoopContinue final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsLoopContinue;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsMirroringReverse
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsMirroringReverse final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsMirroringReverse;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsNotDamageReaction
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsNotDamageReaction final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsNotDamageReaction;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsNotFinishDirectional
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsNotFinishDirectional final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsNotFinishDirectional;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsNotLanding
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsNotLanding final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsNotLanding;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsNotTransToJumpStart
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsNotTransToJumpStart final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsNotTransToJumpStart;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsRStickFixing
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsRStickFixing final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsRStickFixing;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsSitting
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsSitting final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsSitting;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsSyncOnLanding
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsSyncOnLanding final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsSyncOnLanding;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_IsUmblleraing
// 0x0001 (0x0001 - 0x0000)
struct PB_Chr_Root_C_Set_IsUmblleraing final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_IsUmblleraing;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_RStickAngleBuffer
// 0x0004 (0x0004 - 0x0000)
struct PB_Chr_Root_C_Set_RStickAngleBuffer final
{
public:
	float                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_RStickAngleBuffer;

// Function PB_Chr_Root.PB_Chr_Root_C.Set_Template
// 0x0002 (0x0002 - 0x0000)
struct PB_Chr_Root_C_Set_Template final
{
public:
	EPB_Enum_CommonBoolBufferEntry                bpp__Index__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_Set_Template;

// Function PB_Chr_Root.PB_Chr_Root_C.SetMIDControler
// 0x0010 (0x0010 - 0x0000)
struct PB_Chr_Root_C_SetMIDControler final
{
public:
	TArray<class UMaterialInstanceDynamic*>       bpp__MaterialList__pf;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_SetMIDControler;

// Function PB_Chr_Root.PB_Chr_Root_C.SetSystemRotationActivate
// 0x0008 (0x0008 - 0x0000)
struct PB_Chr_Root_C_SetSystemRotationActivate final
{
public:
	bool                                          bpp__IsActivate__pf;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__RotationValue__pf;                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PB_Chr_Root_C_SetSystemRotationActivate;

// Function PB_Chr_Root.PB_Chr_Root_C.SpawnActor
// 0x0050 (0x0050 - 0x0000)
struct PB_Chr_Root_C_SpawnActor final
{
public:
	class UClass*                                 bpp__ActorClass__pf;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             bpp__SpawnWorldTransform__pf;                      // 0x0010(0x0030)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class AActor*                                 bpp__Actor__pf;                                    // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PB_Chr_Root_C_SpawnActor;

}

