#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PB_ST_ShardChangeInfo

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK
{

// ScriptStruct PB_ST_ShardChangeInfo.PB_ST_ShardChangeInfo
// 0x002C (0x002C - 0x0000)
struct FPB_ST_ShardChangeInfo final
{
public:
	bool                                          IsChangeRequest_10_F54ED247499D5DEA824E808A418F3242; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EShardType                                    ShardType_11_1EEA12764580F48BCC39E2AB0073242F;     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ShardID_12_DA233D564A527C84F5B0D1B1B45F9C5D;       // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Grade_14_FDC59AFD4F16244BA3053593E67E6114;         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GradeValue_17_419B32D34B8E3822C83AC3AEFA1FD7DA;    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rank_27_EE126C824C5ABADF084DA29FCEBFCCFF;          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RankValue_28_8DEA61AE45EDF848B4E6FBBA51E7706A;     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Status_29_4F1F929B40DC9BCF078DFDADBC98D56A;        // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEnchantShardAttribute                        EnchantStatusType_31_3BC9CF184F3898CD44EA0D9B1FB9358E; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PrevShardType_33_69A9D98C428C02ADCDFAE2A2E83E99A7; // 0x0024(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPB_ST_ShardChangeInfo;

}

