#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBBP_MagicCircle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EPB_MagicCircleType_structs.hpp"


namespace SDK::Params
{

// Function PBBP_MagicCircle.PBBP_MagicCircle_C.EndMagicCircle
// 0x0008 (0x0008 - 0x0000)
struct PBBP_MagicCircle_C_EndMagicCircle final
{
public:
	float                                         bpp__EndTime__pf;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PBBP_MagicCircle_C_EndMagicCircle;

// Function PBBP_MagicCircle.PBBP_MagicCircle_C.EndMagicCircleDuration
// 0x0004 (0x0004 - 0x0000)
struct PBBP_MagicCircle_C_EndMagicCircleDuration final
{
public:
	float                                         bpp__Duration__pf;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBBP_MagicCircle_C_EndMagicCircleDuration;

// Function PBBP_MagicCircle.PBBP_MagicCircle_C.GetMagicCircleName
// 0x0018 (0x0018 - 0x0000)
struct PBBP_MagicCircle_C_GetMagicCircleName final
{
public:
	EPB_MagicCircleType                           bpp__MagicCircleType__pf;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsEnoch__pf;                                  // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsHigher__pf;                                 // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDepth__pf;                                  // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 bpp__EffectID__pf;                                 // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBBP_MagicCircle_C_GetMagicCircleName;

// Function PBBP_MagicCircle.PBBP_MagicCircle_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PBBP_MagicCircle_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBBP_MagicCircle_C_ReceiveTick;

// Function PBBP_MagicCircle.PBBP_MagicCircle_C.SetMagicCircleInfo
// 0x0060 (0x0060 - 0x0000)
struct PBBP_MagicCircle_C_SetMagicCircleInfo final
{
public:
	EPB_MagicCircleType                           bpp__MagicCircleType__pf;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsHigher__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsEnoch__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDepth__pf;                                  // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsUseLight__pf;                               // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             bpp__Transform__pf;                                // 0x0010(0x0030)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         bpp__TimeScale__pf;                                // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__TimeDilation__pf;                             // 0x0044(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Duration__pf;                                 // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__LaunchTime__pf;                               // 0x004C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PBBP_MagicCircle_C_SetMagicCircleInfo;

// Function PBBP_MagicCircle.PBBP_MagicCircle_C.SetMagicCircleWorldInfo
// 0x0040 (0x0040 - 0x0000)
struct PBBP_MagicCircle_C_SetMagicCircleWorldInfo final
{
public:
	struct FTransform                             bpp__WorldTransform__pf;                           // 0x0000(0x0030)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         bpp__TimeScale__pf;                                // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0034(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0xB];                                       // 0x0035(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PBBP_MagicCircle_C_SetMagicCircleWorldInfo;

// Function PBBP_MagicCircle.PBBP_MagicCircle_C.StartMagicCircle
// 0x0050 (0x0050 - 0x0000)
struct PBBP_MagicCircle_C_StartMagicCircle final
{
public:
	EPB_MagicCircleType                           bpp__MagicCircleType__pf;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsHigher__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsEnoch__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDepth__pf;                                  // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsUseLight__pf;                               // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             bpp__Transform__pf;                                // 0x0010(0x0030)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         bpp__TimeScale__pf;                                // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0xB];                                       // 0x0045(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PBBP_MagicCircle_C_StartMagicCircle;

// Function PBBP_MagicCircle.PBBP_MagicCircle_C.UpdateMagicCircleLocation
// 0x0010 (0x0010 - 0x0000)
struct PBBP_MagicCircle_C_UpdateMagicCircleLocation final
{
public:
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PBBP_MagicCircle_C_UpdateMagicCircleLocation;

// Function PBBP_MagicCircle.PBBP_MagicCircle_C.UpdateMagicCircleRotation
// 0x0010 (0x0010 - 0x0000)
struct PBBP_MagicCircle_C_UpdateMagicCircleRotation final
{
public:
	struct FVector                                bpp__WorldVector__pf;                              // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PBBP_MagicCircle_C_UpdateMagicCircleRotation;

// Function PBBP_MagicCircle.PBBP_MagicCircle_C.UpdateMagicCircleTransform
// 0x0040 (0x0040 - 0x0000)
struct PBBP_MagicCircle_C_UpdateMagicCircleTransform final
{
public:
	struct FTransform                             bpp__WorldTransform__pf;                           // 0x0000(0x0030)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0xF];                                       // 0x0031(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PBBP_MagicCircle_C_UpdateMagicCircleTransform;

}

