#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBBP_MagicCircle

#include "Basic.hpp"

#include "EPB_MagicCircleType_structs.hpp"
#include "PB_MagicCircleInfo_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// DynamicClass PBBP_MagicCircle.PBBP_MagicCircle_C
// 0x0080 (0x0650 - 0x05D0)
class APBBP_MagicCircle_C final : public APBEventObject
{
public:
	class UParticleSystemComponent*               EndParticle;                                       // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*               StartParticle;                                     // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*               MainParticle;                                      // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        Scene;                                             // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalTime;                                         // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFnish;                                           // 0x05F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F5[0x3];                                      // 0x05F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStep_PlayerRoot_C*                     PlayerStep;                                        // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPB_MagicCircleInfo                    MagicCircle_Info;                                  // 0x0600(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDestroyWait;                                     // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_619[0x3];                                      // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DestroyTime;                                       // 0x061C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*               PMain;                                             // 0x0620(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*               PStart;                                            // 0x0628(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*               PEnd;                                              // 0x0630(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0638(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStep_PlayerRoot_C*                     K2Node_DynamicCast_AsStep_Player_Root;             // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0648(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndMagicCircle(float bpp__EndTime__pf, bool* bpp__return__pf);
	void EndMagicCircleDuration(float bpp__Duration__pf);
	void GetMagicCircleName(EPB_MagicCircleType bpp__MagicCircleType__pf, bool bpp__IsEnoch__pf, bool bpp__IsHigher__pf, bool bpp__IsDepth__pf, class FString* bpp__EffectID__pf);
	void ReceiveBeginPlay();
	void ReceiveTick(float bpp__DeltaSeconds__pf);
	void SetMagicCircleInfo(EPB_MagicCircleType bpp__MagicCircleType__pf, bool bpp__IsHigher__pf, bool bpp__IsEnoch__pf, bool bpp__IsDepth__pf, bool bpp__IsUseLight__pf, const struct FTransform& bpp__Transform__pf, float bpp__TimeScale__pf, float bpp__TimeDilation__pf, float bpp__Duration__pf, float bpp__LaunchTime__pf, bool* bpp__Value__pf);
	void SetMagicCircleWorldInfo(const struct FTransform& bpp__WorldTransform__pf, float bpp__TimeScale__pf, bool* bpp__return__pf);
	void StartMagicCircle(EPB_MagicCircleType bpp__MagicCircleType__pf, bool bpp__IsHigher__pf, bool bpp__IsEnoch__pf, bool bpp__IsDepth__pf, bool bpp__IsUseLight__pf, const struct FTransform& bpp__Transform__pf, float bpp__TimeScale__pf, bool* bpp__Value__pf);
	void UpdateMagicCircleLocation(const struct FVector& bpp__WorldLocation__pf, bool* bpp__Value__pf);
	void UpdateMagicCircleRotation(const struct FVector& bpp__WorldVector__pf, bool* bpp__Value__pf);
	void UpdateMagicCircleTransform(const struct FTransform& bpp__WorldTransform__pf, bool* bpp__Value__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PBBP_MagicCircle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PBBP_MagicCircle_C")
	}
	static class APBBP_MagicCircle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBBP_MagicCircle_C>();
	}
};
DUMPER7_ASSERTS_APBBP_MagicCircle_C;

}

