#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBGameInstanceBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBGameInstanceBP.PBGameInstanceBP_C
// 0x0048 (0x2FDD8 - 0x2FD90)
class UPBGameInstanceBP_C final : public UPBGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2FD90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bReturningFromHostedGame;                          // 0x2FD98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bWaitingHosted;                                    // 0x2FD99(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          waitingOnLoadingScreen;                            // 0x2FD9A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD9B[0x5];                                    // 0x2FD9B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBUserWidget*                          LoadWaitAnim;                                      // 0x2FDA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   NetworkErrorMsg;                                   // 0x2FDA8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bShowingHostDisconnectMsg;                         // 0x2FDC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bWaitingInvite;                                    // 0x2FDC1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FDC2[0x6];                                    // 0x2FDC2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnNetworkFailure;                                  // 0x2FDC8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_PBGameInstanceBP(int32 EntryPoint);
	void InternalBPResetForCultureChange();
	void StopLoadWidget();
	void OnSaveStoryDataCompletedDelegates_Event_0();
	void ReceiveInit();
	void HandleNetworkError(ENetworkFailure FailureType, bool bIsServer);
	void OCDisplayMsg(const class FString& Msg, float Duration, EPBOCMsgPriority Priority, int32 ZOrder, bool MsgReturnsToTitle);
	void LoadRematchGame();
	void GetOnlinePlayersNum(int32* Players);
	bool StartLoadWidget();

	bool IsWaitingHosted() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PBGameInstanceBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PBGameInstanceBP_C")
	}
	static class UPBGameInstanceBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPBGameInstanceBP_C>();
	}
};
DUMPER7_ASSERTS_UPBGameInstanceBP_C;

}

