#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBTitlePlayerController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBTitlePlayerController.PBTitlePlayerController_C
// 0x0020 (0x0870 - 0x0850)
class APBTitlePlayerController_C final : public APBControllerBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0850(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bReady;                                            // 0x0858(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_859[0x3];                                      // 0x0859(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ServerAuthorativePlayerIndex;                      // 0x085C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfPlayers;                                   // 0x0860(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClientPingTime;                                    // 0x0864(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClientPingUpdate;                                  // 0x0868(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBTitlePlayerController(int32 EntryPoint);
	void SERVER_SetClientPing(int32 ClientPing);
	void ReceiveTick(float DeltaSeconds);
	void Server_UpdateMyLoadout(const struct FCustomizationInfoLoadout& loadout);
	void Server_UpdateMyCustomization(const TArray<uint8>& NewCustomization);
	void Server_SetReady(bool Ready, EPBGameModePlayer SelectedPlayer);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PBTitlePlayerController_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PBTitlePlayerController_C")
	}
	static class APBTitlePlayerController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBTitlePlayerController_C>();
	}
};
DUMPER7_ASSERTS_APBTitlePlayerController_C;

}

