#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBTimeStealEffectManager_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBTimeStealEffectManager_BP.PBTimeStealEffectManager_BP_C
// 0x0040 (0x0068 - 0x0028)
class UPBTimeStealEffectManager_BP_C final : public UPBTimeStealEffectManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class APBBaseCharacter*>               TimeStealCharacter;                                // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	class APBBaseCharacter*                       LastTimeStealCharacter;                            // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            TimeSteeleTransCurve;                              // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TimeStealStep;                                     // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         stepTimer;                                         // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBBaseCharacter*                       ReserveTimeStealLastChara;                         // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeStealTimer;                                    // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EffectSizeScale;                                   // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBTimeStealEffectManager_BP(int32 EntryPoint);
	void EndTimeSteal(class APBBaseCharacter* Chr, float Duration);
	void StartTimeSteal(class APBBaseCharacter* Chr, float Duration);
	void Initialize();
	void Update(float DeltaSeconds);
	void UpdateTimeSteal(float DeltaSeconds);
	void SetStep(int32 NewStep);
	void AddTimeStealTimer(float DeltaSeconds, float Max, float* TimeStealTimer_0);
	void SubTimeStealTimer(float DeltaSeconds, float Min, float* TimeStealTimer_0);

	bool CompleteryTimeStealed() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PBTimeStealEffectManager_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PBTimeStealEffectManager_BP_C")
	}
	static class UPBTimeStealEffectManager_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPBTimeStealEffectManager_BP_C>();
	}
};
DUMPER7_ASSERTS_UPBTimeStealEffectManager_BP_C;

}

