#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerCharaSelecter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerCharaSelecter.PlayerCharaSelecter_C
// 0x0078 (0x02F0 - 0x0278)
class UPlayerCharaSelecter_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStartupSelectMenu_C*                   BaseMenu;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UPlayerCharaList_C*>             ListItems;                                         // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Index_0;                                           // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Top;                                               // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LAST;                                              // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   EventSelectCancel;                                 // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventSelectDecide;                                 // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<EPBGameLevel>                          GameLevel;                                         // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UCommonControllGuide_C*                 UIGuide;                                           // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonMsgPopup_C*                      Popup;                                             // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBGameModePlayer                             Character;                                         // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerCharaSelecter(int32 EntryPoint);
	void OnPressedButton();
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void Construct();
	void Initialize();
	void Setup();
	void OnStart();
	void OnSelectMenu();
	void AddList(class UPlayerCharaList_C* add_list);
	void GetList(int32 Param_Index_0, class UPlayerCharaList_C** Output);
	void GetSelectList(class UPlayerCharaList_C** Output);
	void Clean();
	void Refresh();
	void MoveCursor(int32 Move);
	void SetPlayerCharacter();
	void StartMenu(class UCommonControllGuide_C* Input);
	void UpdateControlGuide();
	void GetSelectedPlayerCharacter(EPBGameModePlayer* SelectedPlayerCharacter);
	void SetCanvasPanelOffsets(EPBGameModeType Selection);
	void VerifyFirstTimePopup(EPBGameModePlayer Player_Type, bool* ShouldPrint);
	void SetGameModePlayerType();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PlayerCharaSelecter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayerCharaSelecter_C")
	}
	static class UPlayerCharaSelecter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerCharaSelecter_C>();
	}
};
DUMPER7_ASSERTS_UPlayerCharaSelecter_C;

}

