#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestDetailWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function QuestDetailWindow.QuestDetailWindow_C.ExecuteUbergraph_QuestDetailWindow
// 0x0004 (0x0004 - 0x0000)
struct QuestDetailWindow_C_ExecuteUbergraph_QuestDetailWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QuestDetailWindow_C_ExecuteUbergraph_QuestDetailWindow;

// Function QuestDetailWindow.QuestDetailWindow_C.SetProgress
// 0x0228 (0x0228 - 0x0000)
struct QuestDetailWindow_C_SetProgress final
{
public:
	struct FPBQuestCatalogData                    Data;                                              // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPBQuestCatalogData                    Quest;                                             // 0x00F8(0x00F8)(Edit, BlueprintVisible)
	EQuestProgress                                Param;                                             // 0x01F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuestProgress                                Temp_byte_Variable;                                // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable1;                             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable2;                             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable3;                             // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetArchiveFlag_IsDone;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QuestDetailWindow_C_SetProgress;

// Function QuestDetailWindow.QuestDetailWindow_C.SetDetail
// 0x0228 (0x0228 - 0x0000)
struct QuestDetailWindow_C_SetDetail final
{
public:
	struct FPBQuestCatalogData                    Data;                                              // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description;                                       // 0x00F8(0x0018)(Edit, BlueprintVisible)
	struct FPBQuestCatalogData                    QuestData;                                         // 0x0110(0x00F8)(Edit, BlueprintVisible)
	bool                                          CallFunc_GetArchiveFlag_IsDone;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDescription_output;                    // 0x0210(0x0018)()
};
DUMPER7_ASSERTS_QuestDetailWindow_C_SetDetail;

// Function QuestDetailWindow.QuestDetailWindow_C.SetCliant
// 0x02C0 (0x02C0 - 0x0000)
struct QuestDetailWindow_C_SetCliant final
{
public:
	struct FPBQuestCatalogData                    Data;                                              // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPBQuestCatalogData                    QuestData;                                         // 0x00F8(0x00F8)(Edit, BlueprintVisible)
	class FName                                   Key;                                               // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FText>                Name_0;                                            // 0x01F8(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          CallFunc_GetArchiveFlag_IsDone;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0250(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FText>                K2Node_MakeVariable_MakeVariableOutput;            // 0x0270(0x0050)(ZeroConstructor)
};
DUMPER7_ASSERTS_QuestDetailWindow_C_SetCliant;

// Function QuestDetailWindow.QuestDetailWindow_C.SetRewardAndIcons
// 0x06C0 (0x06C0 - 0x0000)
struct QuestDetailWindow_C_SetRewardAndIcons final
{
public:
	struct FPBQuestCatalogData                    Data;                                              // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPBItemCatalogData                     RequestItemData;                                   // 0x00F8(0x0078)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FPBItemCatalogData                     RewardItemData;                                    // 0x0170(0x0078)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   RewaredText;                                       // 0x01E8(0x0018)(Edit, BlueprintVisible)
	class FText                                   ExpText;                                           // 0x0200(0x0018)(Edit, BlueprintVisible)
	class FText                                   Name_0;                                            // 0x0218(0x0018)(Edit, BlueprintVisible)
	class UPBCharacterInventoryComponent*         Inventory;                                         // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reward;                                            // 0x023C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Exp;                                               // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBQuestCatalogData                    QuestData;                                         // 0x0248(0x00F8)(Edit, BlueprintVisible)
	bool                                          CallFunc_GetArchiveFlag_IsDone;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0348(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0388(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x03C8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x03D8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0418(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x0430(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0440(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0458(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0470(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0480(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0490(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0498(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x04B0(0x0040)(HasGetValueTypeHash)
	struct FPBItemCatalogData                     CallFunc_GetItemDataById_itemData;                 // 0x04F0(0x0078)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData4;             // 0x0570(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData5;             // 0x05B0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x05F0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array3;                           // 0x0600(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0610(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue3;                      // 0x0628(0x0018)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue1;         // 0x0641(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_642[0x6];                                      // 0x0642(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBItemCatalogData                     CallFunc_GetItemDataById_itemData1;                // 0x0648(0x0078)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QuestDetailWindow_C_SetRewardAndIcons;

// Function QuestDetailWindow.QuestDetailWindow_C.UpdateQuestInfo
// 0x0100 (0x0100 - 0x0000)
struct QuestDetailWindow_C_UpdateQuestInfo final
{
public:
	class UQuestMenuListItem_C*                   Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBQuestCatalogData                    QuestData;                                         // 0x0008(0x00F8)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_QuestDetailWindow_C_UpdateQuestInfo;

// Function QuestDetailWindow.QuestDetailWindow_C.GetCateringTarget
// 0x01F0 (0x01F0 - 0x0000)
struct QuestDetailWindow_C_GetCateringTarget final
{
public:
	struct FPBQuestCatalogData                    input_data;                                        // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPBQuestCatalogData                    quest_data;                                        // 0x00F8(0x00F8)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_QuestDetailWindow_C_GetCateringTarget;

// Function QuestDetailWindow.QuestDetailWindow_C.GetDescription
// 0x0258 (0x0258 - 0x0000)
struct QuestDetailWindow_C_GetDescription final
{
public:
	struct FPBQuestCatalogData                    input_data;                                        // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Output;                                            // 0x00F8(0x0018)(Parm, OutParm)
	struct FPBQuestCatalogData                    QuestData;                                         // 0x0110(0x00F8)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetCateringDescription_output;            // 0x0208(0x0018)()
	class FText                                   CallFunc_GetMementoDescription_output;             // 0x0220(0x0018)()
	class FText                                   CallFunc_GetEnemyDescription_output;               // 0x0238(0x0018)()
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_QuestDetailWindow_C_GetDescription;

// Function QuestDetailWindow.QuestDetailWindow_C.GetEnemyDescription
// 0x0390 (0x0390 - 0x0000)
struct QuestDetailWindow_C_GetEnemyDescription final
{
public:
	struct FPBQuestCatalogData                    input_data;                                        // 0x0000(0x00F8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Output;                                            // 0x00F8(0x0018)(Parm, OutParm)
	class FText                                   Format;                                            // 0x0110(0x0018)(Edit, BlueprintVisible)
	class FText                                   record;                                            // 0x0128(0x0018)(Edit, BlueprintVisible)
	class FText                                   Caption;                                           // 0x0140(0x0018)(Edit, BlueprintVisible)
	class FText                                   Target;                                            // 0x0158(0x0018)(Edit, BlueprintVisible)
	struct FPBQuestCatalogData                    quest_data;                                        // 0x0170(0x00F8)(Edit, BlueprintVisible)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0268(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x02A8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x02E8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0328(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0338(0x0018)()
	class UPBQuestManager*                        CallFunc_GetQuestManager_ReturnValue;              // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetKillRecordText_ReturnValue;            // 0x0358(0x0018)()
	class UPBQuestManager*                        CallFunc_GetQuestManager_ReturnValue1;             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetKillTargetText_ReturnValue;            // 0x0378(0x0018)()
};
DUMPER7_ASSERTS_QuestDetailWindow_C_GetEnemyDescription;

// Function QuestDetailWindow.QuestDetailWindow_C.GetCateringDescription
// 0x0318 (0x0318 - 0x0000)
struct QuestDetailWindow_C_GetCateringDescription final
{
public:
	struct FPBQuestCatalogData                    input_data;                                        // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Output;                                            // 0x00F8(0x0018)(Parm, OutParm)
	class FText                                   Format;                                            // 0x0110(0x0018)(Edit, BlueprintVisible)
	class FText                                   Caption;                                           // 0x0128(0x0018)(Edit, BlueprintVisible)
	class FText                                   Target;                                            // 0x0140(0x0018)(Edit, BlueprintVisible)
	struct FPBQuestCatalogData                    quest_data;                                        // 0x0158(0x00F8)(Edit, BlueprintVisible)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0250(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0290(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02D0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02E0(0x0018)()
	class UPBQuestManager*                        CallFunc_GetQuestManager_ReturnValue;              // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCateringTargetText_ReturnValue;        // 0x0300(0x0018)()
};
DUMPER7_ASSERTS_QuestDetailWindow_C_GetCateringDescription;

// Function QuestDetailWindow.QuestDetailWindow_C.GetMementoDescription
// 0x0318 (0x0318 - 0x0000)
struct QuestDetailWindow_C_GetMementoDescription final
{
public:
	struct FPBQuestCatalogData                    input_data;                                        // 0x0000(0x00F8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Output;                                            // 0x00F8(0x0018)(Parm, OutParm)
	class FText                                   Format;                                            // 0x0110(0x0018)(Edit, BlueprintVisible)
	class FText                                   Caption;                                           // 0x0128(0x0018)(Edit, BlueprintVisible)
	class FText                                   Target;                                            // 0x0140(0x0018)(Edit, BlueprintVisible)
	struct FPBQuestCatalogData                    quest_data;                                        // 0x0158(0x00F8)(Edit, BlueprintVisible)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0250(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0290(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02D0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02E0(0x0018)()
	class UPBQuestManager*                        CallFunc_GetQuestManager_ReturnValue;              // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetMementoTargetText_ReturnValue;         // 0x0300(0x0018)()
};
DUMPER7_ASSERTS_QuestDetailWindow_C_GetMementoDescription;

}

