#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RandomizerManualSeedSetBlock

#include "Basic.hpp"


namespace SDK::Params
{

// Function RandomizerManualSeedSetBlock.RandomizerManualSeedSetBlock_C.ExecuteUbergraph_RandomizerManualSeedSetBlock
// 0x0058 (0x0058 - 0x0000)
struct RandomizerManualSeedSetBlock_C_ExecuteUbergraph_RandomizerManualSeedSetBlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue1;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> K2Node_Event_OnStepChanged; // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_ZOrder;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName1_CmpSuccess;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
};
DUMPER7_ASSERTS_RandomizerManualSeedSetBlock_C_ExecuteUbergraph_RandomizerManualSeedSetBlock;

// Function RandomizerManualSeedSetBlock.RandomizerManualSeedSetBlock_C.Start
// 0x0014 (0x0014 - 0x0000)
struct RandomizerManualSeedSetBlock_C_Start final
{
public:
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> OnStepChanged; // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	int32                                         ZOrder;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RandomizerManualSeedSetBlock_C_Start;

// Function RandomizerManualSeedSetBlock.RandomizerManualSeedSetBlock_C.OnInvalid
// 0x0002 (0x0002 - 0x0000)
struct RandomizerManualSeedSetBlock_C_OnInvalid final
{
public:
	bool                                          CallFunc_IsSelectDecide_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectCancel_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_RandomizerManualSeedSetBlock_C_OnInvalid;

// Function RandomizerManualSeedSetBlock.RandomizerManualSeedSetBlock_C.OnActive
// 0x0002 (0x0002 - 0x0000)
struct RandomizerManualSeedSetBlock_C_OnActive final
{
public:
	bool                                          CallFunc_IsSelectDecide_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectCancel_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_RandomizerManualSeedSetBlock_C_OnActive;

// Function RandomizerManualSeedSetBlock.RandomizerManualSeedSetBlock_C.SetupContorolGuide
// 0x0008 (0x0008 - 0x0000)
struct RandomizerManualSeedSetBlock_C_SetupContorolGuide final
{
public:
	class UCommonControllGuide_C*                 Input;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RandomizerManualSeedSetBlock_C_SetupContorolGuide;

// Function RandomizerManualSeedSetBlock.RandomizerManualSeedSetBlock_C.Activate
// 0x0030 (0x0030 - 0x0000)
struct RandomizerManualSeedSetBlock_C_Activate final
{
public:
	class FText                                   txt;                                               // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetCommitedText_output;                   // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_RandomizerManualSeedSetBlock_C_Activate;

// Function RandomizerManualSeedSetBlock.RandomizerManualSeedSetBlock_C.SetSeedField
// 0x0058 (0x0058 - 0x0000)
struct RandomizerManualSeedSetBlock_C_SetSeedField final
{
public:
	class UPBDropManager*                         CallFunc_GetDropManager_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetInputText_Text;                        // 0x0028(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RandomizerManualSeedSetBlock_C_SetSeedField;

// Function RandomizerManualSeedSetBlock.RandomizerManualSeedSetBlock_C.ResetSeedField
// 0x0030 (0x0030 - 0x0000)
struct RandomizerManualSeedSetBlock_C_ResetSeedField final
{
public:
	class UCommonTextBox_C*                       NewLocalVar_0;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   text;                                              // 0x0008(0x0018)(Edit, BlueprintVisible)
	class FString                                 Name_0;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RandomizerManualSeedSetBlock_C_ResetSeedField;

// Function RandomizerManualSeedSetBlock.RandomizerManualSeedSetBlock_C.UpdateNameText
// 0x0030 (0x0030 - 0x0000)
struct RandomizerManualSeedSetBlock_C_UpdateNameText final
{
public:
	class FText                                   text;                                              // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetInputText_Text;                        // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_RandomizerManualSeedSetBlock_C_UpdateNameText;

}

