#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RankingBossRush

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RankingBossRush.RankingBossRush_C
// 0x0078 (0x02D0 - 0x0258)
class URankingBossRush_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonWaitMsgPopup_C*                  CommonWaitMsgPopup;                                // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URankingCourceSelecter_C*               CourceSelecter;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Date;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URankingDifficultySelecter_C*           DifficultySelecter;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URankingListWindow_C*                   ListWindow;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URankingPlayerSelecter_C*               PlayerSelecter;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTabButtons_C*                          TabButtons;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Time;                                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBLeaderboardRow>              ListData;                                          // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class URankingSpeedRunList_C*>         ListItems;                                         // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_RankingBossRush(int32 EntryPoint);
	void Construct();
	void GetRankingLIst(const TArray<struct FPBLeaderboardRow>& aLeaderBoard);
	void SetupRankLIst();
	void Initialize();
	void Setup();
	void GetSelecter(int32 Param_Index_0, class URankingSelecter_C** Output);
	void MoveSelecter(int32 move_val);
	void SwitchList(int32 move_val);
	void AddList(class URankingSpeedRunList_C* Input);
	void GetList(int32 Param_Index_0, class URankingSpeedRunList_C** Output);
	void GetSelectList(class URankingSpeedRunList_C** Output);
	void Clean();
	void Refresh();
	void UpdateLast();
	void IsAddList(const struct FPBLeaderboardRow& Input, bool* is_enable);
	void MoveCursor(int32 move_val);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RankingBossRush_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RankingBossRush_C")
	}
	static class URankingBossRush_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URankingBossRush_C>();
	}
};
DUMPER7_ASSERTS_URankingBossRush_C;

}

