#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RankingModeSelecter

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function RankingModeSelecter.RankingModeSelecter_C.ExecuteUbergraph_RankingModeSelecter
// 0x0004 (0x0004 - 0x0000)
struct RankingModeSelecter_C_ExecuteUbergraph_RankingModeSelecter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RankingModeSelecter_C_ExecuteUbergraph_RankingModeSelecter;

// Function RankingModeSelecter.RankingModeSelecter_C.Setup
// 0x0028 (0x0028 - 0x0000)
struct RankingModeSelecter_C_Setup final
{
public:
	EPBInputDeviceMode                            CallFunc_GetInputDeviceMode_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetActionIconImage_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetActionIconImage_ReturnValue1;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RankingModeSelecter_C_Setup;

// Function RankingModeSelecter.RankingModeSelecter_C.AddMenuLamp
// 0x0010 (0x0010 - 0x0000)
struct RankingModeSelecter_C_AddMenuLamp final
{
public:
	class UCommonSelectLamp_C*                    lamp;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonSelectLamp_C*                    CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RankingModeSelecter_C_AddMenuLamp;

// Function RankingModeSelecter.RankingModeSelecter_C.AddMode
// 0x0040 (0x0040 - 0x0000)
struct RankingModeSelecter_C_AddMode final
{
public:
	class FText                                   input_text;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UCommonSelectLamp_C*                    NewLocalVar_0;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   txt;                                               // 0x0020(0x0018)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RankingModeSelecter_C_AddMode;

// Function RankingModeSelecter.RankingModeSelecter_C.Clear
// 0x0008 (0x0008 - 0x0000)
struct RankingModeSelecter_C_Clear final
{
public:
	class UCommonSelectLamp_C*                    Element;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RankingModeSelecter_C_Clear;

// Function RankingModeSelecter.RankingModeSelecter_C.ClearMenuNames
// 0x0004 (0x0004 - 0x0000)
struct RankingModeSelecter_C_ClearMenuNames final
{
public:
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RankingModeSelecter_C_ClearMenuNames;

// Function RankingModeSelecter.RankingModeSelecter_C.SetMode
// 0x0018 (0x0018 - 0x0000)
struct RankingModeSelecter_C_SetMode final
{
public:
	int32                                         Param_Index_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                NewLocalVar_2;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RankingModeSelecter_C_SetMode;

}

