#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RankingListWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIScroll_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RankingListWindow.RankingListWindow_C
// 0x0028 (0x02D0 - 0x02A8)
class URankingListWindow_C final : public UUIScroll_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_RankingListWindow_C;                // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 back;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBlockTitle_C*                    CommonBlockTitle;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollView;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RankingListWindow(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void AddWidght(class UWidget* add_item, class UPanelSlot** Output);
	void Initialize();
	void Setup();
	void UpdateScroll();
	void ClampIndex(int32 Param_Index_0, int32* NewParam);
	void GetListIndex(int32* Param_Index_0);
	void GetWidght(int32 Param_Index_0, class UWidget** Output);
	void MoveScroll(int32 move_val);
	void SetListIndex(int32 Param_Index_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RankingListWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RankingListWindow_C")
	}
	static class URankingListWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URankingListWindow_C>();
	}
};
DUMPER7_ASSERTS_URankingListWindow_C;

}

