#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_ChaosEnchant

#include "Basic.hpp"

#include "EPB_N1011_EnchantType_structs.hpp"


namespace SDK
{

// ScriptStruct S_ChaosEnchant.S_ChaosEnchant
// 0x0018 (0x0018 - 0x0000)
struct FS_ChaosEnchant final
{
public:
	int32                                         PlayerNumber_11_10635E0D444D83AB86C4C4A86113BE2B;  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBStepBase*                            Step_14_EC11562A459E1E31DA7625A8516C6BD2;          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_N1011_EnchantType                         EnchantType_6_0D66B72A48667521723E58B905930270;    // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemainingDuration_8_27AB9A8E4C97C781ED0431AA97D41C3C; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FS_ChaosEnchant;

}

