#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SavedataInfo

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function SavedataInfo.SavedataInfo_C.ExecuteUbergraph_SavedataInfo
// 0x0008 (0x0008 - 0x0000)
struct SavedataInfo_C_ExecuteUbergraph_SavedataInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SavedataInfo_C_ExecuteUbergraph_SavedataInfo;

// Function SavedataInfo.SavedataInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SavedataInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SavedataInfo_C_PreConstruct;

// Function SavedataInfo.SavedataInfo_C.SetSaveData
// 0x00A8 (0x00A8 - 0x0000)
struct SavedataInfo_C_SetSaveData final
{
public:
	struct FPBSaveGameDataInfo                    Input;                                             // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_SavedataInfo_C_SetSaveData;

// Function SavedataInfo.SavedataInfo_C.IsNewSavedata
// 0x0006 (0x0006 - 0x0000)
struct SavedataInfo_C_IsNewSavedata final
{
public:
	bool                                          is_true;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isEnable;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          is_newdata;                                        // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TRUE_0;                                            // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SavedataInfo_C_IsNewSavedata;

// Function SavedataInfo.SavedataInfo_C.UpdateInfo
// 0x0018 (0x0018 - 0x0000)
struct SavedataInfo_C_UpdateInfo final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNewSaveData_IsEnable;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SavedataInfo_C_UpdateInfo;

// Function SavedataInfo.SavedataInfo_C.SetBreakIcon
// 0x0002 (0x0002 - 0x0000)
struct SavedataInfo_C_SetBreakIcon final
{
public:
	bool                                          is_suspend;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Break;                                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SavedataInfo_C_SetBreakIcon;

}

