#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveSlotItem

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function SaveSlotItem.SaveSlotItem_C.ExecuteUbergraph_SaveSlotItem
// 0x0004 (0x0004 - 0x0000)
struct SaveSlotItem_C_ExecuteUbergraph_SaveSlotItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SaveSlotItem_C_ExecuteUbergraph_SaveSlotItem;

// Function SaveSlotItem.SaveSlotItem_C.PlayBlink
// 0x0001 (0x0001 - 0x0000)
struct SaveSlotItem_C_PlayBlink final
{
public:
	bool                                          CallFunc_IsNewData_IsEnable;                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SaveSlotItem_C_PlayBlink;

// Function SaveSlotItem.SaveSlotItem_C.SetDispCursor
// 0x0002 (0x0002 - 0x0000)
struct SaveSlotItem_C_SetDispCursor final
{
public:
	bool                                          isEnable_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsOn;                                              // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SaveSlotItem_C_SetDispCursor;

// Function SaveSlotItem.SaveSlotItem_C.SetSlotParam
// 0x00B0 (0x00B0 - 0x0000)
struct SaveSlotItem_C_SetSlotParam final
{
public:
	struct FPBSaveGameDataInfo                    input_data;                                        // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         idx;                                               // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SaveSlotItem_C_SetSlotParam;

// Function SaveSlotItem.SaveSlotItem_C.GetSaveData
// 0x00A8 (0x00A8 - 0x0000)
struct SaveSlotItem_C_GetSaveData final
{
public:
	struct FPBSaveGameDataInfo                    SaveData_0;                                        // 0x0000(0x00A8)(Parm, OutParm)
};
DUMPER7_ASSERTS_SaveSlotItem_C_GetSaveData;

// Function SaveSlotItem.SaveSlotItem_C.SetNewDataFlag
// 0x0001 (0x0001 - 0x0000)
struct SaveSlotItem_C_SetNewDataFlag final
{
public:
	bool                                          CallFunc_IsNewSavedata_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SaveSlotItem_C_SetNewDataFlag;

// Function SaveSlotItem.SaveSlotItem_C.SetSlotName
// 0x0038 (0x0038 - 0x0000)
struct SaveSlotItem_C_SetSlotName final
{
public:
	class FText                                   txt;                                               // 0x0000(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNewData_IsEnable;                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
DUMPER7_ASSERTS_SaveSlotItem_C_SetSlotName;

// Function SaveSlotItem.SaveSlotItem_C.SetEnableData
// 0x0002 (0x0002 - 0x0000)
struct SaveSlotItem_C_SetEnableData final
{
public:
	bool                                          is_match;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableSavedata_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SaveSlotItem_C_SetEnableData;

// Function SaveSlotItem.SaveSlotItem_C.IsNewData
// 0x0004 (0x0004 - 0x0000)
struct SaveSlotItem_C_IsNewData final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isEnable_0;                                        // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsTrue;                                            // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SaveSlotItem_C_IsNewData;

// Function SaveSlotItem.SaveSlotItem_C.IsEnableData
// 0x0004 (0x0004 - 0x0000)
struct SaveSlotItem_C_IsEnableData final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isEnable_0;                                        // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsTrue;                                            // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SaveSlotItem_C_IsEnableData;

// Function SaveSlotItem.SaveSlotItem_C.IsInherite
// 0x0005 (0x0005 - 0x0000)
struct SaveSlotItem_C_IsInherite final
{
public:
	bool                                          is_true;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          is_enable;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          is_inherite;                                       // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TRUE_0;                                            // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SaveSlotItem_C_IsInherite;

// Function SaveSlotItem.SaveSlotItem_C.IsSuspended
// 0x0004 (0x0004 - 0x0000)
struct SaveSlotItem_C_IsSuspended final
{
public:
	bool                                          is_true;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSuspended_0;                                     // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TRUE_0;                                            // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SaveSlotItem_C_IsSuspended;

// Function SaveSlotItem.SaveSlotItem_C.SetSuspendData
// 0x00C0 (0x00C0 - 0x0000)
struct SaveSlotItem_C_SetSuspendData final
{
public:
	struct FPBSaveGameDataInfo                    input_data;                                        // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 Name_0;                                            // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SaveSlotItem_C_SetSuspendData;

// Function SaveSlotItem.SaveSlotItem_C.GetEditNameBox
// 0x0008 (0x0008 - 0x0000)
struct SaveSlotItem_C_GetEditNameBox final
{
public:
	class UCommonTextBox_C*                       TextBox_0;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SaveSlotItem_C_GetEditNameBox;

// Function SaveSlotItem.SaveSlotItem_C.UpdatePlayerName
// 0x0098 (0x0098 - 0x0000)
struct SaveSlotItem_C_UpdatePlayerName final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 slot_name;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 new_name;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   txt;                                               // 0x0030(0x0018)(Edit, BlueprintVisible)
	class FString                                 STR;                                               // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBSaveManager*                         CallFunc_GetSaveManager_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetInputText_Text;                        // 0x0068(0x0018)()
	bool                                          CallFunc_UpdateEntryName_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SaveSlotItem_C_UpdatePlayerName;

// Function SaveSlotItem.SaveSlotItem_C.IsSelectSuspendData
// 0x0004 (0x0004 - 0x0000)
struct SaveSlotItem_C_IsSelectSuspendData final
{
public:
	bool                                          is_true;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          is_enable;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TRUE_0;                                            // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SaveSlotItem_C_IsSelectSuspendData;

// Function SaveSlotItem.SaveSlotItem_C.SetCorruptedData
// 0x00B0 (0x00B0 - 0x0000)
struct SaveSlotItem_C_SetCorruptedData final
{
public:
	struct FPBSaveGameDataInfo                    input_data;                                        // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          is_match;                                          // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBSaveDataExistance                          CallFunc_GetCachedSaveDataExistance_ReturnValue;   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SaveSlotItem_C_SetCorruptedData;

// Function SaveSlotItem.SaveSlotItem_C.SetClassicData
// 0x00B0 (0x00B0 - 0x0000)
struct SaveSlotItem_C_SetClassicData final
{
public:
	struct FPBSaveGameDataInfo                    Input_Data;                                        // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SaveSlotItem_C_SetClassicData;

}

