#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SavedataInfoPanel

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SavedataInfoPanel.SavedataInfoPanel_C.ExecuteUbergraph_SavedataInfoPanel
// 0x0008 (0x0008 - 0x0000)
struct SavedataInfoPanel_C_ExecuteUbergraph_SavedataInfoPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SavedataInfoPanel_C_ExecuteUbergraph_SavedataInfoPanel;

// Function SavedataInfoPanel.SavedataInfoPanel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SavedataInfoPanel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SavedataInfoPanel_C_PreConstruct;

// Function SavedataInfoPanel.SavedataInfoPanel_C.SetSaveDataInfo
// 0x00A8 (0x00A8 - 0x0000)
struct SavedataInfoPanel_C_SetSaveDataInfo final
{
public:
	struct FPBSaveGameDataInfo                    Input;                                             // 0x0000(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_SavedataInfoPanel_C_SetSaveDataInfo;

// Function SavedataInfoPanel.SavedataInfoPanel_C.SetName
// 0x00C8 (0x00C8 - 0x0000)
struct SavedataInfoPanel_C_SetName final
{
public:
	EPBGameModePlayer                             Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBGameModePlayer                             Chara;                                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPBGameModePlayer, class FText>          Names;                                             // 0x0008(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	TMap<EPBGameModePlayer, class FText>          K2Node_MakeVariable_MakeVariableOutput;            // 0x0058(0x0050)(ZeroConstructor)
	class FText                                   CallFunc_Map_Find_Value;                           // 0x00A8(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SavedataInfoPanel_C_SetName;

// Function SavedataInfoPanel.SavedataInfoPanel_C.SetFaceIcon
// 0x00C0 (0x00C0 - 0x0000)
struct SavedataInfoPanel_C_SetFaceIcon final
{
public:
	EPBGameModePlayer                             Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EIconType                                     IconType;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EIconType, class UTexture2D*>            ExtraIconTypeToIcon;                               // 0x0008(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EIconType, class UTexture2D*>            K2Node_MakeVariable_MakeVariableOutput;            // 0x0060(0x0050)(ZeroConstructor)
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SavedataInfoPanel_C_SetFaceIcon;

// Function SavedataInfoPanel.SavedataInfoPanel_C.SetLevel
// 0x0070 (0x0070 - 0x0000)
struct SavedataInfoPanel_C_SetLevel final
{
public:
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0000(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
};
DUMPER7_ASSERTS_SavedataInfoPanel_C_SetLevel;

// Function SavedataInfoPanel.SavedataInfoPanel_C.SetSaveDate
// 0x0050 (0x0050 - 0x0000)
struct SavedataInfoPanel_C_SetSaveDate final
{
public:
	class FText                                   NewLocalVar_1;                                     // 0x0000(0x0018)(Edit, BlueprintVisible)
	struct FPBSaveDateTime                        NewLocalVar_0;                                     // 0x0018(0x0018)(Edit, BlueprintVisible, NoDestructor)
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_AsDateTime_DateTime_ReturnValue;          // 0x0038(0x0018)()
};
DUMPER7_ASSERTS_SavedataInfoPanel_C_SetSaveDate;

// Function SavedataInfoPanel.SavedataInfoPanel_C.SetDifficulty
// 0x00C8 (0x00C8 - 0x0000)
struct SavedataInfoPanel_C_SetDifficulty final
{
public:
	TMap<EPBGameLevel, class FText>               Keys;                                              // 0x0000(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	EPBGameLevel                                  Selection;                                         // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPBGameLevel, class FText>               K2Node_MakeVariable_MakeVariableOutput;            // 0x0058(0x0050)(ZeroConstructor)
	class FText                                   CallFunc_Map_Find_Value;                           // 0x00A8(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SavedataInfoPanel_C_SetDifficulty;

// Function SavedataInfoPanel.SavedataInfoPanel_C.SetClearSign
// 0x0006 (0x0006 - 0x0000)
struct SavedataInfoPanel_C_SetClearSign final
{
public:
	bool                                          is_enable;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SavedataInfoPanel_C_SetClearSign;

// Function SavedataInfoPanel.SavedataInfoPanel_C.SetGameMode
// 0x00C8 (0x00C8 - 0x0000)
struct SavedataInfoPanel_C_SetGameMode final
{
public:
	TMap<EPBGameModeType, class FText>            Table;                                             // 0x0000(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	EPBGameModeType                               Key;                                               // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPBGameModeType, class FText>            K2Node_MakeVariable_MakeVariableOutput;            // 0x0058(0x0050)(ZeroConstructor)
	class FText                                   CallFunc_Map_Find_Value;                           // 0x00A8(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SavedataInfoPanel_C_SetGameMode;

// Function SavedataInfoPanel.SavedataInfoPanel_C.SetBreakIcon
// 0x0001 (0x0001 - 0x0000)
struct SavedataInfoPanel_C_SetBreakIcon final
{
public:
	bool                                          is_break;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SavedataInfoPanel_C_SetBreakIcon;

}

