#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShortcutSlotName

#include "Basic.hpp"


namespace SDK::Params
{

// Function ShortcutSlotName.ShortcutSlotName_C.ExecuteUbergraph_ShortcutSlotName
// 0x0004 (0x0004 - 0x0000)
struct ShortcutSlotName_C_ExecuteUbergraph_ShortcutSlotName final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShortcutSlotName_C_ExecuteUbergraph_ShortcutSlotName;

// Function ShortcutSlotName.ShortcutSlotName_C.GetSlotName
// 0x0060 (0x0060 - 0x0000)
struct ShortcutSlotName_C_GetSlotName final
{
public:
	class FText                                   Output;                                            // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   txt;                                               // 0x0018(0x0018)(Edit, BlueprintVisible)
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetShortcutName_ReturnValue;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
};
DUMPER7_ASSERTS_ShortcutSlotName_C_GetSlotName;

// Function ShortcutSlotName.ShortcutSlotName_C.SetSlotName
// 0x0030 (0x0030 - 0x0000)
struct ShortcutSlotName_C_SetSlotName final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   txt;                                               // 0x0018(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_ShortcutSlotName_C_SetSlotName;

// Function ShortcutSlotName.ShortcutSlotName_C.Setup
// 0x0018 (0x0018 - 0x0000)
struct ShortcutSlotName_C_Setup final
{
public:
	class FText                                   CallFunc_GetSlotName_output;                       // 0x0000(0x0018)()
};
DUMPER7_ASSERTS_ShortcutSlotName_C_Setup;

// Function ShortcutSlotName.ShortcutSlotName_C.UpdateSlotName
// 0x0030 (0x0030 - 0x0000)
struct ShortcutSlotName_C_UpdateSlotName final
{
public:
	class FText                                   text;                                              // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetSlotName_output;                       // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_ShortcutSlotName_C_UpdateSlotName;

}

