#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShortcutSet

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function ShortcutSet.ShortcutSet_C.ExecuteUbergraph_ShortcutSet
// 0x0038 (0x0038 - 0x0000)
struct ShortcutSet_C_ExecuteUbergraph_ShortcutSet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue1;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShortcutSet_C_ExecuteUbergraph_ShortcutSet;

// Function ShortcutSet.ShortcutSet_C.SetItemInfo
// 0x00F0 (0x00F0 - 0x0000)
struct ShortcutSet_C_SetItemInfo final
{
public:
	struct FPBItemCatalogData                     Item;                                              // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FPBItemCatalogData                     NewLocalVar_0;                                     // 0x0078(0x0078)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShortcutSet_C_SetItemInfo;

// Function ShortcutSet.ShortcutSet_C.SetListCursor
// 0x0001 (0x0001 - 0x0000)
struct ShortcutSet_C_SetListCursor final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShortcutSet_C_SetListCursor;

// Function ShortcutSet.ShortcutSet_C.GetInputText
// 0x0030 (0x0030 - 0x0000)
struct ShortcutSet_C_GetInputText final
{
public:
	class FText                                   Output;                                            // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetInputText_Text;                        // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_ShortcutSet_C_GetInputText;

// Function ShortcutSet.ShortcutSet_C.GetItemName
// 0x0030 (0x0030 - 0x0000)
struct ShortcutSet_C_GetItemName final
{
public:
	class FText                                   Output;                                            // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_GetInputText_Text;                        // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_ShortcutSet_C_GetItemName;

// Function ShortcutSet.ShortcutSet_C.InputTextActivate
// 0x0030 (0x0030 - 0x0000)
struct ShortcutSet_C_InputTextActivate final
{
public:
	class FText                                   txt;                                               // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetCommitedText_output;                   // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_ShortcutSet_C_InputTextActivate;

// Function ShortcutSet.ShortcutSet_C.SetInputText
// 0x0030 (0x0030 - 0x0000)
struct ShortcutSet_C_SetInputText final
{
public:
	class FText                                   Input;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   txt;                                               // 0x0018(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_ShortcutSet_C_SetInputText;

// Function ShortcutSet.ShortcutSet_C.SetItemName
// 0x0030 (0x0030 - 0x0000)
struct ShortcutSet_C_SetItemName final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   text;                                              // 0x0018(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_ShortcutSet_C_SetItemName;

// Function ShortcutSet.ShortcutSet_C.SetTextColor
// 0x0050 (0x0050 - 0x0000)
struct ShortcutSet_C_SetTextColor final
{
public:
	struct FSlateColor                            Input;                                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateColor                            Color;                                             // 0x0028(0x0028)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_ShortcutSet_C_SetTextColor;

}

