#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillSetWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIScroll_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SkillSetWindow.SkillSetWindow_C
// 0x0050 (0x02F8 - 0x02A8)
class USkillSetWindow_C final : public UUIScroll_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_SkillSetWindow_C;                   // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Base;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollView;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TabSkill;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   SendShardInfomation;                               // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Index_0;                                           // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkillSet_C*>                    SkillLists;                                        // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_SkillSetWindow(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void Initialize();
	void Setup();
	void Clean();
	void Refresh();
	void AddList(const class USkillSet_C*& Content);
	void GetList(int32 Param_Index_0, class USkillSet_C** Output);
	void GetSelectList(class USkillSet_C** Output);
	void UpdateScroll();
	void MoveCursor(int32 Move, class USkillSet_C** Output);
	void UpdateDescription(class UCommonMenuInformation_C* ref_info);
	void ListScroll(int32 Param_Index_0);
	void InitializeScrollAtCurrentIndex();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SkillSetWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SkillSetWindow_C")
	}
	static class USkillSetWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkillSetWindow_C>();
	}
};
DUMPER7_ASSERTS_USkillSetWindow_C;

}

