#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StartupSelecter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StartupSelecter.StartupSelecter_C
// 0x0120 (0x0398 - 0x0278)
class UStartupSelecter_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Close;                                             // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonAnimationArrow_C*                ArrowL;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonAnimationArrow_C*                ArrowR;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollView;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventMenuOpened;                                   // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventMenuClosed;                                   // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UDifficultSelecter_C*                   DifficulityMenu;                                   // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerCharaSelecter_C*                 CharacterMenu;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Top;                                               // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LAST;                                              // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           MenuStep;                                          // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UEntryNameSetter_C*                     EntryNameMenu;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventEntryNameCanceled;                            // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventEntryNameDecided;                             // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCommonControllGuide_C*                 UIGuide;                                           // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventEntryNameConfirmed;                           // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventBackerIDCanceled;                             // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventBackerIDDecided;                              // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventBackerIDConfirmed;                            // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventGameStart;                                    // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBackerIDSetMenu_C*                     BackerIDMenu;                                      // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventUpdateSpeedRunRecordDisplay;                  // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class URandomizerSelecter_C*                  RandomizerMenu;                                    // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StartupSelecter(int32 EntryPoint);
	void Destruct();
	void OnPressedButton();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void Construct();
	void WidgetAnimationEvt_close_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_open_K2Node_WidgetAnimationEvent_0();
	void BndEvt__ScrollView_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(float CurrentOffset);
	void RemoveAll();
	void DifficultySelectionChanged();
	void SetupDifficultySelectionChanged();
	void DifficultySelectDecided();
	void SetupDifficultySelectDecided();
	void DifficultySelectCanceled();
	void SetupEventDifficultySelectCanceled();
	void SetupDifficultySelecter();
	void CharacterSelecterCanceled();
	void CharacterSelecterDecided();
	void SetupCharacterSelecterCanceled();
	void SetupCharacterSelecterDecided();
	void SetupCharacterSelecter();
	void SetupRandomizerSelecter();
	void EntryNameConfirmed();
	void EntryNameCanceled();
	void EntryNameDecided();
	void SetupEntryNameDecided();
	void SetupEntryNameSetter();
	void OpenBackerIDSetMenu();
	void RandomizerSelectChanged();
	void SetupRandomizerSelectChanged();
	void RandomizerSelectDecided();
	void SetupRandomizerSelectDecided();
	void RandomizerSelectCancelled();
	void SetupEventRandomizerSelectCancelled();
	void Initialize();
	void Setup();
	void OnStart();
	void OnActive();
	void OnScrollEnd();
	void AddSelecter(class UWidget* add_list);
	class UWidget* GetSelecter(int32 Param_Index_0);
	void OpenSelecter();
	void CloseSelecter();
	void SwitchSelecter(int32 move_val);
	void AddMenuStep(class FName input_step);
	void GetMenuStep(int32 Param_Index_0, class FName* Output);
	void UpdateArrow();
	void IsTopMenu(bool is_true, bool* isEnable);
	void IsLastMenu(bool is_true, bool* isEnable);
	void SetupControlllGuide(class UCommonControllGuide_C*& Input);
	void Activate();
	void ActivateMenu();
	void InactivateMenu();
	void BackToMenu();
	void ResetPlayerName();
	void PrevStep();
	void NextStep();
	void GetSelectedDifficulty(EPBGameLevel* SelectedDifficulty);
	void GetSelectedPlayerType(EPBGameModePlayer* SelectedPlayerType);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("StartupSelecter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StartupSelecter_C")
	}
	static class UStartupSelecter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStartupSelecter_C>();
	}
};
DUMPER7_ASSERTS_UStartupSelecter_C;

}

