#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StartupSelectMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StartupSelectMenu.StartupSelectMenu_C
// 0x0040 (0x0298 - 0x0258)
class UStartupSelectMenu_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUICommonFreeWindow_C*                  back;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             MenuLIst;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBlockTitle_C*                    TitleBlock;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0278(0x0018)(Edit, BlueprintVisible)
	int32                                         Top;                                               // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LAST;                                              // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StartupSelectMenu(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void AddWidght(class UWidget* add_list);
	void GetListIndex(int32 Index_0, int32* NewParam);
	class UWidget* GetWidght(int32 Index_0);
	void Initialize();
	void SetListIndex(int32 Index_0, int32 move_val, int32* return_0);
	void SetTitleText(const class FText& in_Title);
	void Setup();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("StartupSelectMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StartupSelectMenu_C")
	}
	static class UStartupSelectMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStartupSelectMenu_C>();
	}
};
DUMPER7_ASSERTS_UStartupSelectMenu_C;

}

