#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: State_SpawnEffect_Wand

#include "Basic.hpp"

#include "ProjectBlood_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass State_SpawnEffect_Wand.State_SpawnEffect_Wand_C
// 0x0018 (0x0060 - 0x0048)
class UState_SpawnEffect_Wand_C final : public UPBAnimNotifyState
{
public:
	class FName                                   SocketName;                                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGlobal;                                          // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsAttach;                                          // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BeginScale;                                        // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndScale;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SclaeDuration;                                     // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class FString GetNotifyName() const;
	bool PBNotifyBeginWithCharacter(class APBBaseCharacter* Character, class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration) const;
	bool PBNotifyEndWithCharacter(class APBBaseCharacter* Character, class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("State_SpawnEffect_Wand_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"State_SpawnEffect_Wand_C")
	}
	static class UState_SpawnEffect_Wand_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UState_SpawnEffect_Wand_C>();
	}
};
DUMPER7_ASSERTS_UState_SpawnEffect_Wand_C;

}

