#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Step_P0000

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ESubSubStep_structs.hpp"
#include "ESubStep_structs.hpp"
#include "EPB_P0000_TransformationType_structs.hpp"
#include "EPB_PlayerCtr_FloatParameterType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EPB_MagicCircleType_structs.hpp"
#include "PB_ST_ShardChangeInfo_structs.hpp"
#include "EPB_NewOld_structs.hpp"
#include "EPB_PlayerStance_structs.hpp"
#include "EPB_DamageIgnoreType_structs.hpp"
#include "EPB_AutoresetBool_structs.hpp"
#include "EPB_PlayerInfoVectorType_structs.hpp"
#include "EPB_P0000_GunDamageType_structs.hpp"
#include "EPB_PlayerInfoBoolType_structs.hpp"
#include "EPB_AttackStance_structs.hpp"
#include "Engine_structs.hpp"
#include "EPB_ActionRequestCategory_structs.hpp"
#include "EPB_N1011_EnchantType_structs.hpp"
#include "EPB_ExecCommandType_structs.hpp"
#include "PB_ST_ShardInfo_structs.hpp"
#include "EPB_DamageType_structs.hpp"
#include "EPB_StartLoopEnd_structs.hpp"
#include "EPB_P0000CameraMode_structs.hpp"


namespace SDK::Params
{

// Function Step_P0000.Step_P0000_C.Aim_CalcAimDirection
// 0x000C (0x000C - 0x0000)
struct Step_P0000_C_Aim_CalcAimDirection final
{
public:
	struct FRotator                               bpp__Rotation__pf;                                 // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Aim_CalcAimDirection;

// Function Step_P0000.Step_P0000_C.Aim_GetAimProjection
// 0x000C (0x000C - 0x0000)
struct Step_P0000_C_Aim_GetAimProjection final
{
public:
	struct FVector                                bpp__Vector__pf;                                   // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Aim_GetAimProjection;

// Function Step_P0000.Step_P0000_C.Aim_IsAimImput
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_Aim_IsAimImput final
{
public:
	bool                                          bpp__IsEnable__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Aim_IsAimImput;

// Function Step_P0000.Step_P0000_C.Aim_IsEnableAim
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_Aim_IsEnableAim final
{
public:
	bool                                          bpp__IsEnable__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Aim_IsEnableAim;

// Function Step_P0000.Step_P0000_C.AimIsFly
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_AimIsFly final
{
public:
	bool                                          bpp__IsAim__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_AimIsFly;

// Function Step_P0000.Step_P0000_C.AquaStreamProcessWall
// 0x0018 (0x0018 - 0x0000)
struct Step_P0000_C_AquaStreamProcessWall final
{
public:
	struct FVector                                bpp__InVelocity__pf;                               // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__OutVelocity__pf;                              // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_AquaStreamProcessWall;

// Function Step_P0000.Step_P0000_C.AutoRecoverStatusProcess
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_AutoRecoverStatusProcess final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_AutoRecoverStatusProcess;

// Function Step_P0000.Step_P0000_C.Calc_DamageBlast
// 0x0018 (0x0018 - 0x0000)
struct Step_P0000_C_Calc_DamageBlast final
{
public:
	bool                                          bpp__IsFlyingAllowed__pf;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__DamageDestiny__pf;                            // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFront__pf;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFly__pf;                                    // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__InitSpeed__pf;                                // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Calc_DamageBlast;

// Function Step_P0000.Step_P0000_C.Calc_JumpSpeed
// 0x0004 (0x0004 - 0x0000)
struct Step_P0000_C_Calc_JumpSpeed final
{
public:
	float                                         bpp__Speed__pf;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Calc_JumpSpeed;

// Function Step_P0000.Step_P0000_C.CalcNoticeVarious
// 0x0002 (0x0002 - 0x0000)
struct Step_P0000_C_CalcNoticeVarious final
{
public:
	EStepNotice                                   bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_CalcNoticeVarious;

// Function Step_P0000.Step_P0000_C.CalcWaterSurfaceSlowdown
// 0x0008 (0x0008 - 0x0000)
struct Step_P0000_C_CalcWaterSurfaceSlowdown final
{
public:
	float                                         bpp__InValue__pf;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__OutValue__pf;                                 // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_CalcWaterSurfaceSlowdown;

// Function Step_P0000.Step_P0000_C.Camera_InitCamera
// 0x0002 (0x0002 - 0x0000)
struct Step_P0000_C_Camera_InitCamera final
{
public:
	EPB_P0000CameraMode                           bpp__CameraMode__pf;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Camera_InitCamera;

// Function Step_P0000.Step_P0000_C.Camera_UpdatePianoCamera
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_Camera_UpdatePianoCamera final
{
public:
	bool                                          bpp__IsFinish__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Camera_UpdatePianoCamera;

// Function Step_P0000.Step_P0000_C.CanDeadFly
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_CanDeadFly final
{
public:
	bool                                          bpp__DeadFlyingAllowed__pf;                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_CanDeadFly;

// Function Step_P0000.Step_P0000_C.CanExecRemoteStep
// 0x0002 (0x0002 - 0x0000)
struct Step_P0000_C_CanExecRemoteStep final
{
public:
	EPBStep                                       bpp__RemoteStep__pf;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__CanExec__pf;                                  // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_CanExecRemoteStep;

// Function Step_P0000.Step_P0000_C.ChangeWeaponCallback
// 0x0010 (0x0010 - 0x0000)
struct Step_P0000_C_ChangeWeaponCallback final
{
public:
	ECarriedCatalog                               bpp__EquipCategory__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsActive__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__ItemId__pf;                                   // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_P0000_C_ChangeWeaponCallback;

// Function Step_P0000.Step_P0000_C.CheckConsumeMPBySpecialArts
// 0x0002 (0x0002 - 0x0000)
struct Step_P0000_C_CheckConsumeMPBySpecialArts final
{
public:
	EWpnSPEntry                                   bpp__ArtsID__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsValid__pf;                                  // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_CheckConsumeMPBySpecialArts;

// Function Step_P0000.Step_P0000_C.CheckGroundAdvenceDirection
// 0x0014 (0x0014 - 0x0000)
struct Step_P0000_C_CheckGroundAdvenceDirection final
{
public:
	float                                         bpp__Distance__pf;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsHit__pf;                                    // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__HitPosition__pf;                              // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_CheckGroundAdvenceDirection;

// Function Step_P0000.Step_P0000_C.CheckLoopAttack
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_CheckLoopAttack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_CheckLoopAttack;

// Function Step_P0000.Step_P0000_C.CheckShardMP
// 0x0002 (0x0002 - 0x0000)
struct Step_P0000_C_CheckShardMP final
{
public:
	EShardType                                    bpp__ShardType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsOK__pf;                                     // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_CheckShardMP;

// Function Step_P0000.Step_P0000_C.CheckSyncWeapon
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_CheckSyncWeapon final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_CheckSyncWeapon;

// Function Step_P0000.Step_P0000_C.ChrCntroler_SetBool
// 0x0008 (0x0008 - 0x0000)
struct Step_P0000_C_ChrCntroler_SetBool final
{
public:
	int32                                         bpp__Index__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_P0000_C_ChrCntroler_SetBool;

// Function Step_P0000.Step_P0000_C.ChrControler_ExecCommand
// 0x000C (0x000C - 0x0000)
struct Step_P0000_C_ChrControler_ExecCommand final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_P0000_C_ChrControler_ExecCommand;

// Function Step_P0000.Step_P0000_C.ChrControler_IsBattleReady
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_ChrControler_IsBattleReady final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_ChrControler_IsBattleReady;

// Function Step_P0000.Step_P0000_C.ChrControler_SetIsBattleReady
// 0x0002 (0x0002 - 0x0000)
struct Step_P0000_C_ChrControler_SetIsBattleReady final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_ChrControler_SetIsBattleReady;

// Function Step_P0000.Step_P0000_C.ChrCtr_GetVectorValue
// 0x0010 (0x0010 - 0x0000)
struct Step_P0000_C_ChrCtr_GetVectorValue final
{
public:
	int32                                         bpp__Index__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Vectorvalue__pf;                              // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_ChrCtr_GetVectorValue;

// Function Step_P0000.Step_P0000_C.ChrCtr_SetFloatValue
// 0x0010 (0x0010 - 0x0000)
struct Step_P0000_C_ChrCtr_SetFloatValue final
{
public:
	class FName                                   bpp__Type__pf;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Value__pf;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__return__pf;                                   // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_ChrCtr_SetFloatValue;

// Function Step_P0000.Step_P0000_C.ConsumeMPByShardID
// 0x000C (0x000C - 0x0000)
struct Step_P0000_C_ConsumeMPByShardID final
{
public:
	class FName                                   bpp__ShardID__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsValid__pf;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_P0000_C_ConsumeMPByShardID;

// Function Step_P0000.Step_P0000_C.ConsumeMPByShardType
// 0x0002 (0x0002 - 0x0000)
struct Step_P0000_C_ConsumeMPByShardType final
{
public:
	EShardType                                    bpp__ShardType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsValid__pf;                                  // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_ConsumeMPByShardType;

// Function Step_P0000.Step_P0000_C.ConsumeMPBySpecialArts
// 0x0002 (0x0002 - 0x0000)
struct Step_P0000_C_ConsumeMPBySpecialArts final
{
public:
	EWpnSPEntry                                   bpp__ArtsID__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsValid__pf;                                  // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_ConsumeMPBySpecialArts;

// Function Step_P0000.Step_P0000_C.ConsumeShardMP
// 0x000C (0x000C - 0x0000)
struct Step_P0000_C_ConsumeShardMP final
{
public:
	class FName                                   bpp__ShardID__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_P0000_C_ConsumeShardMP;

// Function Step_P0000.Step_P0000_C.ConvertTypeEquipToCarrige
// 0x0002 (0x0002 - 0x0000)
struct Step_P0000_C_ConvertTypeEquipToCarrige final
{
public:
	EPBEquipModelType                             bpp__EquipType__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               bpp__CarriedType__pf;                              // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_ConvertTypeEquipToCarrige;

// Function Step_P0000.Step_P0000_C.DealDamageInfo
// 0x0028 (0x0028 - 0x0000)
struct Step_P0000_C_DealDamageInfo final
{
public:
	class FName                                   bpp__DamageID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsHit__pf;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBBloodColor                                 bpp__BaseColor__pf;                                // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__DamageValue__pf;                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APB_Chr_Root_C*                         bpp__ChrIns__pf;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__HitWorldLocation__pf;                         // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_P0000_C_DealDamageInfo;

// Function Step_P0000.Step_P0000_C.Directional_IsAqualStreaming
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_Directional_IsAqualStreaming final
{
public:
	bool                                          bpp__IsNow__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Directional_IsAqualStreaming;

// Function Step_P0000.Step_P0000_C.Directional_IsDimensionShiftOK
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_Directional_IsDimensionShiftOK final
{
public:
	bool                                          bpp__IsNow__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Directional_IsDimensionShiftOK;

// Function Step_P0000.Step_P0000_C.DirectionalShard_CommonUpdate
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_DirectionalShard_CommonUpdate final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_DirectionalShard_CommonUpdate;

// Function Step_P0000.Step_P0000_C.DirectionalShard_HoldUpdate
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_DirectionalShard_HoldUpdate final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_DirectionalShard_HoldUpdate;

// Function Step_P0000.Step_P0000_C.DirectionalShard_SelectExecute
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_DirectionalShard_SelectExecute final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_DirectionalShard_SelectExecute;

// Function Step_P0000.Step_P0000_C.DirectionalShard_TriggerUpdate
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_DirectionalShard_TriggerUpdate final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_DirectionalShard_TriggerUpdate;

// Function Step_P0000.Step_P0000_C.DShard_IsDirectionalHold
// 0x0002 (0x0002 - 0x0000)
struct Step_P0000_C_DShard_IsDirectionalHold final
{
public:
	bool                                          bpp__IsHoldMP__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsHoldType__pf;                               // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_DShard_IsDirectionalHold;

// Function Step_P0000.Step_P0000_C.DShard_IsDirectionalSharding
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_DShard_IsDirectionalSharding final
{
public:
	bool                                          bpp__IsSharding__pf;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_DShard_IsDirectionalSharding;

// Function Step_P0000.Step_P0000_C.EndFacialMotion
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_EndFacialMotion final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_EndFacialMotion;

// Function Step_P0000.Step_P0000_C.EndFamiliarMagicCircle
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_EndFamiliarMagicCircle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_EndFamiliarMagicCircle;

// Function Step_P0000.Step_P0000_C.EndMagicCircleEffect
// 0x0010 (0x0010 - 0x0000)
struct Step_P0000_C_EndMagicCircleEffect final
{
public:
	class FName                                   bpp__RegistKey__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Duration__pf;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsKillNow__pf;                                // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_P0000_C_EndMagicCircleEffect;

// Function Step_P0000.Step_P0000_C.EquipSimulateEnchantShardNotify
// 0x0014 (0x0014 - 0x0000)
struct Step_P0000_C_EquipSimulateEnchantShardNotify final
{
public:
	class FName                                   bpp__ShardID__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Grade__pf;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Rank__pf;                                     // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_P0000_C_EquipSimulateEnchantShardNotify;

// Function Step_P0000.Step_P0000_C.EquipSimulateNotify
// 0x000C (0x000C - 0x0000)
struct Step_P0000_C_EquipSimulateNotify final
{
public:
	class FName                                   bpp__EquipId__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               bpp__CatalogType__pf;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_P0000_C_EquipSimulateNotify;

// Function Step_P0000.Step_P0000_C.EquipSkill
// 0x000C (0x000C - 0x0000)
struct Step_P0000_C_EquipSkill final
{
public:
	class FName                                   bpp__SkillName__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__HasSkill__pf;                                 // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_P0000_C_EquipSkill;

// Function Step_P0000.Step_P0000_C.Exec_AnimEnd
// 0x000C (0x000C - 0x0000)
struct Step_P0000_C_Exec_AnimEnd final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Duration__pf;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_AnimEnd;

// Function Step_P0000.Step_P0000_C.Exec_Attached
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_Attached final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_Attached;

// Function Step_P0000.Step_P0000_C.Exec_AttachedStop
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_AttachedStop final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_AttachedStop;

// Function Step_P0000.Step_P0000_C.Exec_Attack
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_Attack final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_Attack;

// Function Step_P0000.Step_P0000_C.Exec_BackMove
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_BackMove final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_BackMove;

// Function Step_P0000.Step_P0000_C.Exec_BackStep
// 0x0006 (0x0006 - 0x0000)
struct Step_P0000_C_Exec_BackStep final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsConsiderStepTimer__pf;                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_BackStep;

// Function Step_P0000.Step_P0000_C.Exec_BookRead
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_BookRead final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_BookRead;

// Function Step_P0000.Step_P0000_C.Exec_Captured
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_Captured final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_Captured;

// Function Step_P0000.Step_P0000_C.Exec_Chair
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_Chair final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_Chair;

// Function Step_P0000.Step_P0000_C.Exec_ChairDamage
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_Exec_ChairDamage final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_ChairDamage;

// Function Step_P0000.Step_P0000_C.Exec_ChairStop
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_ChairStop final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_ChairStop;

// Function Step_P0000.Step_P0000_C.Exec_CrouchEnd
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_CrouchEnd final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_CrouchEnd;

// Function Step_P0000.Step_P0000_C.Exec_CrouchEndEx
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_Exec_CrouchEndEx final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_CrouchEndEx;

// Function Step_P0000.Step_P0000_C.Exec_CrouchStart
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_CrouchStart final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_CrouchStart;

// Function Step_P0000.Step_P0000_C.Exec_CrouchTurn
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_CrouchTurn final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_CrouchTurn;

// Function Step_P0000.Step_P0000_C.Exec_Damage
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_Exec_Damage final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_Damage;

// Function Step_P0000.Step_P0000_C.Exec_DamageFromOuter
// 0x0014 (0x0014 - 0x0000)
struct Step_P0000_C_Exec_DamageFromOuter final
{
public:
	float                                         bpp__Distance__pf;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Dir__pf;                                      // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_DamageFromOuter;

// Function Step_P0000.Step_P0000_C.Exec_Dead
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_Dead final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_Dead;

// Function Step_P0000.Step_P0000_C.Exec_DirectionalShard
// 0x0006 (0x0006 - 0x0000)
struct Step_P0000_C_Exec_DirectionalShard final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsNotDefaultTrans__pf;                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_DirectionalShard;

// Function Step_P0000.Step_P0000_C.Exec_DirectionalShardStop
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_DirectionalShardStop final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_DirectionalShardStop;

// Function Step_P0000.Step_P0000_C.Exec_Event_VIL_003
// 0x0001 (0x0001 - 0x0000)
struct Step_P0000_C_Exec_Event_VIL_003 final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_Event_VIL_003;

// Function Step_P0000.Step_P0000_C.Exec_Fall
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_Fall final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_P0000_C_Exec_Fall;

// Function Step_P0000.Step_P0000_C.Exec_ForceCrouchStart
// 0x0005 (0x0005 - 0x0000)
struct Step_P0000_C_Exec_ForceCrouchStart final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
