#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Step_Root

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ESubSubStep_structs.hpp"
#include "PB_ST_AfterAnimationInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ESubStep_structs.hpp"
#include "Engine_structs.hpp"
#include "PBST_AfterImageInfo_structs.hpp"
#include "EPB_ExecCommonList_structs.hpp"
#include "EPB_LandType_structs.hpp"


namespace SDK::Params
{

// Function Step_Root.Step_Root_C.ActionPlanning
// 0x001C (0x001C - 0x0000)
struct Step_Root_C_ActionPlanning final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__CoolTime__pf;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Interval__pf;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Min__pf;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Max__pf;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__TransTime__pf;                                // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsScreenOut__pf;                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_Root_C_ActionPlanning;

// Function Step_Root.Step_Root_C.ActionPlanningByHate
// 0x0010 (0x0010 - 0x0000)
struct Step_Root_C_ActionPlanningByHate final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__RandomPercent__pf;                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__HateLimit__pf;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsScreenOut__pf;                              // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsReset__pf;                                  // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x000E(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_Root_C_ActionPlanningByHate;

// Function Step_Root.Step_Root_C.ActionPlanningManager
// 0x0024 (0x0024 - 0x0000)
struct Step_Root_C_ActionPlanningManager final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__CoolTime__pf;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Interval__pf;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Min__pf;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Max__pf;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__TransTime__pf;                                // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__RandomPercent__pf;                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__HateLimitPercent__pf;                         // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsScreenOut__pf;                              // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IfAnd__pf;                                    // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0022(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_Root_C_ActionPlanningManager;

// Function Step_Root.Step_Root_C.ActionPlanningOnScreenCheck
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_ActionPlanningOnScreenCheck final
{
public:
	bool                                          bpp__OnScreen__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_ActionPlanningOnScreenCheck;

// Function Step_Root.Step_Root_C.AdjustLandPosition
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_AdjustLandPosition final
{
public:
	EPB_LandType                                  bpp__LandType__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_AdjustLandPosition;

// Function Step_Root.Step_Root_C.BossShardGetTimming
// 0x000C (0x000C - 0x0000)
struct Step_Root_C_BossShardGetTimming final
{
public:
	class FName                                   bpp__ShardID__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_Root_C_BossShardGetTimming;

// Function Step_Root.Step_Root_C.Check_Attack
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Check_Attack final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Check_Attack;

// Function Step_Root.Step_Root_C.Check_CollisionObject
// 0x0010 (0x0010 - 0x0000)
struct Step_Root_C_Check_CollisionObject final
{
public:
	class UPBCollisionObject*                     bpp__InputCollisionObject__pf;                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_Root_C_Check_CollisionObject;

// Function Step_Root.Step_Root_C.CHECK_DAMAGE
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_CHECK_DAMAGE final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_CHECK_DAMAGE;

// Function Step_Root.Step_Root_C.Check_Dash
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Check_Dash final
{
public:
	bool                                          bpp__IsDead__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Check_Dash;

// Function Step_Root.Step_Root_C.Check_Dead
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Check_Dead final
{
public:
	bool                                          bpp__IsDead__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Check_Dead;

// Function Step_Root.Step_Root_C.Check_Evasion
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Check_Evasion final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Check_Evasion;

// Function Step_Root.Step_Root_C.Check_Fall
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Check_Fall final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Check_Fall;

// Function Step_Root.Step_Root_C.Check_Jump
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Check_Jump final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Check_Jump;

// Function Step_Root.Step_Root_C.Check_Land
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Check_Land final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Check_Land;

// Function Step_Root.Step_Root_C.Check_Move
// 0x0018 (0x0018 - 0x0000)
struct Step_Root_C_Check_Move final
{
public:
	int32                                         bpp__FrontBlock__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__BackBlock__pf;                                // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MinDist__pf;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MaxDist__pf;                                  // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__LimitMinDist__pf;                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsMove__pf;                                   // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFront__pf;                                  // 0x0015(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_Root_C_Check_Move;

// Function Step_Root.Step_Root_C.Check_MoveStop
// 0x001C (0x001C - 0x0000)
struct Step_Root_C_Check_MoveStop final
{
public:
	float                                         bpp__ReachDist__pf;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__CheckBlock__pf;                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__CheckBlockInterval__pf;                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__WallDist__pf;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__CliffDist__pf;                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsScreenOut__pf;                              // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsReach__pf;                                  // 0x0015(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFinishDuration__pf;                         // 0x0016(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsWall__pf;                                   // 0x0017(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsCliff__pf;                                  // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_Root_C_Check_MoveStop;

// Function Step_Root.Step_Root_C.Check_NotActive
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Check_NotActive final
{
public:
	bool                                          bpp__IsDead__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Check_NotActive;

// Function Step_Root.Step_Root_C.Check_RealDamage
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Check_RealDamage final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Check_RealDamage;

// Function Step_Root.Step_Root_C.Check_Template
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Check_Template final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Check_Template;

// Function Step_Root.Step_Root_C.Check_Turn
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Check_Turn final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Check_Turn;

// Function Step_Root.Step_Root_C.Check_WinceDamage
// 0x0008 (0x0008 - 0x0000)
struct Step_Root_C_Check_WinceDamage final
{
public:
	float                                         bpp__WinceDamage__pf;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_Root_C_Check_WinceDamage;

// Function Step_Root.Step_Root_C.CheckBarrier
// 0x001C (0x001C - 0x0000)
struct Step_Root_C_CheckBarrier final
{
public:
	int32                                         bpp__Block__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Position__pf;                                 // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__WallDist__pf;                                 // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__CliffDist__pf;                                // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSuccess__pf;                                // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_Root_C_CheckBarrier;

// Function Step_Root.Step_Root_C.CheckBlock
// 0x0018 (0x0018 - 0x0000)
struct Step_Root_C_CheckBlock final
{
public:
	int32                                         bpp__FrontBlock__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__BackBlock__pf;                                // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__FrontDistance__pf;                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFront__pf;                                  // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__BackDistance__pf;                             // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsBack__pf;                                   // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_Root_C_CheckBlock;

// Function Step_Root.Step_Root_C.ClearDelayCallBackBuffer
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_ClearDelayCallBackBuffer final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_ClearDelayCallBackBuffer;

// Function Step_Root.Step_Root_C.ConstructFunction
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_ConstructFunction final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_ConstructFunction;

// Function Step_Root.Step_Root_C.ConstructObject
// 0x0020 (0x0020 - 0x0000)
struct Step_Root_C_ConstructObject final
{
public:
	class UOBJ_Root_C*                            bpp__Object__pf;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 bpp__Class__pf;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsForceConstruct__pf;                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOBJ_Root_C*                            bpp__UObject__pf;                                  // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_ConstructObject;

// Function Step_Root.Step_Root_C.ConvertSplineToWorld
// 0x0018 (0x0018 - 0x0000)
struct Step_Root_C_ConvertSplineToWorld final
{
public:
	struct FVector                                bpp__SplineLocation__pf;                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__WorldLocation__pf;                            // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_ConvertSplineToWorld;

// Function Step_Root.Step_Root_C.ConvertWorldToSpline
// 0x0018 (0x0018 - 0x0000)
struct Step_Root_C_ConvertWorldToSpline final
{
public:
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SplineLocation__pf;                           // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_ConvertWorldToSpline;

// Function Step_Root.Step_Root_C.Debug_UpdatePrestep
// 0x0002 (0x0002 - 0x0000)
struct Step_Root_C_Debug_UpdatePrestep final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Debug_UpdatePrestep;

// Function Step_Root.Step_Root_C.DebugPrestepProcess
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_DebugPrestepProcess final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_DebugPrestepProcess;

// Function Step_Root.Step_Root_C.DelayCallBack
// 0x0030 (0x0030 - 0x0000)
struct Step_Root_C_DelayCallBack final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__DelayTime__pf;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__VectorParam__pf;                              // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__VectorParam2__pf;                             // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__NameValue__pf;                                // 0x0024(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__IntValue__pf;                                 // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_DelayCallBack;

// Function Step_Root.Step_Root_C.DrawLine
// 0x0034 (0x0034 - 0x0000)
struct Step_Root_C_DrawLine final
{
public:
	struct FVector                                bpp__LineStartWorldLocation__pf;                   // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__LineEndWorldLocation__pf;                     // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           bpp__LineColor__pf;                                // 0x0018(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Duration__pf;                                 // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Thickness__pf;                                // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_Root_C_DrawLine;

// Function Step_Root.Step_Root_C.DrawSphere
// 0x0014 (0x0014 - 0x0000)
struct Step_Root_C_DrawSphere final
{
public:
	struct FVector                                bpp__Position__pf;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Size__pf;                                     // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Duration__pf;                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_DrawSphere;

// Function Step_Root.Step_Root_C.EndPlayCallBack
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_EndPlayCallBack final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_EndPlayCallBack;

// Function Step_Root.Step_Root_C.Enter_AreaWarp
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_AreaWarp final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_AreaWarp;

// Function Step_Root.Step_Root_C.Enter_Attack
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Attack final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Attack;

// Function Step_Root.Step_Root_C.Enter_AttackFly
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_AttackFly final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_AttackFly;

// Function Step_Root.Step_Root_C.Enter_AttackLoop
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_AttackLoop final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_AttackLoop;

// Function Step_Root.Step_Root_C.Enter_BackMove
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_BackMove final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_BackMove;

// Function Step_Root.Step_Root_C.Enter_BackStep
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_BackStep final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_BackStep;

// Function Step_Root.Step_Root_C.Enter_Crouch
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Crouch final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Crouch;

// Function Step_Root.Step_Root_C.Enter_Damage
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Damage final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Damage;

// Function Step_Root.Step_Root_C.Enter_Dash
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Dash final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Dash;

// Function Step_Root.Step_Root_C.Enter_Dead
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Dead final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Dead;

// Function Step_Root.Step_Root_C.Enter_DemoFall
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_DemoFall final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_DemoFall;

// Function Step_Root.Step_Root_C.Enter_DemoIdle
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_DemoIdle final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_DemoIdle;

// Function Step_Root.Step_Root_C.Enter_DemoLand
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_DemoLand final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_DemoLand;

// Function Step_Root.Step_Root_C.Enter_DemoMove
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_DemoMove final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_DemoMove;

// Function Step_Root.Step_Root_C.Enter_DemoTurn
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_DemoTurn final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_DemoTurn;

// Function Step_Root.Step_Root_C.Enter_DimensionShift
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_DimensionShift final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_DimensionShift;

// Function Step_Root.Step_Root_C.Enter_DirectionalShard
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_DirectionalShard final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_DirectionalShard;

// Function Step_Root.Step_Root_C.Enter_Enchant
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Enchant final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Enchant;

// Function Step_Root.Step_Root_C.Enter_Evasion
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Evasion final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Evasion;

// Function Step_Root.Step_Root_C.Enter_Event
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Event final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Event;

// Function Step_Root.Step_Root_C.Enter_Fall
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Fall final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Fall;

// Function Step_Root.Step_Root_C.Enter_Fly
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Fly final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Fly;

// Function Step_Root.Step_Root_C.Enter_Grab
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Grab final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Grab;

// Function Step_Root.Step_Root_C.Enter_Grabbed
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Grabbed final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Grabbed;

// Function Step_Root.Step_Root_C.Enter_Idle
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Idle final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Idle;

// Function Step_Root.Step_Root_C.Enter_Init
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Init final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Init;

// Function Step_Root.Step_Root_C.Enter_Invert
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Invert final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Invert;

// Function Step_Root.Step_Root_C.Enter_Jump
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Jump final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Jump;

// Function Step_Root.Step_Root_C.Enter_JumpKick
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_JumpKick final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_JumpKick;

// Function Step_Root.Step_Root_C.Enter_Land
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Land final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Land;

// Function Step_Root.Step_Root_C.Enter_Move
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Move final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Move;

// Function Step_Root.Step_Root_C.Enter_Normal
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Normal final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Normal;

// Function Step_Root.Step_Root_C.Enter_NotActive
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_NotActive final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_NotActive;

// Function Step_Root.Step_Root_C.Enter_Planning
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Planning final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Planning;

// Function Step_Root.Step_Root_C.Enter_Reflection
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Reflection final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Reflection;

// Function Step_Root.Step_Root_C.Enter_Sliding
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Sliding final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Sliding;

// Function Step_Root.Step_Root_C.Enter_SpecialArts
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_SpecialArts final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_SpecialArts;

// Function Step_Root.Step_Root_C.Enter_SpecialPose
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_SpecialPose final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_SpecialPose;

// Function Step_Root.Step_Root_C.Enter_Stone
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Stone final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Stone;

// Function Step_Root.Step_Root_C.Enter_Template
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Template final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Template;

// Function Step_Root.Step_Root_C.Enter_TriggerShard
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_TriggerShard final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_TriggerShard;

// Function Step_Root.Step_Root_C.Enter_Turn
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Turn final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Turn;

// Function Step_Root.Step_Root_C.Enter_Uncontrol
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Uncontrol final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Uncontrol;

// Function Step_Root.Step_Root_C.Enter_Unique
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Unique final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Unique;

// Function Step_Root.Step_Root_C.Enter_Warp
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_Warp final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_Warp;

// Function Step_Root.Step_Root_C.Enter_WaterFly
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Enter_WaterFly final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Enter_WaterFly;

// Function Step_Root.Step_Root_C.EnterStep
// 0x0003 (0x0003 - 0x0000)
struct Step_Root_C_EnterStep final
{
public:
	EPBStep                                       bpp__Old__pf;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__New__pf;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Is__pf;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_EnterStep;

// Function Step_Root.Step_Root_C.EnterStepProcess
// 0x0002 (0x0002 - 0x0000)
struct Step_Root_C_EnterStepProcess final
{
public:
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_EnterStepProcess;

// Function Step_Root.Step_Root_C.Event_StepVectorEvent
// 0x0020 (0x0020 - 0x0000)
struct Step_Root_C_Event_StepVectorEvent final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        bpp__VectoInfo__pf;                                // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_Root_C_Event_StepVectorEvent;

// Function Step_Root.Step_Root_C.Exec_OnAnimEnd
// 0x000C (0x000C - 0x0000)
struct Step_Root_C_Exec_OnAnimEnd final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Duration__pf;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_Root_C_Exec_OnAnimEnd;

// Function Step_Root.Step_Root_C.ExecCommand
// 0x002C (0x002C - 0x0000)
struct Step_Root_C_ExecCommand final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__VectorParam__pf;                              // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__VectorParam2__pf;                             // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__NameValue__pf;                                // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__IntValue__pf;                                 // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_ExecCommand;

// Function Step_Root.Step_Root_C.ExecCommandAfterAnimation
// 0x003C (0x003C - 0x0000)
struct Step_Root_C_ExecCommandAfterAnimation final
{
public:
	struct FPB_ST_AfterAnimationInfo              bpp__AnimationInfo__pf;                            // 0x0000(0x0038)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_Root_C_ExecCommandAfterAnimation;

// Function Step_Root.Step_Root_C.ExecCommonCallBack
// 0x0002 (0x0002 - 0x0000)
struct Step_Root_C_ExecCommonCallBack final
{
public:
	EPB_ExecCommonList                            bpp__ExecType__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_ExecCommonCallBack;

// Function Step_Root.Step_Root_C.Exit_AreaWarp
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Exit_AreaWarp final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Exit_AreaWarp;

// Function Step_Root.Step_Root_C.Exit_Attack
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Exit_Attack final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Exit_Attack;

// Function Step_Root.Step_Root_C.Exit_AttackFly
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Exit_AttackFly final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Exit_AttackFly;

// Function Step_Root.Step_Root_C.Exit_AttackLoop
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Exit_AttackLoop final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Exit_AttackLoop;

// Function Step_Root.Step_Root_C.Exit_BackMove
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Exit_BackMove final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Exit_BackMove;

// Function Step_Root.Step_Root_C.Exit_BackStep
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Exit_BackStep final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Exit_BackStep;

// Function Step_Root.Step_Root_C.Exit_Crouch
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Exit_Crouch final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_Root_C_Exit_Crouch;

// Function Step_Root.Step_Root_C.Exit_Damage
// 0x0001 (0x0001 - 0x0000)
struct Step_Root_C_Exit_Damage final
{
public:
	bool                                          bpp__IsValue__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
