#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Step_DemoChuk

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function Step_DemoChuk.Step_DemoChuk_C.UpdateAttack1
// 0x00B4 (0x00B4 - 0x0000)
struct Step_DemoChuk_C_UpdateAttack1 final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStepUpdateMoveInfo                    bpp__MoveInfo__pf__const;                          // 0x0004(0x0094)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FStepUpdateOutput                      bpp__Output__pf;                                   // 0x0098(0x001C)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_DemoChuk_C_UpdateAttack1;

// Function Step_DemoChuk.Step_DemoChuk_C.UpdateNormal
// 0x00B4 (0x00B4 - 0x0000)
struct Step_DemoChuk_C_UpdateNormal final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStepUpdateMoveInfo                    bpp__MoveInfo__pf__const;                          // 0x0004(0x0094)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FStepUpdateOutput                      bpp__Output__pf;                                   // 0x0098(0x001C)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_DemoChuk_C_UpdateNormal;

}

