#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SuspendGameYesNo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SuspendGameYesNo.SuspendGameYesNo_C
// 0x0038 (0x0290 - 0x0258)
class USuspendGameYesNo_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UYesNoPopup_C*                          YesNoPopup;                                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         Inventory;                                         // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBSoundControlComponent*               SoundComponent;                                    // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventClosedMenu;                                   // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCommonSaveWaitMsgPopup_C*              SaveWait;                                          // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SuspendGameYesNo(int32 EntryPoint);
	void OnPressedButton();
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void EventSelectYesClosed();
	void EventSelectYes();
	void EventSelectNoClosed();
	void EventSelectNo();
	void カスタムイベント_0();
	void EventOpenSaveWait();
	void Initialize();
	void Setup();
	void OnStart();
	void OnActive();
	void OpenMenu(EUserWidgetPriority Priority_0);
	void CloseMenu();
	void SuspendSave();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SuspendGameYesNo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SuspendGameYesNo_C")
	}
	static class USuspendGameYesNo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USuspendGameYesNo_C>();
	}
};
DUMPER7_ASSERTS_USuspendGameYesNo_C;

}

