#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TemporaryDataSlotList

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.ExecuteUbergraph_TemporaryDataSlotList
// 0x0044 (0x0044 - 0x0000)
struct TemporaryDataSlotList_C_ExecuteUbergraph_TemporaryDataSlotList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_ExecuteUbergraph_TemporaryDataSlotList;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.Tick
// 0x003C (0x003C - 0x0000)
struct TemporaryDataSlotList_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_Tick;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct TemporaryDataSlotList_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_PreConstruct;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct TemporaryDataSlotList_C_Initialize final
{
public:
	class UPBSpeedRunSave*                        CallFunc_GetInstance_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSaveNum_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_Initialize;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.AddList
// 0x0028 (0x0028 - 0x0000)
struct TemporaryDataSlotList_C_AddList final
{
public:
	const class USaveSlotItem_C*                  Input;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveSlotItem_C*                        ListItem;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddWidght_output;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_AddList;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.GetList
// 0x0020 (0x0020 - 0x0000)
struct TemporaryDataSlotList_C_GetList final
{
public:
	int32                                         Param_Index_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveSlotItem_C*                        Output;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetListIndex_NewParam;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlotItem_C*                        CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_GetList;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.GetSelectList
// 0x0010 (0x0010 - 0x0000)
struct TemporaryDataSlotList_C_GetSelectList final
{
public:
	class USaveSlotItem_C*                        Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlotItem_C*                        CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_GetSelectList;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.Clean
// 0x0030 (0x0030 - 0x0000)
struct TemporaryDataSlotList_C_Clean final
{
public:
	int32                                         idx;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveSlotItem_C*                        Element;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlotItem_C*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_Clean;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.Refresh
// 0x01D0 (0x01D0 - 0x0000)
struct TemporaryDataSlotList_C_Refresh final
{
public:
	class USaveSlotItem_C*                        Element;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBSaveDateTime                        New;                                               // 0x0008(0x0018)(Edit, BlueprintVisible, NoDestructor)
	struct FPBSaveDateTime                        Time;                                              // 0x0020(0x0018)(Edit, BlueprintVisible, NoDestructor)
	struct FPBSaveGameDataInfo                    GameData;                                          // 0x0038(0x00A8)(Edit, BlueprintVisible)
	class USaveSlotItem_C*                        AddSlot;                                           // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSpeedRunSave*                        CallFunc_GetInstance_ReturnValue;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlotItem_C*                        CallFunc_GetSelectList_Output;                     // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBSaveGameDataInfo                    CallFunc_GetSaveGameDataInfo_info;                 // 0x0100(0x00A8)()
	bool                                          CallFunc_GetSaveGameDataInfo_ReturnValue;          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlotItem_C*                        CallFunc_Create_ReturnValue;                       // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_Refresh;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.MoveCursor
// 0x0020 (0x0020 - 0x0000)
struct TemporaryDataSlotList_C_MoveCursor final
{
public:
	int32                                         MoveVal;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Move;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlotItem_C*                        CallFunc_GetSelectList_Output;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlotItem_C*                        CallFunc_GetSelectList_Output1;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetScroll_ret;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_MoveCursor;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.UpdateHeaderText
// 0x00E0 (0x00E0 - 0x0000)
struct TemporaryDataSlotList_C_UpdateHeaderText final
{
public:
	class UCommonMenuHeader_C*                    ref_header;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   txt;                                               // 0x0008(0x0018)(Edit, BlueprintVisible)
	struct FPBSaveGameDataInfo                    SlotData;                                          // 0x0020(0x00A8)(Edit, BlueprintVisible)
	class UCommonMenuHeader_C*                    UI_header;                                         // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlotItem_C*                        CallFunc_GetSelectList_Output;                     // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNewData_IsEnable;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_UpdateHeaderText;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.UpdateContorolGuide
// 0x0018 (0x0018 - 0x0000)
struct TemporaryDataSlotList_C_UpdateContorolGuide final
{
public:
	class UCommonControllGuide_C*                 ref_UIGuide;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonControllGuide_C*                 guide;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable;                                            // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmptyList_is_enable;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_UpdateContorolGuide;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.GetListIndex
// 0x0004 (0x0004 - 0x0000)
struct TemporaryDataSlotList_C_GetListIndex final
{
public:
	int32                                         Param_Index_0;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_GetListIndex;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.IsSelectTemporary
// 0x0003 (0x0003 - 0x0000)
struct TemporaryDataSlotList_C_IsSelectTemporary final
{
public:
	bool                                          isEnable;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmptyList_is_enable;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectDecide_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_IsSelectTemporary;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.IsEmptyList
// 0x0004 (0x0004 - 0x0000)
struct TemporaryDataSlotList_C_IsEmptyList final
{
public:
	bool                                          is_true;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          is_enable;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TRUE_0;                                            // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_IsEmpty;                          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_IsEmptyList;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.IsCursorUp
// 0x0003 (0x0003 - 0x0000)
struct TemporaryDataSlotList_C_IsCursorUp final
{
public:
	bool                                          isEnable;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmptyList_is_enable;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectUp_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_IsCursorUp;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.IsCursorDown
// 0x0003 (0x0003 - 0x0000)
struct TemporaryDataSlotList_C_IsCursorDown final
{
public:
	bool                                          isEnable;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmptyList_is_enable;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectDown_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_IsCursorDown;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.IsPrevPage
// 0x0003 (0x0003 - 0x0000)
struct TemporaryDataSlotList_C_IsPrevPage final
{
public:
	bool                                          isEnable;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmptyList_is_enable;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectLeft_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_IsPrevPage;

// Function TemporaryDataSlotList.TemporaryDataSlotList_C.IsNextPage
// 0x0003 (0x0003 - 0x0000)
struct TemporaryDataSlotList_C_IsNextPage final
{
public:
	bool                                          isEnable;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmptyList_is_enable;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectRight_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSlotList_C_IsNextPage;

}

