#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TemporaryDataSaveMenu

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "PopupParam_structs.hpp"


namespace SDK::Params
{

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.ExecuteUbergraph_TemporaryDataSaveMenu
// 0x0060 (0x0060 - 0x0000)
struct TemporaryDataSaveMenu_C_ExecuteUbergraph_TemporaryDataSaveMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPopupParam                            K2Node_MakeStruct_PopupParam;                      // 0x0008(0x0040)(HasGetValueTypeHash)
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> K2Node_Event_OnStepChanged; // 0x0048(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_ZOrder;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_ExecuteUbergraph_TemporaryDataSaveMenu;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.Start
// 0x0014 (0x0014 - 0x0000)
struct TemporaryDataSaveMenu_C_Start final
{
public:
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> OnStepChanged; // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	int32                                         ZOrder;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_Start;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.DecideSaveSlot
// 0x0018 (0x0018 - 0x0000)
struct TemporaryDataSaveMenu_C_DecideSaveSlot final
{
public:
	class FString                                 slot_name;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_DecideSaveSlot;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.UpdateTemporaryDataInfo
// 0x0158 (0x0158 - 0x0000)
struct TemporaryDataSaveMenu_C_UpdateTemporaryDataInfo final
{
public:
	struct FPBSaveGameDataInfo                    SlotData;                                          // 0x0000(0x00A8)(Edit, BlueprintVisible)
	class USaveSlotItem_C*                        CallFunc_GetSelectList_Output;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBSaveGameDataInfo                    CallFunc_GetSaveData_SaveData;                     // 0x00B0(0x00A8)()
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_UpdateTemporaryDataInfo;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.MoveTemporarySlot
// 0x0008 (0x0008 - 0x0000)
struct TemporaryDataSaveMenu_C_MoveTemporarySlot final
{
public:
	int32                                         MoveVal;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Move;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_MoveTemporarySlot;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.DecidedConfirm
// 0x0038 (0x0038 - 0x0000)
struct TemporaryDataSaveMenu_C_DecidedConfirm final
{
public:
	class FString                                 slot_name;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSpeedRunSave*                        CallFunc_GetInstance_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSaveslotName_str;                      // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveToDisk_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetListIndex_index;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_DecidedConfirm;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.OpenMenu
// 0x000C (0x000C - 0x0000)
struct TemporaryDataSaveMenu_C_OpenMenu final
{
public:
	EUserWidgetPriority                           Priority_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         z_order;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_OpenMenu;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct TemporaryDataSaveMenu_C_Initialize final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_Initialize;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.OnStart
// 0x0010 (0x0010 - 0x0000)
struct TemporaryDataSaveMenu_C_OnStart final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_OnStart;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.OnSelectTemp
// 0x0020 (0x0020 - 0x0000)
struct TemporaryDataSaveMenu_C_OnSelectTemp final
{
public:
	class UTitleLoadWaitAnim_C*                   LoadWait;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNextPage_isEnable;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPrevPage_isEnable;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCursorDown_isEnable;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCursorUp_isEnable;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectTemporary_isEnable;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelectCancel_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_OnSelectTemp;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.OnSelectSlot
// 0x0006 (0x0006 - 0x0000)
struct TemporaryDataSaveMenu_C_OnSelectSlot final
{
public:
	bool                                          CallFunc_IsSelectRight_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectLeft_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectDecide_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectCancel_ReturnValue;               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectDown_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectUp_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_OnSelectSlot;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.OnConfirm
// 0x0018 (0x0018 - 0x0000)
struct TemporaryDataSaveMenu_C_OnConfirm final
{
public:
	class APlayerController*                      Ctrl;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPopupReturn_Return;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_OnConfirm;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.DecideTemporarySlot
// 0x0008 (0x0008 - 0x0000)
struct TemporaryDataSaveMenu_C_DecideTemporarySlot final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_DecideTemporarySlot;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.MoveSaveDataSlot
// 0x0008 (0x0008 - 0x0000)
struct TemporaryDataSaveMenu_C_MoveSaveDataSlot final
{
public:
	int32                                         move_val;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Move;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_MoveSaveDataSlot;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.UpdateSaveDataInfo
// 0x0158 (0x0158 - 0x0000)
struct TemporaryDataSaveMenu_C_UpdateSaveDataInfo final
{
public:
	struct FPBSaveGameDataInfo                    SlotData;                                          // 0x0000(0x00A8)(Edit, BlueprintVisible)
	class USaveSlotItem_C*                        CallFunc_GetSelectList_Output;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBSaveGameDataInfo                    CallFunc_GetSaveData_SaveData;                     // 0x00B0(0x00A8)()
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_UpdateSaveDataInfo;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.CancelSave
// 0x0008 (0x0008 - 0x0000)
struct TemporaryDataSaveMenu_C_CancelSave final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_CancelSave;

// Function TemporaryDataSaveMenu.TemporaryDataSaveMenu_C.UpdateControlGuide
// 0x0004 (0x0004 - 0x0000)
struct TemporaryDataSaveMenu_C_UpdateControlGuide final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_IsEmpty;                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmptyList_is_enable;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TemporaryDataSaveMenu_C_UpdateControlGuide;

}

