#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeRecordListWindow_Archives

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TimeRecordListWindow_Archives.TimeRecordListWindow_Archives_C
// 0x0030 (0x0288 - 0x0258)
class UTimeRecordListWindow_Archives_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonListWindow_C*                    ScrollList;                                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Title;                                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UArchiveTimeAttackListItem_Archives_C*> ListButtons;                                // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Index_0;                                           // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TimeRecordListWindow_Archives(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void Clean();
	void AddList(class UArchiveTimeAttackListItem_Archives_C*& Content);
	void GetList(int32 Param_Index_0, class UArchiveTimeAttackListItem_Archives_C** Output);
	void GetSelectList(class UArchiveTimeAttackListItem_Archives_C** Output);
	void MoveCursor(int32 MoveValue);
	void RefreshScroll(int32 input_offset);
	void GetListIndex(int32* Param_Index_0);
	void IsMoveCursor(bool is_true, bool* is_enable);
	void IsListEmpty(bool* IsEmpty);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TimeRecordListWindow_Archives_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TimeRecordListWindow_Archives_C")
	}
	static class UTimeRecordListWindow_Archives_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTimeRecordListWindow_Archives_C>();
	}
};
DUMPER7_ASSERTS_UTimeRecordListWindow_Archives_C;

}

