#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TitleGameState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TitleGameState.TitleGameState_C
// 0x0018 (0x0508 - 0x04F0)
class ATitleGameState_C final : public AOCGameState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayer1Ready;                                     // 0x0500(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPlayer2Ready;                                     // 0x0501(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOnlineTransitionOut;                              // 0x0502(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TitleGameState(int32 EntryPoint);
	void Multicast_OnCustomizationChanged(const TArray<uint8>& Customization, int32 PlayerIndex);
	void Multicast_OnLoadoutChanged(int32 PlayerIndex, const struct FCustomizationInfoLoadout& loadout);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void InitializeLoadingManager();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TitleGameState_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TitleGameState_C")
	}
	static class ATitleGameState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATitleGameState_C>();
	}
};
DUMPER7_ASSERTS_ATitleGameState_C;

}

