#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialEquip03Window

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TutorialEquip03Window.TutorialEquip03Window_C
// 0x0028 (0x0268 - 0x0240)
class UTutorialEquip03Window_C final : public UTutorialWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CloseWindow;                                       // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OpenWindow;                                        // 0x0250(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 NextIcon;                                          // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 windowFrame;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TutorialEquip03Window(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void CloseAnimFinished();
	void Construct();
	void Initialize();
	void OnCloseWindow();
	void OnOpenWindow();
	void WidgetAnimationEvt_OpenWindow_K2Node_WidgetAnimationEvent_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TutorialEquip03Window_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TutorialEquip03Window_C")
	}
	static class UTutorialEquip03Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTutorialEquip03Window_C>();
	}
};
DUMPER7_ASSERTS_UTutorialEquip03Window_C;

}

