#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Dialogue_ResponseItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_Dialogue_ResponseItem.UI_Dialogue_ResponseItem_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_ResponseItem_C_GetButton final
{
public:
	class UButton*                                bpp__btnResponse__pf;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_ResponseItem_C_GetButton;

// Function UI_Dialogue_ResponseItem.UI_Dialogue_ResponseItem_C.GetLabel
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_ResponseItem_C_GetLabel final
{
public:
	class UTextBlock*                             bpp__lblText__pf;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_ResponseItem_C_GetLabel;

// Function UI_Dialogue_ResponseItem.UI_Dialogue_ResponseItem_C.Initialize
// 0x0038 (0x0038 - 0x0000)
struct UI_Dialogue_ResponseItem_C_Initialize final
{
public:
	class FName                                   bpp__BranchName__pf;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__BranchHost__pf;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__ResponseHandler__pf;                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__HiddenResponse__pf;                           // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   bpp__Text__pf__const;                              // 0x0020(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_ResponseItem_C_Initialize;

// Function UI_Dialogue_ResponseItem.UI_Dialogue_ResponseItem_C.SetHighlighted
// 0x0001 (0x0001 - 0x0000)
struct UI_Dialogue_ResponseItem_C_SetHighlighted final
{
public:
	bool                                          bpp__Highlighted__pf;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_ResponseItem_C_SetHighlighted;

// Function UI_Dialogue_ResponseItem.UI_Dialogue_ResponseItem_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct UI_Dialogue_ResponseItem_C_SetSelected final
{
public:
	bool                                          bpp__Selected__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_ResponseItem_C_SetSelected;

// Function UI_Dialogue_ResponseItem.UI_Dialogue_ResponseItem_C.UpdateStyle
// 0x0004 (0x0004 - 0x0000)
struct UI_Dialogue_ResponseItem_C_UpdateStyle final
{
public:
	float                                         bpp__Delta__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_ResponseItem_C_UpdateStyle;

}

