#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PBCConfirmDeletePopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PBCConfirmDeletePopup.WBP_PBCConfirmDeletePopup_C
// 0x0040 (0x02C0 - 0x0280)
class UWBP_PBCConfirmDeletePopup_C final : public UPBCNavigableUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FrameBottom;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FrameTop;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_23;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PBCConfirmDeletePopup_No_C*        WBP_PBCConfirmDeletePopup_No;                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PBCConfirmDeletePopup_Yes_C*       WBP_PBCConfirmDeletePopup_Yes;                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBCNavigableUIElement_SaveSlot*        SaveSlotObj;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PBCConfirmDeletePopup(int32 EntryPoint);
	void OnPressBack();
	void OnHideUI();
	void Construct();
	void Setup(class UPBCNavigableUIElement_SaveSlot* SaveSlot);
	void OnDoDelete();
	void OnDontDelete();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_PBCConfirmDeletePopup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_PBCConfirmDeletePopup_C")
	}
	static class UWBP_PBCConfirmDeletePopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PBCConfirmDeletePopup_C>();
	}
};
DUMPER7_ASSERTS_UWBP_PBCConfirmDeletePopup_C;

}

