#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PBCNavigableElem_Select

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PBCNavigableElem_Select.WBP_PBCNavigableElem_Select_C
// 0x0058 (0x02B0 - 0x0258)
class UWBP_PBCNavigableElem_Select_C : public UPBCNavigableUIElement_Select
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 RedHighlight;                                      // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SwitchArrow;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_Image;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 NextUIClass_BP;                                    // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   text;                                              // 0x0288(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             Text2DImage;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShowHighlight;                                   // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_PBCNavigableElem_Select(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void HighlightElem();
	void UnhighlightElem();
	void SetTextTextureActive(bool IsActive);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_PBCNavigableElem_Select_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_PBCNavigableElem_Select_C")
	}
	static class UWBP_PBCNavigableElem_Select_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PBCNavigableElem_Select_C>();
	}
};
DUMPER7_ASSERTS_UWBP_PBCNavigableElem_Select_C;

}

