#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: YesNoPopup

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "PopupParam_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function YesNoPopup.YesNoPopup_C.ExecuteUbergraph_YesNoPopup
// 0x0048 (0x0048 - 0x0000)
struct YesNoPopup_C_ExecuteUbergraph_YesNoPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_YesNoPopup_C_ExecuteUbergraph_YesNoPopup;

// Function YesNoPopup.YesNoPopup_C.Tick
// 0x003C (0x003C - 0x0000)
struct YesNoPopup_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_YesNoPopup_C_Tick;

// Function YesNoPopup.YesNoPopup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct YesNoPopup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_YesNoPopup_C_PreConstruct;

// Function YesNoPopup.YesNoPopup_C.Initialize
// 0x0018 (0x0018 - 0x0000)
struct YesNoPopup_C_Initialize final
{
public:
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCommonPopupButton_C*>           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
};
DUMPER7_ASSERTS_YesNoPopup_C_Initialize;

// Function YesNoPopup.YesNoPopup_C.Setup
// 0x0038 (0x0038 - 0x0000)
struct YesNoPopup_C_Setup final
{
public:
	class UCommonPopupButton_C*                   Element;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonPopupButton_C*                   CallFunc_GetSelectButton_Output;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonPopupButton_C*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_YesNoPopup_C_Setup;

// Function YesNoPopup.YesNoPopup_C.OnActive
// 0x0004 (0x0004 - 0x0000)
struct YesNoPopup_C_OnActive final
{
public:
	int32                                         Result_0;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_YesNoPopup_C_OnActive;

// Function YesNoPopup.YesNoPopup_C.GetButton
// 0x0020 (0x0020 - 0x0000)
struct YesNoPopup_C_GetButton final
{
public:
	int32                                         Param_Index_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonPopupButton_C*                   Output;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonPopupButton_C*                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_YesNoPopup_C_GetButton;

// Function YesNoPopup.YesNoPopup_C.GetSelectButton
// 0x0010 (0x0010 - 0x0000)
struct YesNoPopup_C_GetSelectButton final
{
public:
	class UCommonPopupButton_C*                   Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonPopupButton_C*                   CallFunc_GetButton_Output;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_YesNoPopup_C_GetSelectButton;

// Function YesNoPopup.YesNoPopup_C.MoveCursor
// 0x0020 (0x0020 - 0x0000)
struct YesNoPopup_C_MoveCursor final
{
public:
	int32                                         Move;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonPopupButton_C*                   CallFunc_GetSelectButton_Output;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonPopupButton_C*                   CallFunc_GetSelectButton_Output1;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddValueAndLoop_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_YesNoPopup_C_MoveCursor;

// Function YesNoPopup.YesNoPopup_C.GetPopupReturn
// 0x000C (0x000C - 0x0000)
struct YesNoPopup_C_GetPopupReturn final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_OnActive_Result;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_YesNoPopup_C_GetPopupReturn;

// Function YesNoPopup.YesNoPopup_C.SetPopupParam
// 0x0070 (0x0070 - 0x0000)
struct YesNoPopup_C_SetPopupParam final
{
public:
	class FText                                   input_text;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPopupParam                            input_param;                                       // 0x0018(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FText                                   txt;                                               // 0x0058(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_YesNoPopup_C_SetPopupParam;

// Function YesNoPopup.YesNoPopup_C.SetPopupText
// 0x0018 (0x0018 - 0x0000)
struct YesNoPopup_C_SetPopupText final
{
public:
	class FText                                   in_text;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_YesNoPopup_C_SetPopupText;

// Function YesNoPopup.YesNoPopup_C.OpenPopup
// 0x0008 (0x0008 - 0x0000)
struct YesNoPopup_C_OpenPopup final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_YesNoPopup_C_OpenPopup;

// Function YesNoPopup.YesNoPopup_C.ClosePopup
// 0x0008 (0x0008 - 0x0000)
struct YesNoPopup_C_ClosePopup final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_YesNoPopup_C_ClosePopup;

// Function YesNoPopup.YesNoPopup_C.IsMoveMouseLeft
// 0x0003 (0x0003 - 0x0000)
struct YesNoPopup_C_IsMoveMouseLeft final
{
public:
	bool                                          is_enable;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMouseMoveLeft_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_YesNoPopup_C_IsMoveMouseLeft;

// Function YesNoPopup.YesNoPopup_C.IsMoveMouseRight
// 0x0003 (0x0003 - 0x0000)
struct YesNoPopup_C_IsMoveMouseRight final
{
public:
	bool                                          is_enable;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMouseMoveRight_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_YesNoPopup_C_IsMoveMouseRight;

// Function YesNoPopup.YesNoPopup_C.IsMoveCursorLeft
// 0x0008 (0x0008 - 0x0000)
struct YesNoPopup_C_IsMoveCursorLeft final
{
public:
	bool                                          is_enable;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMoveMouseLeft_is_enable;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectMultiplayerButton_Select;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IsSelectMultiplayerButton_Player;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_YesNoPopup_C_IsMoveCursorLeft;

// Function YesNoPopup.YesNoPopup_C.IsMoveCursorRight
// 0x000C (0x000C - 0x0000)
struct YesNoPopup_C_IsMoveCursorRight final
{
public:
	bool                                          is_enable;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectMultiplayerButton_Select;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IsSelectMultiplayerButton_Player;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMoveMouseRight_is_enable;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_YesNoPopup_C_IsMoveCursorRight;

// Function YesNoPopup.YesNoPopup_C.IsSelectMultiplayerButton
// 0x000C (0x000C - 0x0000)
struct YesNoPopup_C_IsSelectMultiplayerButton final
{
public:
	EPBGameKey                                    Button;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SELECT;                                            // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Player;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnlineCoreActive_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerUIButton_ReturnValue;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerUIButton_ReturnValue1;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_YesNoPopup_C_IsSelectMultiplayerButton;

// Function YesNoPopup.YesNoPopup_C.TickInput
// 0x0014 (0x0014 - 0x0000)
struct YesNoPopup_C_TickInput final
{
public:
	bool                                          CallFunc_IsSelectMultiplayerButton_Select;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IsSelectMultiplayerButton_Player;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelectMultiplayerButton_Select1;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IsSelectMultiplayerButton_Player1;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMoveCursorRight_is_enable;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMoveCursorLeft_is_enable;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_YesNoPopup_C_TickInput;

}

