#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Demo_N1008

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Demo_N1008.ABP_Demo_N1008_C
// 0x1200 (0x2040 - 0x0E40)
class UABP_Demo_N1008_C final : public UPBAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6F00FEBB400293EFF4EF91AC97D2B45B; // 0x0E48(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56B489294EBDE4B2553AF28201A1F207; // 0x0F00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67F3CE1543015832B941DFB4FCF2F583; // 0x0F28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E65A4F044F297B9F89F49DB234A1121D; // 0x0F50(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_47093436458CFC3297DD5DAD18590068; // 0x0F78(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_645278A946D2B0D0DA998FBE7768EB57; // 0x1040(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_968A183D464D7F203B856997CF64DE8C; // 0x10B8(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5573128D4BBA6BC4C23C1AA3C252266C; // 0x1180(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2FE2E6534DEEEC93CB1E88A57291D9A3; // 0x11F8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_DDF555264D493081496F0890DCFFFF95; // 0x1270(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_647FDF974DD0986484C178A423B14E50; // 0x1290(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_90BC084C45482EE38C4934BF904EC67C; // 0x12B8(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_643447DB4C49A6FF49C971A016DA0DC2; // 0x1380(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_CD5878EE46D57F9541860999D0322DF9; // 0x13A0(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_C49A236743D404370AA64AB978137151; // 0x14A8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_37D20DFF4A38ED8FE2CEB0AAB9DB32AB; // 0x14C8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5C27CF634708D72DC8D18497F534CC0C; // 0x14E8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_94E048AB4EE36E9BDAE2D492F0348D5B; // 0x15F0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_A6F9ADB743001BCD7F03E3936A869D6B; // 0x16F8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_CE665C43419E263F655ACBBE3277CC2E; // 0x1800(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_A1DCD9E5459433CFAAE27284C7D2F17F; // 0x1908(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_51E907B84EF4ABB2FA31BB8ACE48F72B; // 0x1A10(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2FBE9D5A40BCAC81CFBD81A2F18799AD; // 0x1B18(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_A54EEB4748757E2E50A257912F2203CE; // 0x1C20(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_EF7B661B463040CE80AA99BAD7EC3960; // 0x1D28(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_34CD2E8946C09380A8D5D6A48FC73C11; // 0x1E30(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_EAB91F4B4830AA5054DA488A51D07244; // 0x1F38(0x0108)()

public:
	void ExecuteUbergraph_ABP_Demo_N1008(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Demo_N1008_AnimGraphNode_TransitionResult_67F3CE1543015832B941DFB4FCF2F583();
	void Replacement(float* Value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Demo_N1008_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Demo_N1008_C")
	}
	static class UABP_Demo_N1008_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Demo_N1008_C>();
	}
};
DUMPER7_ASSERTS_UABP_Demo_N1008_C;

}

