#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_N3015_WEAPON_SHARD

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function ABP_N3015_WEAPON_SHARD.ABP_N3015_WEAPON_SHARD_C.ExecuteUbergraph_ABP_N3015_WEAPON_SHARD
// 0x000C (0x000C - 0x0000)
struct ABP_N3015_WEAPON_SHARD_C_ExecuteUbergraph_ABP_N3015_WEAPON_SHARD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterStance                              CallFunc_Get_CharacterStance_Value;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterStance                              CallFunc_Get_CharacterStance_Value1;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_N3015_WEAPON_SHARD_C_ExecuteUbergraph_ABP_N3015_WEAPON_SHARD;

// Function ABP_N3015_WEAPON_SHARD.ABP_N3015_WEAPON_SHARD_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_N3015_WEAPON_SHARD_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_N3015_WEAPON_SHARD_C_BlueprintUpdateAnimation;

}

