#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Head

#include "Basic.hpp"

#include "EPB_PlayerInfoVectorType_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ESubSubStep_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "EPB_PlayerCtr_FloatParameterType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EPB_PlayerInfoBoolType_structs.hpp"
#include "EPB_ExecCommandType_structs.hpp"
#include "EPB_AttackStance_structs.hpp"
#include "ESubStep_structs.hpp"
#include "EPB_P0000_GunDamageType_structs.hpp"
#include "EPB_PlayerStance_structs.hpp"
#include "EPB_ActionRequestCategory_structs.hpp"
#include "EPB_N1011_EnchantType_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Head.ABP_Head_C
// 0x2A90 (0x38D0 - 0x0E40)
class UABP_Head_C final : public UPBAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_DBCEC136474E9E9BA7D7FFA12447F632; // 0x0E48(0x00A0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1341988848FAEC411A5C6A90DB100A08; // 0x0EE8(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_606BC8F04768445543C027BA9C651519; // 0x0F98(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3E13ABF9424070478CA118A251C220C8; // 0x1060(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FE7D7FE64081464D3DF395B05EF6D416; // 0x1088(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D95F989F47C41F09F01BE68AF56FC3BE; // 0x10B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64608A924DCEDC2CA60B00823F5D5AB6; // 0x10D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AAA3AC6247BCB5AA4AB4B5B2DBC85878; // 0x1100(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1801D2A24F3EB6718D49A5903244034D; // 0x1128(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10B541854416D802D7262397FC27C33C; // 0x1150(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BB3AFADE480C00E596C2CC894A1136FE; // 0x1178(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71EE6EB045CC3D26DEA221B9FAD9C60E; // 0x11A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_98B656104222F3BE7018B981B2079126; // 0x11C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11049D22493912AFD31DE7B8797EBB9D; // 0x11F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75631E594C49DEDD79A13DA4E3F73727; // 0x1218(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C3F2170C460FE3F035C2BEADB6EDE8C0; // 0x1240(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67FAEFDC470EFAD6F06110BA954B96F4; // 0x1268(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1D7FF2D54AEF83524DB13CB7CF1E2DD3; // 0x1290(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A1A158724872FE839F7F76A87C40D122; // 0x12B8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_622E41B44216124B7BC900B4FE58DACD; // 0x12E0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_DEF9710F45B6C0B9F57CED912117AE49; // 0x1358(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E4BF20D24500876A3EBE539EFEFC0A79; // 0x1378(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5593B9DF456FA2E2D70399B8B7FD8E70; // 0x13F0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9A2082B04DED135297005F94AB3C2AE5; // 0x1410(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_BCDCB51A4936C04E9E0C828F6A91A943; // 0x1488(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_208782E243912F600AB72D89505C8DB9; // 0x14A8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9FD6273E48569DA9339270BE31D669E9; // 0x1520(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C781D37A4729E29E177A9D837AE7D7A0; // 0x1540(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_082EF24642E7B9C08D15159046642431; // 0x15B8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EB63558D4FB84117C8CB6B84247BB625; // 0x15D8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E75FC9C647CB36C4C78B5D95125F3874; // 0x1650(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_647FDF974DD0986484C178A423B14E50; // 0x1670(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_87F4F6A04693C813D7210F903BF39852; // 0x1698(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E4A53E3645CCF0B0145D1492CDE56130; // 0x1710(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_BF57F9484A875BE2D674538DDF7A7957; // 0x1730(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1DF1C54A4DFB51D08F3F0CB354754252; // 0x17A8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4B67649245E032421A59CB8BA9BAC3B1; // 0x17C8(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_10ED0885400426BEE761C6BE8AD16552; // 0x1890(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A06DB00C49B731B57BAA8393A0810C11; // 0x1958(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_D220AB08499888779D8487BFA2CDFD1C; // 0x19D0(0x00A0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_CFEC5D8D43F87D41200690B82875A362; // 0x1A70(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B29F88854E59B0A04DAE26AC722E463F; // 0x1B20(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3AAADADC4D59245047059D852AA60A80; // 0x1B98(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_83D8C4994EA44744CAB2C0A5A3B74CBE; // 0x1C60(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A50E8B4B4E22669871B8B2BB83C1DAA2; // 0x1CD8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_070F0EBF46FE9E64C5F2868A83F0E775; // 0x1D50(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_68729B3946AA5F2A775817AA97F231B0; // 0x1DC8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_363A9A7D44D9C1F434E232A9E18ADA43; // 0x1E40(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_384CE2EF4BCD867944CD28B3B2713581; // 0x1EB8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1FC8786844EE4CD2949B399AD310E91B; // 0x1F30(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7888C6854CE9999D32891682A2642C81; // 0x1FA8(0x0078)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_745F94194C2BF90711A03E9CA8D16865; // 0x2020(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_A3888E7045E1BD482207D69417D2482D; // 0x20D0(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4FE3502E4F8AF0A9FE161EAC54D740ED; // 0x2188(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_C5195734453717D0B52BE19A55082640; // 0x21B0(0x0018)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2066845242B0E7EA2E499B88241E084C; // 0x21C8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_95E68932489491D6B56E8F9F26A9B094; // 0x21E8(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_B7EE0A8842A9803DDA56D68232FF2532; // 0x2208(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_7E18A26844CE2B7D705C09B24C3E2B0B; // 0x22D0(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_CFC18B32409F8478675FEB932C252856; // 0x2398(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_AC8B55FB4D22EEDB17BE0ABB29B304B0; // 0x2460(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_4CD236DF46DD87A0D98C74877AD6D18D; // 0x2528(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_411D72F642AE6D07D82A6A8B828A8CCD; // 0x25F0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3A08DF5F4C6D647D18ECA8802B5D5F73; // 0x2668(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D5B740004C6D5333C752828CA49B8F75; // 0x26E0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DE659B484801EA051134F0A3C4268757; // 0x2758(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DBAA612048BF7F9C0EDA4E89EB574E30; // 0x27D0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_241BDDF8476A2DC7967A02A9BEB491F1; // 0x2848(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_06938FE3445CAB15E8969A8F35E74DC4; // 0x28C0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CB90DA174BABC1E74A60D7A859BFEFF0; // 0x2938(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C76F5F6041DBB768F5770AA0B3004B89; // 0x29B0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32C085B944FD6DAB647ACC91FFE0F072; // 0x2A28(0x0078)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_DAF5B7444E6220CB2E05FF8C75823CBE; // 0x2AA0(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_D84D666A4BBC86433B8FB9AAC59446E5; // 0x2B68(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_C48093B84645A430890CC4A6E8E9B060; // 0x2C30(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_0A2451EA4A38B5138C6BA29AF28324D5; // 0x2CF8(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_DA59B6EE4293CCDEB0FC7DA946E59F8F; // 0x2DC0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A2F32E1B414236DB87E5CE86F7803C9C; // 0x2E88(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A663D28E4A8240ADA86692B9693FFA2A; // 0x2F00(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3732319A4F1FD8798BCFF08D44E4577A; // 0x2F78(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2A27ACDE4A668CACBFF18B907C403B9E; // 0x2FF0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FAC009204A5679D6F248F5826FE93BC0; // 0x3068(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_AA808CE6401C6187872E33BDBBC6DEC6; // 0x30E0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3887CA8F4D7895DA93F140A96B141ED1; // 0x3158(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A8D131784CAA5968339BF2A9C2DFB723; // 0x31D0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_65D8AC654C13D4DDEFC4C9B5EBBECA79; // 0x3248(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4D734FAA418D0ED0699FB78D339F251D; // 0x32C0(0x0078)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_E6CE1269484AE958ACEC3FBAA9EAB8AE; // 0x3338(0x00B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5CA15C904D27FB13E38A0D87ED189243; // 0x33F0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C5D14C3446B62F20E3A8CD92D873470E; // 0x3468(0x0078)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_AAEDFEB7410AF6C9A6973892B8DF997C; // 0x34E0(0x00B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0F44BF1F455623FAD36E658D4A0655BF; // 0x3598(0x0078)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_DC9C39A541B6F1855D31C3BFDCA11236; // 0x3610(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5E031DBF4CE653113BA336AE98C5A955; // 0x3718(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root_F574DFDF455A94EE4F1183B3E4F8CC53; // 0x3820(0x0020)()
	class USkeletalMeshComponent*                 OwnerMesh;                                         // 0x3840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBLipVowel                                   SequencerLipVowel;                                 // 0x3848(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3849[0x3];                                     // 0x3849(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MouthAnimBlendTime;                                // 0x384C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SequencerFaceControl;                              // 0x3850(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	EPBFacialExpression                           StepFacialWildCard;                                // 0x3851(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3852[0x2];                                     // 0x3852(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MouseRate;                                         // 0x3854(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LipA;                                              // 0x3858(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LipI;                                              // 0x385C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LipU;                                              // 0x3860(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LipuE;                                             // 0x3864(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LipuO;                                             // 0x3868(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_386C[0x4];                                     // 0x386C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             EyeRightPoint;                                     // 0x3870(0x0030)(Edit, BlueprintVisible, IsPlainOldData, Interp, NoDestructor)
	struct FTransform                             EyeLeftPoint;                                      // 0x38A0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Head(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Head_AnimGraphNode_TransitionResult_98B656104222F3BE7018B981B2079126();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Head_AnimGraphNode_TransitionResult_11049D22493912AFD31DE7B8797EBB9D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Head_AnimGraphNode_TransitionResult_75631E594C49DEDD79A13DA4E3F73727();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Head_AnimGraphNode_TransitionResult_C3F2170C460FE3F035C2BEADB6EDE8C0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Head_AnimGraphNode_TransitionResult_71EE6EB045CC3D26DEA221B9FAD9C60E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Head_AnimGraphNode_BlendListByBool_DBCEC136474E9E9BA7D7FFA12447F632();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Head_AnimGraphNode_BlendListByEnum_1341988848FAEC411A5C6A90DB100A08();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Head_AnimGraphNode_TransitionResult_1801D2A24F3EB6718D49A5903244034D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Head_AnimGraphNode_TransitionResult_10B541854416D802D7262397FC27C33C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Head_AnimGraphNode_TransitionResult_BB3AFADE480C00E596C2CC894A1136FE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Head_AnimGraphNode_ModifyBone_5E031DBF4CE653113BA336AE98C5A955();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Head_AnimGraphNode_ModifyBone_DC9C39A541B6F1855D31C3BFDCA11236();
	void PlayerCtr_EndFacialAnimation(bool* return_0);
	void PlayerCtr_StartFacialAnimation(EPBFacialExpression FacialType, bool* return_0);
	void PlayerCtr_SetChairMagicRecoverRate(float MagicRecoverSpeedRate, bool* return_0);
	void PlayerCtr_SetSnapShot(const struct FPoseSnapshot& Snapshot, bool* return_0);
	void PlayerCtr_AccelWorld(bool Stop, bool* return_0);
	void PlayerCtr_SetMirroringReverse(bool Reverse, bool* return_0);
	void PlayerCtr_RequestEnchant(bool Request, bool ForceEnchantType, EPB_N1011_EnchantType EnchantType, bool* return_0);
	void PlayerInfo_GetAimDirectionVector(bool* IsAiming, struct FVector* WorldVector);
	void PlayerCtr_GetForwardVector(struct FVector* WorldDirection);
	void PlayerCtr_GetTriggerHandWorldLocation(struct FVector* WorldLocation);
	void PlayerCtr_GetDirectionalHandWorldLocation(struct FVector* WorldLocation);
	void PlayerCtr_StartBookRead(bool* return_0);
	void PlayerCtr_SetEventAttack(bool* return_0);
	void PlayerCtr_SpawnEffect(class FName EffectId, const struct FVector& SpawnWorldLocation, float Scale, float TimeDilation, const struct FVector& RotationVector, ECarriedCatalog SpawnType, bool* IsSpawn, class APBParticle** EffectInstance, class UParticleSystemComponent** ParticleSystemComponent);
	void PlayerInfo_GetPlayerSpeed(struct FVector* characterSpeed);
	void PlayerCtr_SetDirectionalShardEnable(bool Enable, bool* return_0);
	void PlayerCtr_StandUpFromChair(bool* return_0);
	void PlayerCtr_SetDisenableStandUpChairByeKey(bool* return_0);
	void PlayerInfo_IsEnableAreaDoor(bool* isEnable);
	void PlayerCtr_SpawnBullet(class FName BulletID, const struct FVector& SpawnWorldLocation, const struct FVector& TargetWorldLocation, EBulletDirection DirectionType, ECarriedCatalog SpawnerType, bool IsOverRoom, class FName ShardId, bool* IsSpawn, class APBBulletActor** BulletIns, class AActor** BulletSubActor);
	void PlayerCtr_JumpkickOff(bool* return_0);
	void PlayerCtr_BookClose(bool* return_0);
	void PlayerInfo_SetAccelWorldSelf(bool IsAccelWorlding, bool* return_0);
	void PlayerCtr_JumpAttackLateralMoveReverse(bool Value, bool* return_0);
	void PlayerCtr_SetActionRequestCondition(EPB_ActionRequestCategory ActionRequestCategory, bool* return_0);
	void PlayerCtr_SetWaterFallSpeedRate(float VerticalSpeedRate, float HorizontalSpeedRate, bool* return_0);
	void PlayerCtr_SetEquipMeshVisible(bool CapVisible, bool HeadVisible, bool Accesarry1Visible, bool Accesarry2Visible, bool MufflerVisible, bool HairVisible, bool* return_0);
	void PlayerInfo_GetEquipActor(ECarriedCatalog EquipType, class AEQBP_Root_C** EquipActor, bool* IsValid);
	void PlayerCtr_SetAnimBool(EAnimBoolArray AnimBoolType, bool Value, bool* return_0);
	void PlayerCtr_WarpRequest(const struct FVector& WorldLocation, struct FVector* return_0);
	void PlayerInfo_GetPlayerAttackInfo(EWeaponType* WeaponType, EPB_PlayerStance* PlayerStance, bool* IsSlant);
	void PlayerInfo_GetBulletInfo(int32* ConsumeNum, float* DamageRate, class FName* DamageMasterId, bool* IsNotConsume, bool* IsHoming, EPB_P0000_GunDamageType* DamageType);
	void PlayerCtr_SetIsInnerBloodPool(bool IsInner, bool* return_0);
	void PlayerCtr_SpawnBulletEx(class FName BulletID, const struct FPBBulletParameter& BulletParamter, const struct FPBBallisticParameter& BallisticParameter, const struct FVector& SpawnWorldLocation, const struct FVector& TargetWorldLocation, EBulletDirection DirectionType, ECarriedCatalog SpawnerType, bool IsOverRoom, class FName ShardId, bool* IsSpawn, class APBBulletActor** BulletIns, class AActor** BulletSubActor);
	void PlayerCtr_SetFakeMoonWarpSetting(const struct FVector& WarpTargetLocation, bool* return_0);
	void PlayerCtr_ExecChairDamamage(bool* return_0);
	void PlayerCtr_LaunchGun(class FName BulletID, class FName SocketName, bool IsArts, bool* IsLaunch, class APBBulletActor** BulletInstance);
	void PlayerInfo_IsDispWeapon(bool* IsDisp);
	void PlayerCtr_EventDealDamageInfo(class FName DamageId, bool IsHit, EPBBloodColor BloodColor, float DamageValue, class APBBaseCharacter* ChrIns, const struct FVector& HitWorldLocation, bool IsCritical, bool IsBullet, class FName HitBone, EAttackAttribute EffectiveAttribute, class UPBCollisionObject* AttackCollision, bool* return_0);
	void PlayerCtr_FlipRequest(bool IsRight, bool* return_0);
	void PlayerCtr_ReleaseInvert(float Distance, const struct FVector& Dir, bool IsDamageIfNotInvert, bool* return_0);
	void PlayerCtr_SetEquipEnchantParameter(ECarriedCatalog EquipType, bool IsUnEquip, bool* return_0);
	void PlayerInfo_GetEquipItemID(ECarriedCatalog EquipType, bool IsPrevEquip, class FName* ItemID);
	void PlayerCtr_SetShardEnchantParameter(class FName ShardId, bool IsUnEquip, int32 Rank, bool* return_0);
	void PlayerCtr_SetAimEffectCondition(class FName ShardId, bool* return_0);
	void PlayerCtr_UpdateMasteryAttackRate(class FName WeaponId, bool IsCheckShard, class FName ShardId, bool IsEquip, bool* return_0);
	void PlayerInfo_GetEquipSpecialAttribute(EPBEquipSpecialAttribute Type, bool IsRate, float* Value);
	void PlayerCtr_TransForceStep(EStepEntry Wildcard, EPBStep MainStep, ESubStep SubStep, ESubSubStep SubSubStep, bool* return_0);
	void PlayerCtr_SetShardBulletActor(EShardType ShardType, class APBBulletActor*& BulleIns, bool* return_0);
	void PlayerInfo_GetShardBulletActor(EShardType ShardType, class APBBulletActor** ShardBulletIns);
	void PlayerInfo_GetAimDirectionWorldVector(struct FVector* WorldVector);
	void PlayerCtr_PlayShardVoice(EShardType ShardType, bool* return_0);
	void PlayerCtr_SetDefaultBrakeRate(float BrakeRate, bool* return_0);
	void PlayerInfo_GetWorldLocationRecord(int32 Index_0, struct FVector* WorldLocation);
	void PlayerCtr_SetFloatParameter(EPB_PlayerCtr_FloatParameterType ParameterType, float ParameterValue, bool* return_0);
	void PlayerCtr_SetBoolParameter(EPB_PlayerInfoBoolType ParameterType, bool ParameterValue, bool* return_0);
	void PlayerInfo_SetEquipSpecialAttribute(EPBEquipSpecialAttribute Type, float Value, bool* return_0);
	void PlayerCtr_SpawnWeaponTrail(class FName SocketName, EPB_AttackStance StanceType, bool* return_0);
	void PlayerInfo_GetEquipModelActor(EPBEquipModelType Type, class AActor** EquipActor);
	void PlayerCtr_SetReflectionMaxDistance(float MaxDistance, bool* return_0);
	void PlayerInfo_GetShardInfo(class FName ShardId, EShardType ShardType, bool* IsEquip, bool* IsPossess, int32* Rank, float* RankVakue, int32* Grade, float* GradeValue);
	void PlayerCtr_ExecCommand(EPB_ExecCommandType CommandType, bool BoolParameter, float FloatParameter, int32 IntParameter, const struct FVector& VectorPrameter, class FName NameParameter, bool* return_0);
	void PlayerCtr_SetUseEmissive(bool Use, float FlashDuration, const struct FVector& EmissiveColor, int32 Priority, float EmissiveMin, float EmissiveMax, float EmissiveContrast, float Duration, bool* return_0);
	void PlayerInfo_GetAimRotation(struct FRotator* Rotation);
	void PlayerInfo_GetActionRequestManager(class UOBJ_ActionRequest_C** ActReqMan);
	void PlayerInfo_GetBoolValue(EPB_PlayerInfoBoolType Type, bool* return_0);
	void PlayerInfo_GetVectorValue(EPB_PlayerInfoVectorType Type, struct FVector* Vector);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Head_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Head_C")
	}
	static class UABP_Head_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Head_C>();
	}
};
DUMPER7_ASSERTS_UABP_Head_C;

}

