#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_P0000_AfterImage

#include "Basic.hpp"

#include "PBST_AfterImageInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_P0000_AfterImage.ABP_P0000_AfterImage_C.ExecuteUbergraph_ABP_P0000_AfterImage
// 0x0004 (0x0004 - 0x0000)
struct ABP_P0000_AfterImage_C_ExecuteUbergraph_ABP_P0000_AfterImage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_P0000_AfterImage_C_ExecuteUbergraph_ABP_P0000_AfterImage;

// Function ABP_P0000_AfterImage.ABP_P0000_AfterImage_C.IAfterImage_SetSnapShot
// 0x0040 (0x0040 - 0x0000)
struct ABP_P0000_AfterImage_C_IAfterImage_SetSnapShot final
{
public:
	struct FPoseSnapshot                          Snapshot_0;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          return_0;                                          // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ABP_P0000_AfterImage_C_IAfterImage_SetSnapShot;

// Function ABP_P0000_AfterImage.ABP_P0000_AfterImage_C.IAfterImage_GetAfterImageBasicInfo
// 0x0020 (0x0020 - 0x0000)
struct ABP_P0000_AfterImage_C_IAfterImage_GetAfterImageBasicInfo final
{
public:
	int32                                         AfterImageNum;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AfterImageDuration;                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          AfterImageMesh;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AnimInstance;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     OptionalReplacementMaterial;                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_P0000_AfterImage_C_IAfterImage_GetAfterImageBasicInfo;

// Function ABP_P0000_AfterImage.ABP_P0000_AfterImage_C.IAfterImage_DrawSphere
// 0x0018 (0x0018 - 0x0000)
struct ABP_P0000_AfterImage_C_IAfterImage_DrawSphere final
{
public:
	struct FVector                                WorldLocation;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          return_0;                                          // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ABP_P0000_AfterImage_C_IAfterImage_DrawSphere;

// Function ABP_P0000_AfterImage.ABP_P0000_AfterImage_C.IAfterImage_GetSkeletalMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct ABP_P0000_AfterImage_C_IAfterImage_GetSkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 SkeletaleMeshComponent;                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_P0000_AfterImage_C_IAfterImage_GetSkeletalMeshComponent;

// Function ABP_P0000_AfterImage.ABP_P0000_AfterImage_C.IAfterImage_GetWorldTransform
// 0x0030 (0x0030 - 0x0000)
struct ABP_P0000_AfterImage_C_IAfterImage_GetWorldTransform final
{
public:
	struct FTransform                             WorldTransform;                                    // 0x0000(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ABP_P0000_AfterImage_C_IAfterImage_GetWorldTransform;

// Function ABP_P0000_AfterImage.ABP_P0000_AfterImage_C.IAfterImage_GetWorldLocation
// 0x000C (0x000C - 0x0000)
struct ABP_P0000_AfterImage_C_IAfterImage_GetWorldLocation final
{
public:
	struct FVector                                WorldLocation;                                     // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_P0000_AfterImage_C_IAfterImage_GetWorldLocation;

// Function ABP_P0000_AfterImage.ABP_P0000_AfterImage_C.IAfterImage_RemoveSkeletalMeshComponent
// 0x0010 (0x0010 - 0x0000)
struct ABP_P0000_AfterImage_C_IAfterImage_RemoveSkeletalMeshComponent final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          return_0;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ABP_P0000_AfterImage_C_IAfterImage_RemoveSkeletalMeshComponent;

// Function ABP_P0000_AfterImage.ABP_P0000_AfterImage_C.IAfterImage_AddSkeletalMeshComponent
// 0x0018 (0x0018 - 0x0000)
struct ABP_P0000_AfterImage_C_IAfterImage_AddSkeletalMeshComponent final
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AnimInstance;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMeshComponent;                             // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_P0000_AfterImage_C_IAfterImage_AddSkeletalMeshComponent;

// Function ABP_P0000_AfterImage.ABP_P0000_AfterImage_C.IAfterImage_SpawnAfterImageMesh
// 0x0008 (0x0008 - 0x0000)
struct ABP_P0000_AfterImage_C_IAfterImage_SpawnAfterImageMesh final
{
public:
	class AAfterImageMesh_C*                      AfterImageMesh;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_P0000_AfterImage_C_IAfterImage_SpawnAfterImageMesh;

// Function ABP_P0000_AfterImage.ABP_P0000_AfterImage_C.IAfterImage_GetAfterImageInfo
// 0x0090 (0x0090 - 0x0000)
struct ABP_P0000_AfterImage_C_IAfterImage_GetAfterImageInfo final
{
public:
	float                                         PassTime;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValidInfo;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBST_AfterImageInfo                   AfterImageInfo;                                    // 0x0010(0x0040)(Parm, OutParm, NoDestructor)
	struct FPoseSnapshot                          Snapshot_0;                                        // 0x0050(0x0038)(Parm, OutParm)
};
DUMPER7_ASSERTS_ABP_P0000_AfterImage_C_IAfterImage_GetAfterImageInfo;

}

