#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_N2004

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_N2004.ABP_N2004_C
// 0x2050 (0x2E90 - 0x0E40)
class UABP_N2004_C final : public UPBAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_A505563B423805972E64A38153C23D3A; // 0x0E48(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2688A6CC404638B54C33309BC8FA6633; // 0x0E68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54F0C0E142A9A0E0B06F4AAE3EF6FEE0; // 0x0E90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1DA3564E4903894903B62DBA711F7B1A; // 0x0EB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4E6E1EEB45F02411BE3725A531EA7C7D; // 0x0EE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7F22F89E4930B6A63595298D8073204F; // 0x0F08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F930A2EA4AB1CBB954F272BEA24DE744; // 0x0F30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E955B3FE4A2414EFB9DAFBBFA407D03E; // 0x0F58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6AF722F8435F940DE7DA5494494FE3D5; // 0x0F80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A40A191E4CBBBD1FCAC5C58C47605603; // 0x0FA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BDD62AA740639999116B039266EB99FF; // 0x0FD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E37DDF414951F99BD0593EAF5A729464; // 0x0FF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9AFB5D2F4577B79CCA22B2B89EFDEED1; // 0x1020(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C795D02F4EAB7FAF97CF3FA8C7019FCD; // 0x1048(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F3EBB08341F27EB7A1F867989E0CBB2F; // 0x1070(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2B358F634A1C613292CCA78E0B880621; // 0x1098(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8B7A8F65463087D2170CB2A6FECB6C00; // 0x10C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D2E326EB4390502F920E89A24C23F671; // 0x10E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_481C70BA4EE21B87920777B90F6DEB34; // 0x1110(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DF20754E4E1F005215FCD09D7ED6EA72; // 0x1138(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C7A32F564D6E3BB08B8E95B373830286; // 0x1160(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50832EBB4D3A506847E7C097069E7DF0; // 0x1188(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4DE4E025408C6D89FC7E51B8B258EC62; // 0x11B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5BFB76A6441ED774CFBDC9B5DF6016E9; // 0x11D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D6A3098F4553BFF92AF4579B5AC7C825; // 0x1200(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F3F28D4442D5235E57A0E28EF537F0C5; // 0x1228(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5D533CF44E11140F312FCF9599630D7C; // 0x1250(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_CA52A74949BA139202C43298AA692BFA; // 0x1278(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F86AEF3C451D766BBFF78CAF7A61BB30; // 0x12A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_00358A5344352365AF557E8D00783E61; // 0x12C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F1F714F642137861B7F68BB586E8FFDC; // 0x12F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_319119F940B514F43A4765AF7FF21482; // 0x1318(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89FD2D414F56E515D7843593590199BB; // 0x1340(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4747B53D423600A5A17F94B16DC4DD87; // 0x1368(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8576F6E3416CC646CDF633A7A7932680; // 0x1390(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BA15D8784DB41FBC11020B97C64BDB94; // 0x13B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_607AF4B7428C6B42FEF17680A3B98CE1; // 0x13E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5AB87A2649DA9C19B3E984A0179D6C3B; // 0x1408(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C91D1EDD4594C86EBE3DD390F9DD5366; // 0x1430(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_075984D946DB7DE0E044C5A567CF1A8F; // 0x14A8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F300B258474F79F620D900BD3D83B4A7; // 0x14C8(0x0078)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_71EBE15D43CE3CA9E4CF6FBE91465284; // 0x1540(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7C982EEC43149D554EB186ADADA6F432; // 0x15E0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_CA96F0D74DDEFE6F18FC88BD31730A53; // 0x1658(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A8D339D74D2D2CB617C19A977F0D5884; // 0x1678(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5FFC6C054A1760244490E2A9CDE54D7A; // 0x16A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8AFF56784188E5CEFAD0068C368D638A; // 0x16C8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2237BF29447DA48E532C1690694F9D97; // 0x16F0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_EB954BB74997FD468CC9CEBBF9B1D4B9; // 0x1768(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9C4A070944013C42A91CCAB25DE9DAD5; // 0x1788(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1E2891574E390BEACEADC4A72BF153CD; // 0x1800(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3BB0E5C1450CEB0B8358BB9A9D3AB98B; // 0x1820(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_89B658A84632329842199495F2D7B658; // 0x1898(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7A0B465D4E3F58EBC4B3748FBE8D298A; // 0x18B8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E58A55704FB632179CF51B95A3347CE9; // 0x1980(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73F56A464538E26B5AC5C885F66A4B59; // 0x19A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_347B4C044670965526806DBCB7DB2B59; // 0x19C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3F3016EB4C64017ABB4BAA90C023837B; // 0x19F0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A6B091B742D1EEC0EDD1A49556C93D3B; // 0x1A18(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19E175104A97C5BA3E90D9B6CD9860BC; // 0x1A90(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_230E67454EE531C0C89535940007694E; // 0x1AB0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_EF4F0CD24EC68354FF912588DF785DE8; // 0x1B28(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5D5225974807F67270D0B4BC7A35ECB5; // 0x1B48(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_785BC6564E9E7FE675E1739CB2EFC991; // 0x1BC0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6A8D9C9749363DB2CCF6EDB43E51283D; // 0x1BE0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_DD62A1A941C9D98A39F57C90D85A6271; // 0x1CA8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DE708E51460F2E12163733A4B17CE226; // 0x1CC8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A211FB5744E10762B6C5CB91553BCB07; // 0x1D40(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A060310F48740E07D21715B5F9329DFE; // 0x1D60(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E858AFF9439078F7632A1CA2C9585034; // 0x1DD8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9D91E39D47A800C768FBD7816459153E; // 0x1DF8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3D05029E46E9B6FB6D9A9FADC74D0993; // 0x1E70(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_ABEA340941BC53836A36BCB5CD07F1E9; // 0x1E90(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_95209E3E4AFA3DA7A81B5DBB71CC81F6; // 0x1F08(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F4D531F64D765427CED9AAB902227121; // 0x1F28(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A3E58817449A45EA359365A5A0B95839; // 0x1FA0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3917279F489F54CA26F18FB486D2F334; // 0x1FC0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A030F13745A81C9577860A81B9680BFE; // 0x2038(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_BC350E774B86B8569C32BE93808A19C1; // 0x2058(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_E495C5F941247BC3E116FAB7F7239F21; // 0x20D0(0x00A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_0F13801D4CDEA5CFCD6C59B89C1B3285; // 0x2170(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6FB644DC415E07677CBF8BA95EFAD6D0; // 0x2190(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_D235A54F44E77CC14297E59149C9F7F2; // 0x21B0(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_878800684B54D84D882E8388E055D38F; // 0x22B8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9FACB576468CEABF17B445B088CA56E6; // 0x2330(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DD553F1D44DA90E5F7EA499E8CF31E1D; // 0x23A8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3DB486AE45725289EFCB66A415189B9C; // 0x2420(0x0078)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_5F6FAD7046837128CA4FBF9BA387C113; // 0x2498(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2F3C44034274AC89E13C15A33BE80147; // 0x2548(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_627EE7F348BDFEF1C142A8A5C76D6CAD; // 0x2568(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_771AC2A84FF090A0ED18239DF3ED1E98; // 0x25E0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4FFB8981489F70B8199F3EB471AD8671; // 0x2600(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_FFC1DE18434CFD90E2CC85AA3D12AE38; // 0x2678(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6FEA655945FD9D4E69D1B7BB115B0398; // 0x2698(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64991E0947B80F2B52363199B4C0FA76; // 0x26C0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D86F5C5E4509B9F6801B56B5359E92BE; // 0x26E8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_C77ED09443B643AB3CB8F5A0266D0D8D; // 0x2760(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_ECDC48EC40EDF97B56226EB47659242A; // 0x2780(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A68E9CFD4D3C6502035EF5BF4724F84D; // 0x27F8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_E70F85B04F0359046FE5A991FEFF238E; // 0x2818(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4C0D978C42AD478CE17D5390E1F02D23; // 0x28E0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3F83732745499ADD3FA6BF8344D50DE0; // 0x2900(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9CA6BE54491DA04AFF053BBF0EAB858C; // 0x2978(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5F4887D644A70FBEBFFE9293AEC94FB6; // 0x2998(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5F4DAA3041EA9B4C94756285248FBE6B; // 0x2A10(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0F4827AF499EBBF71EA90E83BABE5A34; // 0x2A30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AF19881A4BA2FE8B670FB28F9D099682; // 0x2A58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FBC74CC7484D877BBA0CF7BE59586341; // 0x2A80(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5286482F4877E2775A7E259F8C54BEF5; // 0x2AA8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_74ED83FC427E8931BF656F9173CFFDA6; // 0x2B20(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_135A95F946A431088508E8B1E1E00079; // 0x2B40(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_66F01A414C0BBDB4E1489A9A74CC2053; // 0x2BB8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B9933CAB4BE50855A8E4B9A113DA821A; // 0x2BD8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_F0DEEBFB416081AA8B85949422FE6F99; // 0x2C50(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_562BC1734E941AA5C2447E8C4A5D7008; // 0x2C70(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_444B9974401EDB9903D31EA4CB07C869; // 0x2D38(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24BB1784455E816415287D84C33D2F8B; // 0x2D58(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_C06F531F462453082F597CB650B4EDBF; // 0x2D80(0x00C8)()
	struct FAnimNode_Mirroring                    AnimGraphNode_Mirroring_78638478458D2FCB0F7698A5A8D001A6; // 0x2E48(0x0030)()
	class APB_Chr_Root_C*                         ChrIns;                                            // 0x2E78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Init;                                              // 0x2E80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_N2004(int32 EntryPoint);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_BlendListByBool_E495C5F941247BC3E116FAB7F7239F21();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_BlendListByEnum_5F6FAD7046837128CA4FBF9BA387C113();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_BlendListByInt_71EBE15D43CE3CA9E4CF6FBE91465284();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_Mirroring_78638478458D2FCB0F7698A5A8D001A6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_ModifyBone_D235A54F44E77CC14297E59149C9F7F2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_00358A5344352365AF557E8D00783E61();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_0F4827AF499EBBF71EA90E83BABE5A34();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_319119F940B514F43A4765AF7FF21482();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_3F3016EB4C64017ABB4BAA90C023837B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_4747B53D423600A5A17F94B16DC4DD87();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_4DE4E025408C6D89FC7E51B8B258EC62();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_50832EBB4D3A506847E7C097069E7DF0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_5AB87A2649DA9C19B3E984A0179D6C3B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_5BFB76A6441ED774CFBDC9B5DF6016E9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_5D533CF44E11140F312FCF9599630D7C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_607AF4B7428C6B42FEF17680A3B98CE1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_6FEA655945FD9D4E69D1B7BB115B0398();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_73F56A464538E26B5AC5C885F66A4B59();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_8576F6E3416CC646CDF633A7A7932680();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_89FD2D414F56E515D7843593590199BB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_8AFF56784188E5CEFAD0068C368D638A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_A8D339D74D2D2CB617C19A977F0D5884();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_BA15D8784DB41FBC11020B97C64BDB94();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_CA52A74949BA139202C43298AA692BFA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_D6A3098F4553BFF92AF4579B5AC7C825();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_F1F714F642137861B7F68BB586E8FFDC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_F3F28D4442D5235E57A0E28EF537F0C5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_F86AEF3C451D766BBFF78CAF7A61BB30();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_N2004_AnimGraphNode_TransitionResult_FBC74CC7484D877BBA0CF7BE59586341();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_N2004_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_N2004_C")
	}
	static class UABP_N2004_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_N2004_C>();
	}
};
DUMPER7_ASSERTS_UABP_N2004_C;

}

