#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: APB_Bag01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass APB_Bag01.APB_Bag01_C
// 0x04E0 (0x0EC0 - 0x09E0)
class UAPB_Bag01_C final : public UPBEventAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_5E87FDC54F438ACCFA473EAF14DD0743; // 0x09E8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A45414434B9F2E7E975CB89A7DF6AF5B; // 0x0A08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C1B5E90347E020E41F6487A6E7034E50; // 0x0A30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86FA611943BD322C8476B18CD066EBDD; // 0x0A58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2A61A09F42D228D8A4E090A9F44ABCAF; // 0x0A80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9CC6ABDE43ACFFA4D05355B61E027578; // 0x0AA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4BEB081D493C357712D6B9BCDB303A45; // 0x0AD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8CDCFA194A3D271E4FFCA78CEEC4892B; // 0x0AF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60AF03584D366D4560D9C6A76B5A2EFE; // 0x0B20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D3D3130046123F4BAB6C7EA78C471049; // 0x0B48(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A71F1DD8419C7687C2D30EA2BB03A882; // 0x0B70(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_BE20F35B4430F2897C666C93C5ACF5D3; // 0x0BE8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_601931A042068EF5F1E35E8FECAAFA52; // 0x0C08(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_96001B47421490CDCA056987F98CA384; // 0x0C80(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FB8D9AC1489F49203612FBAE88A57CF1; // 0x0CA0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_87AA96EB475E5E6A992E4C9C46A485ED; // 0x0D18(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B15242C54CA4CC09E4E6ED844C0AA060; // 0x0D38(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_D75F0BCD40C0878236B1B1816C926F38; // 0x0DB0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_750FFFF9476D89A18C3DF793C18A441E; // 0x0DD0(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_A99A9ED24DB8127A307B79A296C46185; // 0x0DF8(0x00C8)()

public:
	void ExecuteUbergraph_APB_Bag01(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_APB_Bag01_AnimGraphNode_TransitionResult_4BEB081D493C357712D6B9BCDB303A45();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_APB_Bag01_AnimGraphNode_TransitionResult_60AF03584D366D4560D9C6A76B5A2EFE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_APB_Bag01_AnimGraphNode_TransitionResult_8CDCFA194A3D271E4FFCA78CEEC4892B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_APB_Bag01_AnimGraphNode_TransitionResult_D3D3130046123F4BAB6C7EA78C471049();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("APB_Bag01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"APB_Bag01_C")
	}
	static class UAPB_Bag01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAPB_Bag01_C>();
	}
};
DUMPER7_ASSERTS_UAPB_Bag01_C;

}

