#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveCraftIngredient

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "IngredientData_structs.hpp"


namespace SDK::Params
{

// Function ArchiveCraftIngredient.ArchiveCraftIngredient_C.ExecuteUbergraph_ArchiveCraftIngredient
// 0x0004 (0x0004 - 0x0000)
struct ArchiveCraftIngredient_C_ExecuteUbergraph_ArchiveCraftIngredient final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveCraftIngredient_C_ExecuteUbergraph_ArchiveCraftIngredient;

// Function ArchiveCraftIngredient.ArchiveCraftIngredient_C.SetIngredientData
// 0x0110 (0x0110 - 0x0000)
struct ArchiveCraftIngredient_C_SetIngredientData final
{
public:
	struct FIngredientData                        input_data;                                        // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBItemCatalogData                     item_data;                                         // 0x0018(0x0078)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemCatalogData                     CallFunc_GetItemDataById_itemData;                 // 0x0098(0x0078)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveCraftIngredient_C_SetIngredientData;

// Function ArchiveCraftIngredient.ArchiveCraftIngredient_C.SetNameText
// 0x0018 (0x0018 - 0x0000)
struct ArchiveCraftIngredient_C_SetNameText final
{
public:
	class FText                                   input_text;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_ArchiveCraftIngredient_C_SetNameText;

// Function ArchiveCraftIngredient.ArchiveCraftIngredient_C.SetUseValue
// 0x0020 (0x0020 - 0x0000)
struct ArchiveCraftIngredient_C_SetUseValue final
{
public:
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
DUMPER7_ASSERTS_ArchiveCraftIngredient_C_SetUseValue;

// Function ArchiveCraftIngredient.ArchiveCraftIngredient_C.SetItemIcon
// 0x00F0 (0x00F0 - 0x0000)
struct ArchiveCraftIngredient_C_SetItemIcon final
{
public:
	struct FPBItemCatalogData                     item_data;                                         // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FPBItemCatalogData                     Data;                                              // 0x0078(0x0078)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveCraftIngredient_C_SetItemIcon;

// Function ArchiveCraftIngredient.ArchiveCraftIngredient_C.SetItemName
// 0x00F0 (0x00F0 - 0x0000)
struct ArchiveCraftIngredient_C_SetItemName final
{
public:
	struct FPBItemCatalogData                     input_data;                                        // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FPBItemCatalogData                     item_data;                                         // 0x0078(0x0078)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveCraftIngredient_C_SetItemName;

}

