#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveEnemyListItem

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ArchiveEnemyListItem.ArchiveEnemyListItem_C.ExecuteUbergraph_ArchiveEnemyListItem
// 0x0004 (0x0004 - 0x0000)
struct ArchiveEnemyListItem_C_ExecuteUbergraph_ArchiveEnemyListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEnemyListItem_C_ExecuteUbergraph_ArchiveEnemyListItem;

// Function ArchiveEnemyListItem.ArchiveEnemyListItem_C.SetNewIcon
// 0x0001 (0x0001 - 0x0000)
struct ArchiveEnemyListItem_C_SetNewIcon final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEnemyListItem_C_SetNewIcon;

// Function ArchiveEnemyListItem.ArchiveEnemyListItem_C.SetListEnable
// 0x0001 (0x0001 - 0x0000)
struct ArchiveEnemyListItem_C_SetListEnable final
{
public:
	bool                                          IsEnabled_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEnemyListItem_C_SetListEnable;

// Function ArchiveEnemyListItem.ArchiveEnemyListItem_C.UnsetNewIcon
// 0x0090 (0x0090 - 0x0000)
struct ArchiveEnemyListItem_C_UnsetNewIcon final
{
public:
	class UPBCharacterInventoryComponent*         inventry;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemCatalogData                     CallFunc_GetItemDataById_itemData;                 // 0x0008(0x0078)(HasGetValueTypeHash)
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBBaseCharacter*                       CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEnemyListItem_C_UnsetNewIcon;

// Function ArchiveEnemyListItem.ArchiveEnemyListItem_C.SetListParam
// 0x0120 (0x0120 - 0x0000)
struct ArchiveEnemyListItem_C_SetListParam final
{
public:
	int32                                         input_index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBArchiveEnemyCatalogData             input_data;                                        // 0x0008(0x0110)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         idx;                                               // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEnemyListItem_C_SetListParam;

// Function ArchiveEnemyListItem.ArchiveEnemyListItem_C.SetDispCursor
// 0x0010 (0x0010 - 0x0000)
struct ArchiveEnemyListItem_C_SetDispCursor final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffChoiceBP_C*                         NewLocalVar_1;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEnemyListItem_C_SetDispCursor;

// Function ArchiveEnemyListItem.ArchiveEnemyListItem_C.SetNameText
// 0x0030 (0x0030 - 0x0000)
struct ArchiveEnemyListItem_C_SetNameText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   txt;                                               // 0x0018(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_ArchiveEnemyListItem_C_SetNameText;

// Function ArchiveEnemyListItem.ArchiveEnemyListItem_C.GetDescription
// 0x0018 (0x0018 - 0x0000)
struct ArchiveEnemyListItem_C_GetDescription final
{
public:
	class FText                                   Explain;                                           // 0x0000(0x0018)(Parm, OutParm)
};
DUMPER7_ASSERTS_ArchiveEnemyListItem_C_GetDescription;

// Function ArchiveEnemyListItem.ArchiveEnemyListItem_C.GetDropItemData
// 0x02D8 (0x02D8 - 0x0000)
struct ArchiveEnemyListItem_C_GetDropItemData final
{
public:
	struct FPBDropCatalogData                     ReturnValue;                                       // 0x0000(0x00F0)(Parm, OutParm, ReturnParm)
	struct FPBDropCatalogData                     NewLocalVar_0;                                     // 0x00F0(0x00F0)(Edit, BlueprintVisible)
	class UPBArchiveManager*                      CallFunc_GetArchiveManager_ReturnValue;            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBDropCatalogData                     CallFunc_GetEnemyDropCatalogData_ReturnValue;      // 0x01E8(0x00F0)()
};
DUMPER7_ASSERTS_ArchiveEnemyListItem_C_GetDropItemData;

// Function ArchiveEnemyListItem.ArchiveEnemyListItem_C.GetEnemyData
// 0x0110 (0x0110 - 0x0000)
struct ArchiveEnemyListItem_C_GetEnemyData final
{
public:
	struct FPBArchiveEnemyCatalogData             EnemyData_0;                                       // 0x0000(0x0110)(Parm, OutParm)
};
DUMPER7_ASSERTS_ArchiveEnemyListItem_C_GetEnemyData;

// Function ArchiveEnemyListItem.ArchiveEnemyListItem_C.SetDemonsName
// 0x0108 (0x0108 - 0x0000)
struct ArchiveEnemyListItem_C_SetDemonsName final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   text;                                              // 0x0008(0x0018)(Edit, BlueprintVisible)
	class FText                                   Num;                                               // 0x0020(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsUnlockList_is_unlock;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0080(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00F0(0x0018)()
};
DUMPER7_ASSERTS_ArchiveEnemyListItem_C_SetDemonsName;

// Function ArchiveEnemyListItem.ArchiveEnemyListItem_C.SetShardIcon
// 0x02E0 (0x02E0 - 0x0000)
struct ArchiveEnemyListItem_C_SetShardIcon final
{
public:
	struct FPBItemCatalogData                     item_data;                                         // 0x0000(0x0078)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FPBDropCatalogData                     drop_data;                                         // 0x0078(0x00F0)(Edit, BlueprintVisible)
	EPBGameModeType                               CallFunc_GetGameModeType_ReturnValue;              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBDropCatalogData                     CallFunc_GetDropItemData_ReturnValue;              // 0x0170(0x00F0)()
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemCatalogData                     CallFunc_GetItemDataById_itemData;                 // 0x0268(0x0078)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEnemyListItem_C_SetShardIcon;

// Function ArchiveEnemyListItem.ArchiveEnemyListItem_C.IsUnlockList
// 0x0001 (0x0001 - 0x0000)
struct ArchiveEnemyListItem_C_IsUnlockList final
{
public:
	bool                                          is_unlock;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveEnemyListItem_C_IsUnlockList;

}

