#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveContentsBlock

#include "Basic.hpp"

#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function ArchiveContentsBlock.ArchiveContentsBlock_C.ExecuteUbergraph_ArchiveContentsBlock
// 0x0008 (0x0008 - 0x0000)
struct ArchiveContentsBlock_C_ExecuteUbergraph_ArchiveContentsBlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveContentsBlock_C_ExecuteUbergraph_ArchiveContentsBlock;

// Function ArchiveContentsBlock.ArchiveContentsBlock_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ArchiveContentsBlock_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveContentsBlock_C_PreConstruct;

// Function ArchiveContentsBlock.ArchiveContentsBlock_C.SetTitle
// 0x0018 (0x0018 - 0x0000)
struct ArchiveContentsBlock_C_SetTitle final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_ArchiveContentsBlock_C_SetTitle;

// Function ArchiveContentsBlock.ArchiveContentsBlock_C.SetContentsText
// 0x0028 (0x0028 - 0x0000)
struct ArchiveContentsBlock_C_SetContentsText final
{
public:
	class FText                                   Content_0;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveContentsBlock_C_SetContentsText;

// Function ArchiveContentsBlock.ArchiveContentsBlock_C.SetContentsJustify
// 0x0001 (0x0001 - 0x0000)
struct ArchiveContentsBlock_C_SetContentsJustify final
{
public:
	ETextJustify                                  Justification;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveContentsBlock_C_SetContentsJustify;

}

