#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveCollectRate_S

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveCollectRate_S.ArchiveCollectRate_S_C
// 0x0050 (0x02A8 - 0x0258)
class UArchiveCollectRate_S_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 icon;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Rate;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   text;                                              // 0x0278(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           Color;                                             // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RateValue;                                         // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ArchiveCollectRate_S(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void Setup(const class FText& text_0, const struct FLinearColor& Color_0, float Rate_0);
	void SetNameText(const class FText& NameText);
	void SetNameColor(const struct FLinearColor& Color_0);
	void SetRate(float Rate_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveCollectRate_S_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveCollectRate_S_C")
	}
	static class UArchiveCollectRate_S_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveCollectRate_S_C>();
	}
};
DUMPER7_ASSERTS_UArchiveCollectRate_S_C;

}

