#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveCraftIngredient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "IngredientData_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveCraftIngredient.ArchiveCraftIngredient_C
// 0x0058 (0x02B0 - 0x0258)
class UArchiveCraftIngredient_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 back;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonItemIcon_C*                      icon;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Number;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   NameText;                                          // 0x0280(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Value;                                             // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIngredientData                        IngredientData;                                    // 0x029C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ArchiveCraftIngredient(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void SetIngredientData(const struct FIngredientData& input_data);
	void SetNameText(const class FText& input_text);
	void SetUseValue();
	void SetItemIcon(const struct FPBItemCatalogData& item_data);
	void SetItemName(const struct FPBItemCatalogData& input_data);
	void SetItemValue();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveCraftIngredient_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveCraftIngredient_C")
	}
	static class UArchiveCraftIngredient_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveCraftIngredient_C>();
	}
};
DUMPER7_ASSERTS_UArchiveCraftIngredient_C;

}

