#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveIconContentsBlock

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function ArchiveIconContentsBlock.ArchiveIconContentsBlock_C.ExecuteUbergraph_ArchiveIconContentsBlock
// 0x0008 (0x0008 - 0x0000)
struct ArchiveIconContentsBlock_C_ExecuteUbergraph_ArchiveIconContentsBlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveIconContentsBlock_C_ExecuteUbergraph_ArchiveIconContentsBlock;

// Function ArchiveIconContentsBlock.ArchiveIconContentsBlock_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ArchiveIconContentsBlock_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveIconContentsBlock_C_PreConstruct;

// Function ArchiveIconContentsBlock.ArchiveIconContentsBlock_C.SetTitle
// 0x0018 (0x0018 - 0x0000)
struct ArchiveIconContentsBlock_C_SetTitle final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_ArchiveIconContentsBlock_C_SetTitle;

// Function ArchiveIconContentsBlock.ArchiveIconContentsBlock_C.SetContentsText
// 0x0028 (0x0028 - 0x0000)
struct ArchiveIconContentsBlock_C_SetContentsText final
{
public:
	class FText                                   Content_0;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveIconContentsBlock_C_SetContentsText;

// Function ArchiveIconContentsBlock.ArchiveIconContentsBlock_C.SetContentsJustify
// 0x0001 (0x0001 - 0x0000)
struct ArchiveIconContentsBlock_C_SetContentsJustify final
{
public:
	ETextJustify                                  Justification;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveIconContentsBlock_C_SetContentsJustify;

// Function ArchiveIconContentsBlock.ArchiveIconContentsBlock_C.SetIconImage
// 0x0078 (0x0078 - 0x0000)
struct ArchiveIconContentsBlock_C_SetIconImage final
{
public:
	struct FPBItemCatalogData                     itemData;                                          // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveIconContentsBlock_C_SetIconImage;

}

