#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveHistoryListItem

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ArchiveHistoryListItem.ArchiveHistoryListItem_C.ExecuteUbergraph_ArchiveHistoryListItem
// 0x0004 (0x0004 - 0x0000)
struct ArchiveHistoryListItem_C_ExecuteUbergraph_ArchiveHistoryListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveHistoryListItem_C_ExecuteUbergraph_ArchiveHistoryListItem;

// Function ArchiveHistoryListItem.ArchiveHistoryListItem_C.SetNewIcon
// 0x0001 (0x0001 - 0x0000)
struct ArchiveHistoryListItem_C_SetNewIcon final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveHistoryListItem_C_SetNewIcon;

// Function ArchiveHistoryListItem.ArchiveHistoryListItem_C.SetListEnable
// 0x0001 (0x0001 - 0x0000)
struct ArchiveHistoryListItem_C_SetListEnable final
{
public:
	bool                                          IsEnabled_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveHistoryListItem_C_SetListEnable;

// Function ArchiveHistoryListItem.ArchiveHistoryListItem_C.UnsetNewIcon
// 0x0090 (0x0090 - 0x0000)
struct ArchiveHistoryListItem_C_UnsetNewIcon final
{
public:
	class UPBCharacterInventoryComponent*         inventry;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemCatalogData                     CallFunc_GetItemDataById_itemData;                 // 0x0008(0x0078)(HasGetValueTypeHash)
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBBaseCharacter*                       CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveHistoryListItem_C_UnsetNewIcon;

// Function ArchiveHistoryListItem.ArchiveHistoryListItem_C.SetVisibleNum
// 0x0002 (0x0002 - 0x0000)
struct ArchiveHistoryListItem_C_SetVisibleNum final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              NumVisible;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveHistoryListItem_C_SetVisibleNum;

// Function ArchiveHistoryListItem.ArchiveHistoryListItem_C.SetDispCursor
// 0x0010 (0x0010 - 0x0000)
struct ArchiveHistoryListItem_C_SetDispCursor final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffChoiceBP_C*                         NewLocalVar_1;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveHistoryListItem_C_SetDispCursor;

// Function ArchiveHistoryListItem.ArchiveHistoryListItem_C.SetAchiveData
// 0x0050 (0x0050 - 0x0000)
struct ArchiveHistoryListItem_C_SetAchiveData final
{
public:
	struct FPBArchiveAchiveCatalogData            input_data;                                        // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_ArchiveHistoryListItem_C_SetAchiveData;

// Function ArchiveHistoryListItem.ArchiveHistoryListItem_C.SetNameText
// 0x0018 (0x0018 - 0x0000)
struct ArchiveHistoryListItem_C_SetNameText final
{
public:
	class FText                                   input_text;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_ArchiveHistoryListItem_C_SetNameText;

// Function ArchiveHistoryListItem.ArchiveHistoryListItem_C.SetNumber
// 0x0190 (0x0190 - 0x0000)
struct ArchiveHistoryListItem_C_SetNumber final
{
public:
	class FText                                   input_text;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EArchiveUnitType                              Category;                                          // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EArchiveUnitType, class FText>           unit_map;                                          // 0x0020(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          isInfinite;                                        // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EArchiveUnitType, class FText>           K2Node_MakeVariable_MakeVariableOutput;            // 0x0078(0x0050)(ZeroConstructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0108(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0128(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0178(0x0018)()
};
DUMPER7_ASSERTS_ArchiveHistoryListItem_C_SetNumber;

// Function ArchiveHistoryListItem.ArchiveHistoryListItem_C.GetRecordValue
// 0x0038 (0x0038 - 0x0000)
struct ArchiveHistoryListItem_C_GetRecordValue final
{
public:
	int32                                         input_index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Output;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Records;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class UPBGameRecordManager*                   CallFunc_GetGameRecordManager_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 CallFunc_GetAchiveValue_Array;                     // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
};
DUMPER7_ASSERTS_ArchiveHistoryListItem_C_GetRecordValue;

}

