#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveTipsListTab

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function ArchiveTipsListTab.ArchiveTipsListTab_C.ExecuteUbergraph_ArchiveTipsListTab
// 0x0004 (0x0004 - 0x0000)
struct ArchiveTipsListTab_C_ExecuteUbergraph_ArchiveTipsListTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsListTab_C_ExecuteUbergraph_ArchiveTipsListTab;

// Function ArchiveTipsListTab.ArchiveTipsListTab_C.Initialize
// 0x0018 (0x0018 - 0x0000)
struct ArchiveTipsListTab_C_Initialize final
{
public:
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCommonTabMenu_C*>               K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
};
DUMPER7_ASSERTS_ArchiveTipsListTab_C_Initialize;

// Function ArchiveTipsListTab.ArchiveTipsListTab_C.Setup
// 0x0008 (0x0008 - 0x0000)
struct ArchiveTipsListTab_C_Setup final
{
public:
	class UCommonTabMenu_C*                       CallFunc_GetSelectTab_Output;                      // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsListTab_C_Setup;

// Function ArchiveTipsListTab.ArchiveTipsListTab_C.GetTab
// 0x0020 (0x0020 - 0x0000)
struct ArchiveTipsListTab_C_GetTab final
{
public:
	int32                                         Param_Index_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTabMenu_C*                       Output;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonTabMenu_C*                       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsListTab_C_GetTab;

// Function ArchiveTipsListTab.ArchiveTipsListTab_C.GetSelectTab
// 0x0010 (0x0010 - 0x0000)
struct ArchiveTipsListTab_C_GetSelectTab final
{
public:
	class UCommonTabMenu_C*                       Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonTabMenu_C*                       CallFunc_GetTab_Output;                            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsListTab_C_GetSelectTab;

// Function ArchiveTipsListTab.ArchiveTipsListTab_C.SwitchTab
// 0x0020 (0x0020 - 0x0000)
struct ArchiveTipsListTab_C_SwitchTab final
{
public:
	int32                                         Move;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonTabMenu_C*                       CallFunc_GetSelectTab_Output;                      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonTabMenu_C*                       CallFunc_GetSelectTab_Output1;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddValueAndLoop_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveTipsListTab_C_SwitchTab;

// Function ArchiveTipsListTab.ArchiveTipsListTab_C.SelectButton
// 0x0008 (0x0008 - 0x0000)
struct ArchiveTipsListTab_C_SelectButton final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveTipsListTab_C_SelectButton;

// Function ArchiveTipsListTab.ArchiveTipsListTab_C.GetTabCategory
// 0x00C8 (0x00C8 - 0x0000)
struct ArchiveTipsListTab_C_GetTabCategory final
{
public:
	ETipsCategories                               Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Code;                                              // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, ETipsCategories>            Map;                                               // 0x0010(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	TMap<class FName, ETipsCategories>            K2Node_MakeVariable_MakeVariableOutput;            // 0x0060(0x0050)(ZeroConstructor)
	class UCommonTabMenu_C*                       CallFunc_GetSelectTab_Output;                      // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetUniqueCode_Output;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETipsCategories                               CallFunc_Map_Find_Value;                           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveTipsListTab_C_GetTabCategory;

}

