#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveCraftRecipeDetail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ArchiveCraftRecipeDetail.ArchiveCraftRecipeDetail_C
// 0x00D0 (0x0328 - 0x0258)
class UArchiveCraftRecipeDetail_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img;                                               // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveCraftIngredient_C*              Ingredient01;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveCraftIngredient_C*              Ingredient02;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveCraftIngredient_C*              Ingredient03;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveCraftIngredient_C*              Ingredient04;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBlockTitle_C*                    Title;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPBArchiveCraftCatalogData             RecipeData;                                        // 0x0290(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UArchiveCraftIngredient_C*>      Ingredients;                                       // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ArchiveCraftRecipeDetail(int32 EntryPoint);
	void Construct();
	void Initialize();
	void SetCraftData(const struct FPBArchiveCraftCatalogData& input_data);
	void Setup();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ArchiveCraftRecipeDetail_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArchiveCraftRecipeDetail_C")
	}
	static class UArchiveCraftRecipeDetail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArchiveCraftRecipeDetail_C>();
	}
};
DUMPER7_ASSERTS_UArchiveCraftRecipeDetail_C;

}

