#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveDropShardWindow

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function ArchiveDropShardWindow.ArchiveDropShardWindow_C.ExecuteUbergraph_ArchiveDropShardWindow
// 0x0004 (0x0004 - 0x0000)
struct ArchiveDropShardWindow_C_ExecuteUbergraph_ArchiveDropShardWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveDropShardWindow_C_ExecuteUbergraph_ArchiveDropShardWindow;

// Function ArchiveDropShardWindow.ArchiveDropShardWindow_C.SetDropShard
// 0x02E0 (0x02E0 - 0x0000)
struct ArchiveDropShardWindow_C_SetDropShard final
{
public:
	struct FPBDropCatalogData                     Input;                                             // 0x0000(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPBItemCatalogData                     item_data;                                         // 0x00F0(0x0078)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FPBDropCatalogData                     drop_data;                                         // 0x0168(0x00F0)(Edit, BlueprintVisible)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue1;           // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25B[0x5];                                      // 0x025B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemCatalogData                     CallFunc_GetItemDataById_itemData;                 // 0x0268(0x0078)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveDropShardWindow_C_SetDropShard;

// Function ArchiveDropShardWindow.ArchiveDropShardWindow_C.SetShardName
// 0x0030 (0x0030 - 0x0000)
struct ArchiveDropShardWindow_C_SetShardName final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   text;                                              // 0x0018(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_ArchiveDropShardWindow_C_SetShardName;

}

