#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveEnemyDropItem

#include "Basic.hpp"

#include "DropItemData_structs.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function ArchiveEnemyDropItem.ArchiveEnemyDropItem_C.ExecuteUbergraph_ArchiveEnemyDropItem
// 0x0004 (0x0004 - 0x0000)
struct ArchiveEnemyDropItem_C_ExecuteUbergraph_ArchiveEnemyDropItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEnemyDropItem_C_ExecuteUbergraph_ArchiveEnemyDropItem;

// Function ArchiveEnemyDropItem.ArchiveEnemyDropItem_C.SetEnemyData
// 0x0398 (0x0398 - 0x0000)
struct ArchiveEnemyDropItem_C_SetEnemyData final
{
public:
	struct FPBArchiveEnemyCatalogData             input_data;                                        // 0x0000(0x0110)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         idx;                                               // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UArchiveEnemyResistChip_C*              Element;                                           // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBArchiveManager*                      CallFunc_GetArchiveManager_ReturnValue;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBGameModeType                               CallFunc_GetGameModeType_ReturnValue;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13B[0x5];                                      // 0x013B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBDropManager*                         CallFunc_GetDropManager_ReturnValue;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FName>                CallFunc_GetShardTableRandomizer_ReturnValue;      // 0x0148(0x0050)(ZeroConstructor)
	class FName                                   K2Node_Select_Default;                             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Map_Find_Value;                           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBArchiveManager*                      CallFunc_GetArchiveManager_ReturnValue1;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBDropCatalogData                     CallFunc_GetEnemyDropCatalogData_ReturnValue;      // 0x01B8(0x00F0)()
	struct FPBDropCatalogData                     CallFunc_GetEnemyDropCatalogData_ReturnValue1;     // 0x02A8(0x00F0)()
};
DUMPER7_ASSERTS_ArchiveEnemyDropItem_C_SetEnemyData;

// Function ArchiveEnemyDropItem.ArchiveEnemyDropItem_C.AddDropItemList
// 0x0080 (0x0080 - 0x0000)
struct ArchiveEnemyDropItem_C_AddDropItemList final
{
public:
	struct FDropItemData                          input_data;                                        // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UArchiveDropitemListItem_C*             list_item;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDropItemData                          item_data;                                         // 0x0038(0x0030)(Edit, BlueprintVisible)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArchiveDropitemListItem_C*             CallFunc_Create_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveEnemyDropItem_C_AddDropItemList;

// Function ArchiveEnemyDropItem.ArchiveEnemyDropItem_C.SetCommonIngredient
// 0x0060 (0x0060 - 0x0000)
struct ArchiveEnemyDropItem_C_SetCommonIngredient final
{
public:
	struct FDropItemData                          item_data;                                         // 0x0000(0x0030)(Edit, BlueprintVisible)
	struct FDropItemData                          K2Node_MakeStruct_DropItemData;                    // 0x0030(0x0030)()
};
DUMPER7_ASSERTS_ArchiveEnemyDropItem_C_SetCommonIngredient;

// Function ArchiveEnemyDropItem.ArchiveEnemyDropItem_C.SetCommonItem
// 0x0068 (0x0068 - 0x0000)
struct ArchiveEnemyDropItem_C_SetCommonItem final
{
public:
	class UArchiveDropitemListItem_C*             list_item;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDropItemData                          item_data;                                         // 0x0008(0x0030)(Edit, BlueprintVisible)
	struct FDropItemData                          K2Node_MakeStruct_DropItemData;                    // 0x0038(0x0030)()
};
DUMPER7_ASSERTS_ArchiveEnemyDropItem_C_SetCommonItem;

// Function ArchiveEnemyDropItem.ArchiveEnemyDropItem_C.SetDropShard
// 0x0080 (0x0080 - 0x0000)
struct ArchiveEnemyDropItem_C_SetDropShard final
{
public:
	class UArchiveDropitemListItem_C*             list_item;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDropItemData                          item_data;                                         // 0x0008(0x0030)(Edit, BlueprintVisible)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArchiveDropitemListItem_C*             CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDropItemData                          K2Node_MakeStruct_DropItemData;                    // 0x0050(0x0030)()
};
DUMPER7_ASSERTS_ArchiveEnemyDropItem_C_SetDropShard;

// Function ArchiveEnemyDropItem.ArchiveEnemyDropItem_C.SetRareIngredient
// 0x0060 (0x0060 - 0x0000)
struct ArchiveEnemyDropItem_C_SetRareIngredient final
{
public:
	struct FDropItemData                          item_data;                                         // 0x0000(0x0030)(Edit, BlueprintVisible)
	struct FDropItemData                          K2Node_MakeStruct_DropItemData;                    // 0x0030(0x0030)()
};
DUMPER7_ASSERTS_ArchiveEnemyDropItem_C_SetRareIngredient;

// Function ArchiveEnemyDropItem.ArchiveEnemyDropItem_C.SetRareItem
// 0x0068 (0x0068 - 0x0000)
struct ArchiveEnemyDropItem_C_SetRareItem final
{
public:
	class UArchiveDropitemListItem_C*             list_item;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDropItemData                          item_data;                                         // 0x0008(0x0030)(Edit, BlueprintVisible)
	struct FDropItemData                          K2Node_MakeStruct_DropItemData;                    // 0x0038(0x0030)()
};
DUMPER7_ASSERTS_ArchiveEnemyDropItem_C_SetRareItem;

}

