#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArchiveArtsMenu

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function ArchiveArtsMenu.ArchiveArtsMenu_C.ExecuteUbergraph_ArchiveArtsMenu
// 0x0020 (0x0020 - 0x0000)
struct ArchiveArtsMenu_C_ExecuteUbergraph_ArchiveArtsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> K2Node_Event_OnStepChanged; // 0x0008(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_ZOrder;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveArtsMenu_C_ExecuteUbergraph_ArchiveArtsMenu;

// Function ArchiveArtsMenu.ArchiveArtsMenu_C.Start
// 0x0014 (0x0014 - 0x0000)
struct ArchiveArtsMenu_C_Start final
{
public:
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> OnStepChanged; // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	int32                                         ZOrder;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveArtsMenu_C_Start;

// Function ArchiveArtsMenu.ArchiveArtsMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ArchiveArtsMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveArtsMenu_C_PreConstruct;

// Function ArchiveArtsMenu.ArchiveArtsMenu_C.Setup
// 0x0008 (0x0008 - 0x0000)
struct ArchiveArtsMenu_C_Setup final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveArtsMenu_C_Setup;

// Function ArchiveArtsMenu.ArchiveArtsMenu_C.OnStart
// 0x0008 (0x0008 - 0x0000)
struct ArchiveArtsMenu_C_OnStart final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveArtsMenu_C_OnStart;

// Function ArchiveArtsMenu.ArchiveArtsMenu_C.OnSelectMenu
// 0x0009 (0x0009 - 0x0000)
struct ArchiveArtsMenu_C_OnSelectMenu final
{
public:
	bool                                          CallFunc_IsListEmpty_IsListEmpty;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsListEmpty_IsListEmpty1;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsListEmpty_IsListEmpty2;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsListEmpty_IsListEmpty3;                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectRight_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectLeft_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectDown_ReturnValue;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectUp_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectCancel_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveArtsMenu_C_OnSelectMenu;

// Function ArchiveArtsMenu.ArchiveArtsMenu_C.OpenMenu
// 0x000C (0x000C - 0x0000)
struct ArchiveArtsMenu_C_OpenMenu final
{
public:
	EUserWidgetPriority                           set_priority;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         order;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArchiveArtsMenu_C_OpenMenu;

// Function ArchiveArtsMenu.ArchiveArtsMenu_C.UpdateExplanationText
// 0x0018 (0x0018 - 0x0000)
struct ArchiveArtsMenu_C_UpdateExplanationText final
{
public:
	class FText                                   CallFunc_GetSelectedExplanationText_explanationText; // 0x0000(0x0018)()
};
DUMPER7_ASSERTS_ArchiveArtsMenu_C_UpdateExplanationText;

// Function ArchiveArtsMenu.ArchiveArtsMenu_C.IsListEmpty
// 0x000C (0x000C - 0x0000)
struct ArchiveArtsMenu_C_IsListEmpty final
{
public:
	bool                                          IsListEmpty_0;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ArchiveArtsMenu_C_IsListEmpty;

}

