#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AugmentedReality

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "AugmentedReality_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class AugmentedReality.ARBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UARBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool AddManualEnvironmentCaptureProbe(const struct FVector& Location, const struct FVector& Extent);
	static class UARCandidateImage* AddRuntimeCandidateImage(class UARSessionConfig* SessionConfig, class UTexture2D* CandidateTexture, const class FString& FriendlyName, float PhysicalWidth);
	static void DebugDrawPin(class UARPin* ARPin, class UObject* WorldContextObject, const struct FLinearColor& Color, float Scale, float PersistForSeconds);
	static void DebugDrawTrackedGeometry(class UARTrackedGeometry* TrackedGeometry, class UObject* WorldContextObject, const struct FLinearColor& Color, float OutlineThickness, float PersistForSeconds);
	static TArray<class UARTrackedGeometry*> GetAllGeometries();
	static TArray<class UARPin*> GetAllPins();
	static TArray<class UAREnvironmentCaptureProbe*> GetAllTrackedEnvironmentCaptureProbes();
	static TArray<class UARTrackedImage*> GetAllTrackedImages();
	static TArray<class UARPlaneGeometry*> GetAllTrackedPlanes();
	static TArray<class UARTrackedPoint*> GetAllTrackedPoints();
	static struct FARSessionStatus GetARSessionStatus();
	static class UARTextureCameraDepth* GetCameraDepth();
	static class UARTextureCameraImage* GetCameraImage();
	static class UARLightEstimate* GetCurrentLightEstimate();
	static TArray<struct FVector> GetPointCloud();
	static class UARSessionConfig* GetSessionConfig();
	static TArray<struct FARVideoFormat> GetSupportedVideoFormats(EARSessionType SessionType);
	static EARTrackingQuality GetTrackingQuality();
	static EARWorldMappingState GetWorldMappingStatus();
	static bool IsSessionTypeSupported(EARSessionType SessionType);
	static TArray<struct FARTraceResult> LineTraceTrackedObjects(const struct FVector2D& ScreenCoord, bool bTestFeaturePoints, bool bTestGroundPlane, bool bTestPlaneExtents, bool bTestPlaneBoundaryPolygon);
	static TArray<struct FARTraceResult> LineTraceTrackedObjects3D(const struct FVector& Start, const struct FVector& End, bool bTestFeaturePoints, bool bTestGroundPlane, bool bTestPlaneExtents, bool bTestPlaneBoundaryPolygon);
	static void PauseARSession();
	static class UARPin* PinComponent(class USceneComponent* ComponentToPin, const struct FTransform& PinToWorldTransform, class UARTrackedGeometry* TrackedGeometry, const class FName DebugName);
	static class UARPin* PinComponentToTraceResult(class USceneComponent* ComponentToPin, const struct FARTraceResult& TraceResult, const class FName DebugName);
	static void RemovePin(class UARPin* PinToRemove);
	static void SetAlignmentTransform(const struct FTransform& InAlignmentTransform);
	static void StartARSession(class UARSessionConfig* SessionConfig);
	static void StopARSession();
	static void UnpinComponent(class USceneComponent* ComponentToUnpin);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARBlueprintLibrary")
	}
	static class UARBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UARBlueprintLibrary;

// Class AugmentedReality.ARTraceResultLibrary
// 0x0000 (0x0028 - 0x0028)
class UARTraceResultLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float GetDistanceFromCamera(const struct FARTraceResult& TraceResult);
	static struct FTransform GetLocalToTrackingTransform(const struct FARTraceResult& TraceResult);
	static struct FTransform GetLocalToWorldTransform(const struct FARTraceResult& TraceResult);
	static EARLineTraceChannels GetTraceChannel(const struct FARTraceResult& TraceResult);
	static class UARTrackedGeometry* GetTrackedGeometry(const struct FARTraceResult& TraceResult);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARTraceResultLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARTraceResultLibrary")
	}
	static class UARTraceResultLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARTraceResultLibrary>();
	}
};
DUMPER7_ASSERTS_UARTraceResultLibrary;

// Class AugmentedReality.ARBaseAsyncTaskBlueprintProxy
// 0x0020 (0x0050 - 0x0030)
class UARBaseAsyncTaskBlueprintProxy : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARBaseAsyncTaskBlueprintProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARBaseAsyncTaskBlueprintProxy")
	}
	static class UARBaseAsyncTaskBlueprintProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARBaseAsyncTaskBlueprintProxy>();
	}
};
DUMPER7_ASSERTS_UARBaseAsyncTaskBlueprintProxy;

// Class AugmentedReality.ARSaveWorldAsyncTaskBlueprintProxy
// 0x0030 (0x0080 - 0x0050)
class UARSaveWorldAsyncTaskBlueprintProxy final : public UARBaseAsyncTaskBlueprintProxy
{
public:
	UMulticastDelegateProperty_                   OnSuccess;                                         // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailed;                                          // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UARSaveWorldAsyncTaskBlueprintProxy* ARSaveWorld(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARSaveWorldAsyncTaskBlueprintProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARSaveWorldAsyncTaskBlueprintProxy")
	}
	static class UARSaveWorldAsyncTaskBlueprintProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARSaveWorldAsyncTaskBlueprintProxy>();
	}
};
DUMPER7_ASSERTS_UARSaveWorldAsyncTaskBlueprintProxy;

// Class AugmentedReality.ARGetCandidateObjectAsyncTaskBlueprintProxy
// 0x0048 (0x0098 - 0x0050)
class UARGetCandidateObjectAsyncTaskBlueprintProxy final : public UARBaseAsyncTaskBlueprintProxy
{
public:
	UMulticastDelegateProperty_                   OnSuccess;                                         // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailed;                                          // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x28];                                      // 0x0070(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UARGetCandidateObjectAsyncTaskBlueprintProxy* ARGetCandidateObject(class UObject* WorldContextObject, const struct FVector& Location, const struct FVector& Extent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARGetCandidateObjectAsyncTaskBlueprintProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARGetCandidateObjectAsyncTaskBlueprintProxy")
	}
	static class UARGetCandidateObjectAsyncTaskBlueprintProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARGetCandidateObjectAsyncTaskBlueprintProxy>();
	}
};
DUMPER7_ASSERTS_UARGetCandidateObjectAsyncTaskBlueprintProxy;

// Class AugmentedReality.ARLightEstimate
// 0x0000 (0x0028 - 0x0028)
class UARLightEstimate : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARLightEstimate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARLightEstimate")
	}
	static class UARLightEstimate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARLightEstimate>();
	}
};
DUMPER7_ASSERTS_UARLightEstimate;

// Class AugmentedReality.ARBasicLightEstimate
// 0x0018 (0x0040 - 0x0028)
class UARBasicLightEstimate final : public UARLightEstimate
{
public:
	float                                         AmbientIntensityLumens;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AmbientColorTemperatureKelvin;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           AmbientColor;                                      // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	struct FLinearColor GetAmbientColor() const;
	float GetAmbientColorTemperatureKelvin() const;
	float GetAmbientIntensityLumens() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARBasicLightEstimate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARBasicLightEstimate")
	}
	static class UARBasicLightEstimate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARBasicLightEstimate>();
	}
};
DUMPER7_ASSERTS_UARBasicLightEstimate;

// Class AugmentedReality.ARPin
// 0x00C8 (0x00F0 - 0x0028)
class UARPin final : public UObject
{
public:
	class UARTrackedGeometry*                     TrackedGeometry;                                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                        PinnedComponent;                                   // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalToTrackingTransform;                          // 0x0040(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FTransform                             LocalToAlignedTrackingTransform;                   // 0x0070(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	EARTrackingState                              TrackingState;                                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1[0x1F];                                      // 0x00A1(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnARTrackingStateChanged;                          // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	UMulticastDelegateProperty_                   OnARTransformUpdated;                              // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E0[0x10];                                      // 0x00E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DebugDraw(class UWorld* World, const struct FLinearColor& Color, float Scale, float PersistForSeconds) const;
	class FName GetDebugName() const;
	struct FTransform GetLocalToTrackingTransform() const;
	struct FTransform GetLocalToWorldTransform() const;
	class USceneComponent* GetPinnedComponent() const;
	class UARTrackedGeometry* GetTrackedGeometry() const;
	EARTrackingState GetTrackingState() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARPin")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARPin")
	}
	static class UARPin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARPin>();
	}
};
DUMPER7_ASSERTS_UARPin;

// Class AugmentedReality.ARSessionConfig
// 0x0068 (0x0098 - 0x0030)
class UARSessionConfig final : public UDataAsset
{
public:
	EARWorldAlignment                             WorldAlignment;                                    // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARSessionType                                SessionType;                                       // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARPlaneDetectionMode                         PlaneDetectionMode;                                // 0x0032(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHorizontalPlaneDetection;                         // 0x0033(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bVerticalPlaneDetection;                           // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableAutoFocus;                                  // 0x0035(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARLightEstimationMode                        LightEstimationMode;                               // 0x0036(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARFrameSyncMode                              FrameSyncMode;                                     // 0x0037(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableAutomaticCameraOverlay;                     // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableAutomaticCameraTracking;                    // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bResetCameraTracking;                              // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bResetTrackedObjects;                              // 0x003B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UARCandidateImage*>              CandidateImages;                                   // 0x0040(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         MaxNumSimultaneousImagesTracked;                   // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAREnvironmentCaptureProbeType                EnvironmentCaptureProbeType;                       // 0x0054(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 WorldMapData;                                      // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<class UARCandidateObject*>             CandidateObjects;                                  // 0x0068(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FARVideoFormat                         DesiredVideoFormat;                                // 0x0078(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	EARFaceTrackingDirection                      FaceTrackingDirection;                             // 0x0084(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARFaceTrackingUpdate                         FaceTrackingUpdate;                                // 0x0085(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 SerializedARCandidateImageDatabase;                // 0x0088(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void AddCandidateImage(class UARCandidateImage* NewCandidateImage);
	void AddCandidateObject(class UARCandidateObject* CandidateObject);
	void SetCandidateObjectList(const TArray<class UARCandidateObject*>& InCandidateObjects);
	void SetDesiredVideoFormat(const struct FARVideoFormat& NewFormat);
	void SetEnableAutoFocus(bool bNewValue);
	void SetFaceTrackingDirection(EARFaceTrackingDirection InDirection);
	void SetFaceTrackingUpdate(EARFaceTrackingUpdate InUpdate);
	void SetResetCameraTracking(bool bNewValue);
	void SetResetTrackedObjects(bool bNewValue);
	void SetWorldMapData(const TArray<uint8>& WorldMapData_0);

	const TArray<class UARCandidateImage*> GetCandidateImageList() const;
	const TArray<class UARCandidateObject*> GetCandidateObjectList() const;
	struct FARVideoFormat GetDesiredVideoFormat() const;
	EAREnvironmentCaptureProbeType GetEnvironmentCaptureProbeType() const;
	EARFaceTrackingDirection GetFaceTrackingDirection() const;
	EARFaceTrackingUpdate GetFaceTrackingUpdate() const;
	EARFrameSyncMode GetFrameSyncMode() const;
	EARLightEstimationMode GetLightEstimationMode() const;
	int32 GetMaxNumSimultaneousImagesTracked() const;
	EARPlaneDetectionMode GetPlaneDetectionMode() const;
	EARSessionType GetSessionType() const;
	EARWorldAlignment GetWorldAlignment() const;
	const TArray<uint8> GetWorldMapData() const;
	bool ShouldEnableAutoFocus() const;
	bool ShouldEnableCameraTracking() const;
	bool ShouldRenderCameraOverlay() const;
	bool ShouldResetCameraTracking() const;
	bool ShouldResetTrackedObjects() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARSessionConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARSessionConfig")
	}
	static class UARSessionConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARSessionConfig>();
	}
};
DUMPER7_ASSERTS_UARSessionConfig;

// Class AugmentedReality.ARSharedWorldGameMode
// 0x0068 (0x05D8 - 0x0570)
class AARSharedWorldGameMode final : public AGameMode
{
public:
	int32                                         BufferSizePerChunk;                                // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_574[0x64];                                     // 0x0574(0x0064)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class AARSharedWorldGameState* GetARSharedWorldGameState();
	void SetARSharedWorldData(const TArray<uint8>& ARWorldData);
	void SetARWorldSharingIsReady();
	void SetPreviewImageData(const TArray<uint8>& ImageData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARSharedWorldGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARSharedWorldGameMode")
	}
	static class AARSharedWorldGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AARSharedWorldGameMode>();
	}
};
DUMPER7_ASSERTS_AARSharedWorldGameMode;

// Class AugmentedReality.ARSharedWorldGameState
// 0x0038 (0x0520 - 0x04E8)
class AARSharedWorldGameState final : public AGameState
{
public:
	TArray<uint8>                                 PreviewImageData;                                  // 0x04E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ARWorldData;                                       // 0x04F8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         PreviewImageBytesTotal;                            // 0x0508(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ARWorldBytesTotal;                                 // 0x050C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PreviewImageBytesDelivered;                        // 0x0510(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ARWorldBytesDelivered;                             // 0x0514(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_518[0x8];                                      // 0x0518(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_OnARWorldMapIsReady();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARSharedWorldGameState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARSharedWorldGameState")
	}
	static class AARSharedWorldGameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AARSharedWorldGameState>();
	}
};
DUMPER7_ASSERTS_AARSharedWorldGameState;

// Class AugmentedReality.ARSharedWorldPlayerController
// 0x0008 (0x07D8 - 0x07D0)
class AARSharedWorldPlayerController final : public APlayerController
{
public:
	uint8                                         Pad_7D0[0x8];                                      // 0x07D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientInitSharedWorld(int32 PreviewImageSize, int32 ARWorldDataSize);
	void ClientUpdateARWorldData(int32 Offset, const TArray<uint8>& Buffer);
	void ClientUpdatePreviewImageData(int32 Offset, const TArray<uint8>& Buffer);
	void ServerMarkReadyForReceiving();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARSharedWorldPlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARSharedWorldPlayerController")
	}
	static class AARSharedWorldPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AARSharedWorldPlayerController>();
	}
};
DUMPER7_ASSERTS_AARSharedWorldPlayerController;

// Class AugmentedReality.ARSkyLight
// 0x0010 (0x04A8 - 0x0498)
class AARSkyLight final : public ASkyLight
{
public:
	class UAREnvironmentCaptureProbe*             CaptureProbe;                                      // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A0[0x8];                                      // 0x04A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetEnvironmentCaptureProbe(class UAREnvironmentCaptureProbe* InCaptureProbe);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARSkyLight")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARSkyLight")
	}
	static class AARSkyLight* GetDefaultObj()
	{
		return GetDefaultObjImpl<AARSkyLight>();
	}
};
DUMPER7_ASSERTS_AARSkyLight;

// Class AugmentedReality.ARTexture
// 0x0020 (0x00D8 - 0x00B8)
class UARTexture : public UTexture
{
public:
	EARTextureType                                TextureType;                                       // 0x00B8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Timestamp;                                         // 0x00BC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ExternalTextureGuid;                               // 0x00C0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Size;                                              // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARTexture")
	}
	static class UARTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARTexture>();
	}
};
DUMPER7_ASSERTS_UARTexture;

// Class AugmentedReality.ARTextureCameraImage
// 0x0000 (0x00D8 - 0x00D8)
class UARTextureCameraImage final : public UARTexture
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARTextureCameraImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARTextureCameraImage")
	}
	static class UARTextureCameraImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARTextureCameraImage>();
	}
};
DUMPER7_ASSERTS_UARTextureCameraImage;

// Class AugmentedReality.ARTextureCameraDepth
// 0x0008 (0x00E0 - 0x00D8)
class UARTextureCameraDepth final : public UARTexture
{
public:
	EARDepthQuality                               DepthQuality;                                      // 0x00D8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EARDepthAccuracy                              DepthAccuracy;                                     // 0x00D9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTemporallySmoothed;                             // 0x00DA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARTextureCameraDepth")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARTextureCameraDepth")
	}
	static class UARTextureCameraDepth* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARTextureCameraDepth>();
	}
};
DUMPER7_ASSERTS_UARTextureCameraDepth;

// Class AugmentedReality.AREnvironmentCaptureProbeTexture
// 0x0020 (0x0130 - 0x0110)
class UAREnvironmentCaptureProbeTexture final : public UTextureCube
{
public:
	EARTextureType                                TextureType;                                       // 0x0110(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Timestamp;                                         // 0x0114(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ExternalTextureGuid;                               // 0x0118(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Size;                                              // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AREnvironmentCaptureProbeTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AREnvironmentCaptureProbeTexture")
	}
	static class UAREnvironmentCaptureProbeTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAREnvironmentCaptureProbeTexture>();
	}
};
DUMPER7_ASSERTS_UAREnvironmentCaptureProbeTexture;

// Class AugmentedReality.ARTraceResultDummy
// 0x0000 (0x0028 - 0x0028)
class UARTraceResultDummy final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARTraceResultDummy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARTraceResultDummy")
	}
	static class UARTraceResultDummy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARTraceResultDummy>();
	}
};
DUMPER7_ASSERTS_UARTraceResultDummy;

// Class AugmentedReality.ARTrackedGeometry
// 0x00A8 (0x00D0 - 0x0028)
#pragma pack(push, 0x1)
class alignas(0x10) UARTrackedGeometry : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalToTrackingTransform;                          // 0x0030(0x0030)(IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FTransform                             LocalToAlignedTrackingTransform;                   // 0x0060(0x0030)(IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	EARTrackingState                              TrackingState;                                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_91[0x37];                                      // 0x0091(0x0037)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FName GetDebugName() const;
	int32 GetLastUpdateFrameNumber() const;
	float GetLastUpdateTimestamp() const;
	struct FTransform GetLocalToTrackingTransform() const;
	struct FTransform GetLocalToWorldTransform() const;
	EARTrackingState GetTrackingState() const;
	bool IsTracked() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARTrackedGeometry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARTrackedGeometry")
	}
	static class UARTrackedGeometry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARTrackedGeometry>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UARTrackedGeometry;

// Class AugmentedReality.ARPlaneGeometry
// 0x0030 (0x0100 - 0x00D0)
class UARPlaneGeometry final : public UARTrackedGeometry
{
public:
	struct FVector                                Center;                                            // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                Extent;                                            // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E0[0x10];                                      // 0x00E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UARPlaneGeometry*                       SubsumedBy;                                        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<struct FVector> GetBoundaryPolygonInLocalSpace() const;
	struct FVector GetCenter() const;
	struct FVector GetExtent() const;
	class UARPlaneGeometry* GetSubsumedBy() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARPlaneGeometry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARPlaneGeometry")
	}
	static class UARPlaneGeometry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARPlaneGeometry>();
	}
};
DUMPER7_ASSERTS_UARPlaneGeometry;

// Class AugmentedReality.ARTrackedPoint
// 0x0000 (0x00D0 - 0x00D0)
class UARTrackedPoint final : public UARTrackedGeometry
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARTrackedPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARTrackedPoint")
	}
	static class UARTrackedPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARTrackedPoint>();
	}
};
DUMPER7_ASSERTS_UARTrackedPoint;

// Class AugmentedReality.ARTrackedImage
// 0x0010 (0x00E0 - 0x00D0)
class UARTrackedImage final : public UARTrackedGeometry
{
public:
	bool                                          bIsTracked;                                        // 0x00C8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UARCandidateImage*                      DetectedImage;                                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              EstimatedSize;                                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	struct FVector2D GetEstimateSize();

	class UARCandidateImage* GetDetectedImage() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARTrackedImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARTrackedImage")
	}
	static class UARTrackedImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARTrackedImage>();
	}
};
DUMPER7_ASSERTS_UARTrackedImage;

// Class AugmentedReality.ARFaceGeometry
// 0x00F0 (0x01C0 - 0x00D0)
class UARFaceGeometry final : public UARTrackedGeometry
{
public:
	struct FVector                                LookAtTarget;                                      // 0x00C8(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTracked;                                        // 0x00D4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EARFaceBlendShape, float>                BlendShapes;                                       // 0x00D8(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_128[0x98];                                     // 0x0128(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const TMap<EARFaceBlendShape, float> GetBlendShapes() const;
	float GetBlendShapeValue(EARFaceBlendShape BlendShape) const;
	const struct FTransform GetLocalSpaceEyeTransform(EAREye Eye) const;
	struct FTransform GetWorldSpaceEyeTransform(EAREye Eye) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARFaceGeometry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARFaceGeometry")
	}
	static class UARFaceGeometry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARFaceGeometry>();
	}
};
DUMPER7_ASSERTS_UARFaceGeometry;

// Class AugmentedReality.AREnvironmentCaptureProbe
// 0x0010 (0x00E0 - 0x00D0)
class UAREnvironmentCaptureProbe final : public UARTrackedGeometry
{
public:
	uint8                                         Pad_C8[0x10];                                      // 0x00C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAREnvironmentCaptureProbeTexture*      EnvironmentCaptureTexture;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UAREnvironmentCaptureProbeTexture* GetEnvironmentCaptureTexture();

	struct FVector GetExtent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AREnvironmentCaptureProbe")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AREnvironmentCaptureProbe")
	}
	static class UAREnvironmentCaptureProbe* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAREnvironmentCaptureProbe>();
	}
};
DUMPER7_ASSERTS_UAREnvironmentCaptureProbe;

// Class AugmentedReality.ARTrackedObject
// 0x0000 (0x00D0 - 0x00D0)
class UARTrackedObject final : public UARTrackedGeometry
{
public:
	class UARCandidateObject*                     DetectedObject;                                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UARCandidateObject* GetDetectedObject() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARTrackedObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARTrackedObject")
	}
	static class UARTrackedObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARTrackedObject>();
	}
};
DUMPER7_ASSERTS_UARTrackedObject;

// Class AugmentedReality.ARTypesDummyClass
// 0x0000 (0x0028 - 0x0028)
class UARTypesDummyClass final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARTypesDummyClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARTypesDummyClass")
	}
	static class UARTypesDummyClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARTypesDummyClass>();
	}
};
DUMPER7_ASSERTS_UARTypesDummyClass;

// Class AugmentedReality.ARCandidateImage
// 0x0028 (0x0058 - 0x0030)
class UARCandidateImage final : public UDataAsset
{
public:
	class UTexture2D*                             CandidateTexture;                                  // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 FriendlyName;                                      // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Width;                                             // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Height;                                            // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EARCandidateImageOrientation                  Orientation;                                       // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UTexture2D* GetCandidateTexture() const;
	class FString GetFriendlyName() const;
	EARCandidateImageOrientation GetOrientation() const;
	float GetPhysicalHeight() const;
	float GetPhysicalWidth() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARCandidateImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARCandidateImage")
	}
	static class UARCandidateImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARCandidateImage>();
	}
};
DUMPER7_ASSERTS_UARCandidateImage;

// Class AugmentedReality.ARCandidateObject
// 0x0040 (0x0070 - 0x0030)
class UARCandidateObject final : public UDataAsset
{
public:
	TArray<uint8>                                 CandidateObjectData;                               // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class FString                                 FriendlyName;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBox                                   BoundingBox;                                       // 0x0050(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBoundingBox(const struct FBox& InBoundingBox);
	void SetCandidateObjectData(const TArray<uint8>& InCandidateObject);

	const struct FBox GetBoundingBox() const;
	const TArray<uint8> GetCandidateObjectData() const;
	class FString GetFriendlyName() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ARCandidateObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ARCandidateObject")
	}
	static class UARCandidateObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UARCandidateObject>();
	}
};
DUMPER7_ASSERTS_UARCandidateObject;

}

