#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_COM_Statue3

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_COM_Statue3.B_COM_Statue3_C
// 0x0028 (0x04B0 - 0x0488)
class AB_COM_Statue3_C final : public AActor
{
public:
	class UPointLightComponent*                   PointLight;                                        // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   COM_FireBoard0;                                    // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   COM_Bowl00;                                        // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   COM_Statue03_1;                                    // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_COM_Statue3_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_COM_Statue3_C")
	}
	static class AB_COM_Statue3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_COM_Statue3_C>();
	}
};
DUMPER7_ASSERTS_AB_COM_Statue3_C;

}

