#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackToTitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BackToTitle.BackToTitle_C
// 0x0030 (0x0288 - 0x0258)
class UBackToTitle_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UYesNoPopup_C*                          YesNoPopup;                                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          buttonIndex;                                       // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfigSelectMenu_C*                    ConfigSelectMenu;                                  // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnWindowCancel;                                    // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BackToTitle(int32 EntryPoint);
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void Construct();
	void OnPressedButton();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void EventPopupClosed();
	void EventPopupOpened();
	void SetupEvent();
	void EventBackToTitle();
	void Initialize();
	void Setup();
	void OnStart();
	void OnSelect();
	void OpenMenu(EUserWidgetPriority Priority_0);
	void BackToTitle();
	void CloseMenu();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BackToTitle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BackToTitle_C")
	}
	static class UBackToTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBackToTitle_C>();
	}
};
DUMPER7_ASSERTS_UBackToTitle_C;

}

