#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackerIDSetMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BackerIDSetMenu.BackerIDSetMenu_C
// 0x0048 (0x02C0 - 0x0278)
class UBackerIDSetMenu_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Close;                                             // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonControllGuide_C*                 ControllGuide;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFadeWidget_C*                          FadeWidget;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackerIDSetBlock_C*                    IDSetter;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UYesNoPopup_C*                          YesNoPopup;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventClosedMenu;                                   // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BackerIDSetMenu(int32 EntryPoint);
	void OnPressedButton();
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void Construct();
	void WidgetAnimationEvt_close_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_open_K2Node_WidgetAnimationEvent_0();
	void BndEvt__YesNoPopup_K2Node_ComponentBoundEvent_5_EventPopupClosed__DelegateSignature();
	void BndEvt__YesNoPopup_K2Node_ComponentBoundEvent_4_EventPopupOpened__DelegateSignature();
	void EventInputCancel();
	void EventInputConfirm();
	void SetupBackerIDSetter();
	void カスタムイベント_1();
	void カスタムイベント_0();
	void BndEvt__YesNoPopup_K2Node_ComponentBoundEvent_7_EventPopupSelectNo__DelegateSignature();
	void BndEvt__YesNoPopup_K2Node_ComponentBoundEvent_6_EventPopupSelectYes__DelegateSignature();
	void Initialize();
	void Setup();
	void OnStart();
	void OnEnter();
	void OnConfirm();
	void CloseMenu();
	void OpenMenu();
	void UpdateControlGuide();
	void UpdateControlGuideTextEntry();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BackerIDSetMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BackerIDSetMenu_C")
	}
	static class UBackerIDSetMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBackerIDSetMenu_C>();
	}
};
DUMPER7_ASSERTS_UBackerIDSetMenu_C;

}

