#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BossRush_Warp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function BP_BossRush_Warp.BP_BossRush_Warp_C.BndEvt__PBET_OnOverlapPCBox_K2Node_ComponentBoundEvent_0_PBETDelegate_OnOverlapPC__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct BP_BossRush_Warp_C_BndEvt__PBET_OnOverlapPCBox_K2Node_ComponentBoundEvent_0_PBETDelegate_OnOverlapPC__DelegateSignature final
{
public:
	struct FPBET_OverlapPCInfo                    bpp__OverlapPCInfo__pf__const;                     // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_BossRush_Warp_C_BndEvt__PBET_OnOverlapPCBox_K2Node_ComponentBoundEvent_0_PBETDelegate_OnOverlapPC__DelegateSignature;

// Function BP_BossRush_Warp.BP_BossRush_Warp_C.BndEvt__PBET_OnOverlapPCBox_K2Node_ComponentBoundEvent_1_PBETDelegate_OnOverlapEndPC__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct BP_BossRush_Warp_C_BndEvt__PBET_OnOverlapPCBox_K2Node_ComponentBoundEvent_1_PBETDelegate_OnOverlapEndPC__DelegateSignature final
{
public:
	struct FPBET_OverlapPCInfo                    bpp__OverlapPCInfo__pf__const;                     // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_BossRush_Warp_C_BndEvt__PBET_OnOverlapPCBox_K2Node_ComponentBoundEvent_1_PBETDelegate_OnOverlapEndPC__DelegateSignature;

// Function BP_BossRush_Warp.BP_BossRush_Warp_C.BndEvt__PBEventRoomChange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_BossRush_Warp_C_BndEvt__PBEventRoomChange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    bpp__OverlappedComponent__pf;                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 bpp__OtherActor__pf;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    bpp__OtherComp__pf;                                // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__OtherBodyIndex__pf;                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__bFromSweep__pf;                               // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             bpp__SweepResult__pf__const;                       // 0x0020(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_BossRush_Warp_C_BndEvt__PBEventRoomChange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature;

// Function BP_BossRush_Warp.BP_BossRush_Warp_C.BndEvt__PBEventRoomChange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_BossRush_Warp_C_BndEvt__PBEventRoomChange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    bpp__OverlappedComponent__pf;                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 bpp__OtherActor__pf;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    bpp__OtherComp__pf;                                // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__OtherBodyIndex__pf;                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_BossRush_Warp_C_BndEvt__PBEventRoomChange_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature;

// Function BP_BossRush_Warp.BP_BossRush_Warp_C.ExecuteUbergraph_BP_BossRush_Warp_6
// 0x0004 (0x0004 - 0x0000)
struct BP_BossRush_Warp_C_ExecuteUbergraph_BP_BossRush_Warp_6 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_BossRush_Warp_C_ExecuteUbergraph_BP_BossRush_Warp_6;

// Function BP_BossRush_Warp.BP_BossRush_Warp_C.OnReceiveEvent
// 0x0020 (0x0020 - 0x0000)
struct BP_BossRush_Warp_C_OnReceiveEvent final
{
public:
	class APBEventListenerManager*                bpp__eventManager__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__eventKey__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__eventSubKey__pf;                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__eventSender__pf;                              // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_BossRush_Warp_C_OnReceiveEvent;

// Function BP_BossRush_Warp.BP_BossRush_Warp_C.SetUpButtonVisible_P2
// 0x0010 (0x0010 - 0x0000)
struct BP_BossRush_Warp_C_SetUpButtonVisible_P2 final
{
public:
	bool                                          bpp__Visible__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       bpp__ParrenPlayer__pf;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_BossRush_Warp_C_SetUpButtonVisible_P2;

}

