#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosItemDropper

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ChaosItemDropper.BP_ChaosItemDropper_C.DropConsumable
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosItemDropper_C_DropConsumable final
{
public:
	class APBBaseCharacter*                       bpp__itemDropper__pf;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemDropper_C_DropConsumable;

// Function BP_ChaosItemDropper.BP_ChaosItemDropper_C.DropRandomConsumable
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosItemDropper_C_DropRandomConsumable final
{
public:
	class APBBaseCharacter*                       bpp__itemDropper__pf;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemDropper_C_DropRandomConsumable;

// Function BP_ChaosItemDropper.BP_ChaosItemDropper_C.DropRandomShard
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosItemDropper_C_DropRandomShard final
{
public:
	class APBBaseCharacter*                       bpp__itemDropper__pf;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemDropper_C_DropRandomShard;

// Function BP_ChaosItemDropper.BP_ChaosItemDropper_C.DropShard
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosItemDropper_C_DropShard final
{
public:
	class APBBaseCharacter*                       bpp__itemDropper__pf;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemDropper_C_DropShard;

// Function BP_ChaosItemDropper.BP_ChaosItemDropper_C.GetClientCharacter
// 0x0010 (0x0010 - 0x0000)
struct BP_ChaosItemDropper_C_GetClientCharacter final
{
public:
	class AOCCharacter*                           bpp__character__pf;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Success__pf;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ChaosItemDropper_C_GetClientCharacter;

// Function BP_ChaosItemDropper.BP_ChaosItemDropper_C.ItemEquipped
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosItemDropper_C_ItemEquipped final
{
public:
	class APBBaseCharacter*                       bpp__character__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemDropper_C_ItemEquipped;

// Function BP_ChaosItemDropper.BP_ChaosItemDropper_C.MULTICAST_ShowPlayer2PickUpShard
// 0x0008 (0x0008 - 0x0000)
struct BP_ChaosItemDropper_C_MULTICAST_ShowPlayer2PickUpShard final
{
public:
	class FName                                   bpp__PickupShard__pf;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemDropper_C_MULTICAST_ShowPlayer2PickUpShard;

// Function BP_ChaosItemDropper.BP_ChaosItemDropper_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosItemDropper_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemDropper_C_ReceiveTick;

// Function BP_ChaosItemDropper.BP_ChaosItemDropper_C.TogglePlayer2ShardPromptShowing
// 0x0001 (0x0001 - 0x0000)
struct BP_ChaosItemDropper_C_TogglePlayer2ShardPromptShowing final
{
public:
	bool                                          bpp__Visible__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosItemDropper_C_TogglePlayer2ShardPromptShowing;

}

