#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosWarp

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ChaosWarp.BP_ChaosWarp_C.ExecuteUbergraph_BP_ChaosWarp_0
// 0x0004 (0x0004 - 0x0000)
struct BP_ChaosWarp_C_ExecuteUbergraph_BP_ChaosWarp_0 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosWarp_C_ExecuteUbergraph_BP_ChaosWarp_0;

// Function BP_ChaosWarp.BP_ChaosWarp_C.GetPlayerIndex
// 0x0010 (0x0010 - 0x0000)
struct BP_ChaosWarp_C_GetPlayerIndex final
{
public:
	class APBBaseCharacter*                       bpp__Player__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bpp__Index__pf;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ChaosWarp_C_GetPlayerIndex;

// Function BP_ChaosWarp.BP_ChaosWarp_C.SetUpButtonVisible_P3
// 0x0010 (0x0010 - 0x0000)
struct BP_ChaosWarp_C_SetUpButtonVisible_P3 final
{
public:
	bool                                          bpp__Visible__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       bpp__ParentPlayer__pf;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ChaosWarp_C_SetUpButtonVisible_P3;

}

