#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosQuest_FindItem

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// DynamicClass BP_ChaosQuest_FindItem.BP_ChaosQuest_FindItem_C
// 0x0050 (0x04D8 - 0x0488)
class ABP_ChaosQuest_FindItem_C final : public AActor
{
public:
	class UPBSoundControlComponent*               PBSoundControl;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBP_ChaosQuestUtilities_C*              BP_ChaosQuestUtilities;                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         PossibleLocations;                                 // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x04B0(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class ABP_ChaosQuest_FindItem_Location_C*> CallFunc_GetAllActorsOfClass_OutActors;        // 0x04C0(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void FinishQuest();
	void Item_Found();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BP_ChaosQuest_FindItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ChaosQuest_FindItem_C")
	}
	static class ABP_ChaosQuest_FindItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChaosQuest_FindItem_C>();
	}
};
DUMPER7_ASSERTS_ABP_ChaosQuest_FindItem_C;

}

