#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharacterDisplay.BP_CharacterDisplay_C
// 0x0038 (0x04C0 - 0x0488)
class ABP_CharacterDisplay_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CameraRoot;                                        // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APBBaseCharacter*                       Character;                                         // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DisplayedPlayer;                                   // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoadWait;                                        // 0x04BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_CharacterDisplay(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void SetActive(bool IsActive);
	void UpdateShowOnlyComponents();
	void UpdateDisplayedEquipmentWithCustomizationInfo(int32 PlayerIndex);
	void UpdateDisplayedEquipment(class APBBaseCharacter* SourceCharacter);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void CreateCharacter();
	void SetupSceneCapture(class UTextureRenderTarget2D* RenderTarget);
	void RotateCharacter(const struct FRotator& Rotation, bool IsReverseMirror);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CharacterDisplay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CharacterDisplay_C")
	}
	static class ABP_CharacterDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CharacterDisplay_C>();
	}
};
DUMPER7_ASSERTS_ABP_CharacterDisplay_C;

}

