#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosQuest_ExitInTime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// DynamicClass BP_ChaosQuest_ExitInTime.BP_ChaosQuest_ExitInTime_C
// 0x00A0 (0x0670 - 0x05D0)
class ABP_ChaosQuest_ExitInTime_C final : public APBEventObject
{
public:
	class UBP_ChaosQuestUtilities_C*              BP_ChaosQuestUtilities;                            // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         maxDuration;                                       // 0x05D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedTime;                                       // 0x05DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPaused;                                          // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x05E4(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x05E8(0x0040)(Transient, DuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0628(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class APBEventListenerManager*                K2Node_Event_eventManager;                         // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   K2Node_Event_eventKey;                             // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   K2Node_Event_eventSubKey;                          // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                K2Node_Event_eventSender;                          // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0658(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ChaosGameMode_C*                    K2Node_DynamicCast_AsBP_Chaos_Game_Mode;           // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0668(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetRegisterdIndex();
	void OnReceiveEvent(class APBEventListenerManager* bpp__eventManager__pf, class FName bpp__eventKey__pf, class FName bpp__eventSubKey__pf, class UObject* bpp__eventSender__pf);
	void ReceiveBeginPlay();
	void ReceiveTick(float bpp__DeltaSeconds__pf);
	void SetUpExitInTime();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BP_ChaosQuest_ExitInTime_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ChaosQuest_ExitInTime_C")
	}
	static class ABP_ChaosQuest_ExitInTime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChaosQuest_ExitInTime_C>();
	}
};
DUMPER7_ASSERTS_ABP_ChaosQuest_ExitInTime_C;

}

