#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChaosPlayerController

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "Engine_structs.hpp"
#include "OCPCBP_classes.hpp"


namespace SDK
{

// DynamicClass BP_ChaosPlayerController.BP_ChaosPlayerController_C
// 0x0338 (0x0E70 - 0x0B38)
class ABP_ChaosPlayerController_C final : public AOCPCBP_C
{
public:
	class UPBUserWidgetPauseMenu*                 SpawnedWidget;                                     // 0x0B38(0x0008)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCameraInfo                            LastCameraInfo;                                    // 0x0B40(0x0110)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SyncCameraInfoTime;                                // 0x0C50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SyncCameraInfoRate;                                // 0x0C54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Loop_Counter_Variable_BP_ChaosPlayerController_C; // 0x0C58(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Array_Index_Variable_BP_ChaosPlayerController_C; // 0x0C5C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_CustomEvent_Character1_BP_ChaosPlayerController_C; // 0x0C60(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K2Node_CustomEvent_CharaTime1;                     // 0x0C68(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C6C[0x4];                                      // 0x0C6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       K2Node_CustomEvent_Character_BP_ChaosPlayerController_C; // 0x0C70(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K2Node_CustomEvent_CharaTime;                      // 0x0C78(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C7C[0x4];                                      // 0x0C7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_Class1;                         // 0x0C80(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                K2Node_CustomEvent_Loc1;                           // 0x0C88(0x000C)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C94[0x4];                                      // 0x0C94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_Class;                          // 0x0C98(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                K2Node_CustomEvent_Loc;                            // 0x0CA0(0x000C)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CallFunc_BreakVector_X;                            // 0x0CAC(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CallFunc_BreakVector_Y;                            // 0x0CB0(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CallFunc_BreakVector_Z;                            // 0x0CB4(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_SwitchEnum_CmpSuccess_BP_ChaosPlayerController_C; // 0x0CB8(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                K2Node_Event_EndPlayReason_BP_ChaosPlayerController_C; // 0x0CB9(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CBA[0x6];                                      // 0x0CBA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ChaosGameState_C> K2Node_DynamicCast_AsBPI_Chaos_Game_State;         // 0x0CC0(0x0010)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess_BP_ChaosPlayerController_C; // 0x0CD0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CD1[0x7];                                      // 0x0CD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ChaosGameMode_C*                    K2Node_DynamicCast_AsBP_Chaos_Game_Mode;           // 0x0CD8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess1_BP_ChaosPlayerController_C; // 0x0CE0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CE1[0x7];                                      // 0x0CE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       K2Node_DynamicCast_AsPBBase_Character_BP_ChaosPlayerController_C; // 0x0CE8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess2_BP_ChaosPlayerController_C; // 0x0CF0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CF1[0x3];                                      // 0x0CF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetTimeElapsed_outTimeElapsed;            // 0x0CF4(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStep_P0000_C*                          K2Node_DynamicCast_AsStep_P0000;                   // 0x0CF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess3_BP_ChaosPlayerController_C; // 0x0D00(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D01[0x3];                                      // 0x0D01(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_OldStep;                        // 0x0D04(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   K2Node_CustomEvent_NewStep;                        // 0x0D0C(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_CustomEvent_NewStepIsEndStep;               // 0x0D14(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D15[0x3];                                      // 0x0D15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> K2Node_CreateDelegate_OutputDelegate_BP_ChaosPlayerController_C; // 0x0D18(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       K2Node_CustomEvent_ViewProjMtx1;                   // 0x0D28(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	struct FVector2D                              K2Node_CustomEvent_ViewportSize1;                  // 0x0D38(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBIntRect                             K2Node_CustomEvent_ConstrainedViewRect1;           // 0x0D40(0x0010)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                K2Node_CustomEvent_TargetLocation1;                // 0x0D50(0x000C)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D5C[0x4];                                      // 0x0D5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatrix                                CallFunc_Vector4ArrayToMatrix_mtx;                 // 0x0D60(0x0040)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       K2Node_CustomEvent_ViewProjMtx;                    // 0x0DA0(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	struct FVector2D                              K2Node_CustomEvent_ViewportSize;                   // 0x0DB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBIntRect                             K2Node_CustomEvent_ConstrainedViewRect;            // 0x0DB8(0x0010)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                K2Node_CustomEvent_TargetLocation;                 // 0x0DC8(0x000C)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DD4[0xC];                                      // 0x0DD4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatrix                                CallFunc_Vector4ArrayToMatrix_mtx1;                // 0x0DE0(0x0040)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         K2Node_Event_DeltaSeconds_BP_ChaosPlayerController_C; // 0x0E20(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E24[0x4];                                      // 0x0E24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector4>                       CallFunc_MatrixToVector4Array_vector4Array;        // 0x0E28(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	bool                                          CallFunc_CameraInfoHasChanged_Changed;             // 0x0E38(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E39[0x7];                                      // 0x0E39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APBControllerBase*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0E40(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_Event_Chara;                                // 0x0E50(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K2Node_Event_CharaTime;                            // 0x0E58(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E5C[0x4];                                      // 0x0E5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBControllerBase*                      CallFunc_Array_Get_Item_BP_ChaosPlayerController_C; // 0x0E60(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E68[0x8];                                      // 0x0E68(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CameraInfoHasChanged(bool* bpp__Changed__pf);
	void CustomEvent(const class FName& bpp__OldStep__pf__const, const class FName& bpp__NewStep__pf__const, bool bpp__NewStepIsEndStep__pf);
	void ExecuteUbergraph_BP_ChaosPlayerController_1(int32 bpp__EntryPoint__pf);
	void ExecuteUbergraph_BP_ChaosPlayerController_3(int32 bpp__EntryPoint__pf);
	void ExecuteUbergraph_BP_ChaosPlayerController_7(int32 bpp__EntryPoint__pf);
	void ExitToHostedMap();
	void LOCAL_SpawnCreature(class UClass* bpp__Class__pf, const struct FVector& bpp__Loc__pf);
	void MULTICAST_SyncCharaTime(class APBBaseCharacter* bpp__character__pf, float bpp__CharaTime__pf);
	void MULTICAST_UpdateCameraInfo(const TArray<struct FVector4>& bpp__ViewProjMtx__pf__const, const struct FVector2D& bpp__ViewportSize__pf, const struct FPBIntRect& bpp__ConstrainedViewRect__pf, const struct FVector& bpp__TargetLocation__pf);
	void OWNER_GameOver();
	void RequestSyncCharaTimeForClient(class APBBaseCharacter* bpp__Chara__pf, float bpp__CharaTime__pf);
	void SERVER_SpawnCreature(class UClass* bpp__Class__pf, const struct FVector& bpp__Loc__pf);
	void SERVER_SyncCharaTime(class APBBaseCharacter* bpp__character__pf, float bpp__CharaTime__pf);
	void SERVER_UpdateCameraInfo(const TArray<struct FVector4>& bpp__ViewProjMtx__pf__const, const struct FVector2D& bpp__ViewportSize__pf, const struct FPBIntRect& bpp__ConstrainedViewRect__pf, const struct FVector& bpp__TargetLocation__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BP_ChaosPlayerController_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ChaosPlayerController_C")
	}
	static class ABP_ChaosPlayerController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChaosPlayerController_C>();
	}
};
DUMPER7_ASSERTS_ABP_ChaosPlayerController_C;

}

