#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GimmickRoot

#include "Basic.hpp"

#include "PB_Enum_GimmickInitialState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function BP_GimmickRoot.BP_GimmickRoot_C.CheckInitialState
// 0x0001 (0x0001 - 0x0000)
struct BP_GimmickRoot_C_CheckInitialState final
{
public:
	bool                                          bpp__Confirmed__pf;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_CheckInitialState;

// Function BP_GimmickRoot.BP_GimmickRoot_C.CheckInitialStateProcess
// 0x0001 (0x0001 - 0x0000)
struct BP_GimmickRoot_C_CheckInitialStateProcess final
{
public:
	EPB_Enum_GimmickInitialState                  bpp__State__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_CheckInitialStateProcess;

// Function BP_GimmickRoot.BP_GimmickRoot_C.DeleteEffect
// 0x0004 (0x0004 - 0x0000)
struct BP_GimmickRoot_C_DeleteEffect final
{
public:
	int32                                         bpp__ManageID__pf;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_DeleteEffect;

// Function BP_GimmickRoot.BP_GimmickRoot_C.IsDataKey
// 0x0002 (0x0002 - 0x0000)
struct BP_GimmickRoot_C_IsDataKey final
{
public:
	EPBGameKey                                    bpp__GameKey__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_IsDataKey;

// Function BP_GimmickRoot.BP_GimmickRoot_C.IsDataKeyJustDown
// 0x0001 (0x0001 - 0x0000)
struct BP_GimmickRoot_C_IsDataKeyJustDown final
{
public:
	bool                                          bpp__Input__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_IsDataKeyJustDown;

// Function BP_GimmickRoot.BP_GimmickRoot_C.IsDataKeyJustUp
// 0x0001 (0x0001 - 0x0000)
struct BP_GimmickRoot_C_IsDataKeyJustUp final
{
public:
	bool                                          bpp__Input__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_IsDataKeyJustUp;

// Function BP_GimmickRoot.BP_GimmickRoot_C.IsOnPlayerRight
// 0x0001 (0x0001 - 0x0000)
struct BP_GimmickRoot_C_IsOnPlayerRight final
{
public:
	bool                                          bpp__IsOnLeft__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_IsOnPlayerRight;

// Function BP_GimmickRoot.BP_GimmickRoot_C.IsOnPlayerRightToInverting
// 0x0001 (0x0001 - 0x0000)
struct BP_GimmickRoot_C_IsOnPlayerRightToInverting final
{
public:
	bool                                          bpp__IsOnLeft__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_IsOnPlayerRightToInverting;

// Function BP_GimmickRoot.BP_GimmickRoot_C.IsPlayerFlag
// 0x0002 (0x0002 - 0x0000)
struct BP_GimmickRoot_C_IsPlayerFlag final
{
public:
	EPBPlayerBit                                  bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_IsPlayerFlag;

// Function BP_GimmickRoot.BP_GimmickRoot_C.IsPlaySE
// 0x0018 (0x0018 - 0x0000)
struct BP_GimmickRoot_C_IsPlaySE final
{
public:
	class FString                                 bpp__name__pf__const;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_IsPlaySE;

// Function BP_GimmickRoot.BP_GimmickRoot_C.Is Key
// 0x0002 (0x0002 - 0x0000)
struct BP_GimmickRoot_C_Is_Key final
{
public:
	EPBGameKey                                    bpp__GameKey__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_Is_Key;

// Function BP_GimmickRoot.BP_GimmickRoot_C.Is Key Off
// 0x0002 (0x0002 - 0x0000)
struct BP_GimmickRoot_C_Is_Key_Off final
{
public:
	EPBGameKey                                    bpp__GameKey__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_Is_Key_Off;

// Function BP_GimmickRoot.BP_GimmickRoot_C.PlaySEWithPan
// 0x0010 (0x0010 - 0x0000)
struct BP_GimmickRoot_C_PlaySEWithPan final
{
public:
	class FString                                 bpp__name__pf__const;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_PlaySEWithPan;

// Function BP_GimmickRoot.BP_GimmickRoot_C.PlaySEWithPanActor
// 0x0018 (0x0018 - 0x0000)
struct BP_GimmickRoot_C_PlaySEWithPanActor final
{
public:
	class FString                                 bpp__name__pf__const;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESOUND_FOLLOW_MODE                            bpp__a_follow_mode__pf;                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_PlaySEWithPanActor;

// Function BP_GimmickRoot.BP_GimmickRoot_C.PossessController
// 0x0010 (0x0010 - 0x0000)
struct BP_GimmickRoot_C_PossessController final
{
public:
	EPBVirtualControllerType                      bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsValid__pf;                                  // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBVirtualController*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_PossessController;

// Function BP_GimmickRoot.BP_GimmickRoot_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_GimmickRoot_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                bpp__EndPlayReason__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_ReceiveEndPlay;

// Function BP_GimmickRoot.BP_GimmickRoot_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_GimmickRoot_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_ReceiveTick;

// Function BP_GimmickRoot.BP_GimmickRoot_C.SetAllEffectScale
// 0x000C (0x000C - 0x0000)
struct BP_GimmickRoot_C_SetAllEffectScale final
{
public:
	struct FVector                                bpp__NewScale3D__pf;                               // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_SetAllEffectScale;

// Function BP_GimmickRoot.BP_GimmickRoot_C.SetAllMainEnemyToGhost
// 0x0010 (0x0010 - 0x0000)
struct BP_GimmickRoot_C_SetAllMainEnemyToGhost final
{
public:
	bool                                          bpp__IsGhost__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__GhostLocation__pf;                            // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_SetAllMainEnemyToGhost;

// Function BP_GimmickRoot.BP_GimmickRoot_C.SetDownButtonVisable
// 0x0001 (0x0001 - 0x0000)
struct BP_GimmickRoot_C_SetDownButtonVisable final
{
public:
	bool                                          bpp__Visable__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_SetDownButtonVisable;

// Function BP_GimmickRoot.BP_GimmickRoot_C.SetEffectScale
// 0x0010 (0x0010 - 0x0000)
struct BP_GimmickRoot_C_SetEffectScale final
{
public:
	int32                                         bpp__Index__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__NewScale3D__pf;                               // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_SetEffectScale;

// Function BP_GimmickRoot.BP_GimmickRoot_C.SetUpButtonVisable
// 0x0001 (0x0001 - 0x0000)
struct BP_GimmickRoot_C_SetUpButtonVisable final
{
public:
	bool                                          bpp__Visable__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_SetUpButtonVisable;

// Function BP_GimmickRoot.BP_GimmickRoot_C.SetUpDownButtonVisable
// 0x0001 (0x0001 - 0x0000)
struct BP_GimmickRoot_C_SetUpDownButtonVisable final
{
public:
	bool                                          bpp__Visable__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_SetUpDownButtonVisable;

// Function BP_GimmickRoot.BP_GimmickRoot_C.SpawnEffect
// 0x0050 (0x0050 - 0x0000)
struct BP_GimmickRoot_C_SpawnEffect final
{
public:
	class FName                                   bpp__EffectMasterId__pf;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsGlobal__pf;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__SocketName__pf;                               // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsAttach__pf;                                 // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__BeginScale__pf;                               // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__EndScale__pf;                                 // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__ScaleDuration__pf;                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__OffsetX__pf;                                  // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__OffsetY__pf;                                  // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__OffsetZ__pf;                                  // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Yaw__pf;                                      // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Pitch__pf;                                    // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Roll__pf;                                     // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsMirrorTrail__pf;                            // 0x003C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__EffectManageID__pf;                           // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBParticle*                            bpp__EffectRef__pf;                                // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_SpawnEffect;

// Function BP_GimmickRoot.BP_GimmickRoot_C.StopSE
// 0x0018 (0x0018 - 0x0000)
struct BP_GimmickRoot_C_StopSE final
{
public:
	class FString                                 bpp__name__pf__const;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_StopSE;

// Function BP_GimmickRoot.BP_GimmickRoot_C.UnPossessController
// 0x0008 (0x0008 - 0x0000)
struct BP_GimmickRoot_C_UnPossessController final
{
public:
	class UPBVirtualController*                   bpp__VirtualController__pf;                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_UnPossessController;

// Function BP_GimmickRoot.BP_GimmickRoot_C.UpdateDeleteOutline
// 0x0004 (0x0004 - 0x0000)
struct BP_GimmickRoot_C_UpdateDeleteOutline final
{
public:
	float                                         bpp__InterpSpeed__pf;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GimmickRoot_C_UpdateDeleteOutline;

}

