#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GimmickRoot

#include "Basic.hpp"

#include "PB_Enum_GimmickInitialState_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// DynamicClass BP_GimmickRoot.BP_GimmickRoot_C
// 0x0070 (0x0640 - 0x05D0)
class ABP_GimmickRoot_C : public APBEventObject
{
public:
	class UPBGameInstance*                        PBGameInstance;                                    // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStep_PlayerRoot_C*                     StepPlayerRoot;                                    // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APB_Chr_PlayerRoot_C*                   Chr_PlayerRoot;                                    // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBPlayerState*                         PlayerState;                                       // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBConfigManager*                       configManager;                                     // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasUpButton;                                       // 0x05F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasUpDownButton;                                   // 0x05F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasDownButton;                                     // 0x05FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5FB[0x5];                                      // 0x05FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_UpButton_C*                        UpButtonWidget;                                    // 0x0600(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUMG_UpDownButton_C*                    UpDownButtonWidget;                                // 0x0608(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUMG_DownButton_C*                      DownButtonWidget;                                  // 0x0610(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APBParticle*>                    EffectArray;                                       // 0x0618(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0628(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Timer;                                             // 0x062C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MainStep;                                          // 0x0630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubStep;                                           // 0x0634(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_Enum_GimmickInitialState                  InitialState;                                      // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ConfirmedInitialState;                             // 0x0639(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x063A(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_63B[0x1];                                      // 0x063B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x063C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void CheckInitialState(bool* bpp__Confirmed__pf);
	void CheckInitialStateProcess(EPB_Enum_GimmickInitialState* bpp__State__pf);
	void DeleteAllEffect();
	void DeleteEffect(int32 bpp__ManageID__pf);
	void Initialization();
	bool IsDataKey(EPBGameKey bpp__GameKey__pf);
	void IsDataKeyJustDown(bool* bpp__Input__pf);
	void IsDataKeyJustUp(bool* bpp__Input__pf);
	void IsOnPlayerRight(bool* bpp__IsOnLeft__pf);
	void IsOnPlayerRightToInverting(bool* bpp__IsOnLeft__pf);
	bool IsPlayerFlag(EPBPlayerBit bpp__Value__pf);
	bool IsPlaySE(const class FString& bpp__name__pf__const);
	void IsPossessingController();
	bool Is_Key(EPBGameKey bpp__GameKey__pf);
	bool Is_Key_Off(EPBGameKey bpp__GameKey__pf);
	void PlaySEWithPan(const class FString& bpp__name__pf__const);
	void PlaySEWithPanActor(const class FString& bpp__name__pf__const, ESOUND_FOLLOW_MODE bpp__a_follow_mode__pf);
	class UPBVirtualController* PossessController(EPBVirtualControllerType bpp__Type__pf, bool* bpp__IsValid__pf);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason bpp__EndPlayReason__pf);
	void ReceiveTick(float bpp__DeltaSeconds__pf);
	void SetAllEffectScale(const struct FVector& bpp__NewScale3D__pf);
	void SetAllMainEnemyToGhost(bool bpp__IsGhost__pf, const struct FVector& bpp__GhostLocation__pf);
	void SetDownButtonVisable(bool bpp__Visable__pf);
	void SetEffectScale(int32 bpp__Index__pf, const struct FVector& bpp__NewScale3D__pf);
	void SetUpButtonVisable(bool bpp__Visable__pf);
	void SetUpDownButtonVisable(bool bpp__Visable__pf);
	void SpawnEffect(class FName bpp__EffectMasterId__pf, bool bpp__IsGlobal__pf, class FName bpp__SocketName__pf, bool bpp__IsAttach__pf, float bpp__BeginScale__pf, float bpp__EndScale__pf, float bpp__ScaleDuration__pf, float bpp__OffsetX__pf, float bpp__OffsetY__pf, float bpp__OffsetZ__pf, float bpp__Yaw__pf, float bpp__Pitch__pf, float bpp__Roll__pf, bool bpp__IsMirrorTrail__pf, int32* bpp__EffectManageID__pf, class APBParticle** bpp__EffectRef__pf);
	bool StopSE(const class FString& bpp__name__pf__const);
	void UnPossessController(class UPBVirtualController* bpp__VirtualController__pf);
	void UpdateDeleteOutline(float bpp__InterpSpeed__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BP_GimmickRoot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GimmickRoot_C")
	}
	static class ABP_GimmickRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GimmickRoot_C>();
	}
};
DUMPER7_ASSERTS_ABP_GimmickRoot_C;

}

