#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GhostTrailComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_GhostTrailComponent.BP_GhostTrailComponent_C.GetTrailActive
// 0x0001 (0x0001 - 0x0000)
struct BP_GhostTrailComponent_C_GetTrailActive final
{
public:
	bool                                          bpp__Active__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GhostTrailComponent_C_GetTrailActive;

// Function BP_GhostTrailComponent.BP_GhostTrailComponent_C.MeshMustCastTrails
// 0x0010 (0x0010 - 0x0000)
struct BP_GhostTrailComponent_C_MeshMustCastTrails final
{
public:
	class USceneComponent*                        bpp__Component__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_GhostTrailComponent_C_MeshMustCastTrails;

// Function BP_GhostTrailComponent.BP_GhostTrailComponent_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_GhostTrailComponent_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                bpp__EndPlayReason__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GhostTrailComponent_C_ReceiveEndPlay;

// Function BP_GhostTrailComponent.BP_GhostTrailComponent_C.SetTrailActive
// 0x0001 (0x0001 - 0x0000)
struct BP_GhostTrailComponent_C_SetTrailActive final
{
public:
	bool                                          bpp__Active__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_GhostTrailComponent_C_SetTrailActive;

}

