#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NetActionManager

#include "Basic.hpp"

#include "ESubSubStep_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ESubStep_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// DynamicClass BP_NetActionManager.BP_NetActionManager_C
// 0x0028 (0x0258 - 0x0230)
class UBP_NetActionManager_C final : public UActorComponent
{
public:
	EPBStep                                       CurrentStep;                                       // 0x0230(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      CurrentSubStep;                                    // 0x0231(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   CurrentSubSubStep;                                 // 0x0232(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         LastStep;                                          // 0x0233(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TriggerShard;                                      // 0x0234(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0238(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       CallFunc_GetPBCharacter_character;                 // 0x0248(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_GetPBCharacter_IsValid;                   // 0x0250(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0254(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void GetPBCharacter(class APBBaseCharacter** bpp__character__pf, bool* bpp__IsValid__pf);
	void MULTICAST_TriggerShard();
	void OnRep_CurrentStep();
	void OnRep_CurrentSubStep();
	void OnRep_CurrentSubSubStep();
	void OnReset();
	void ReceiveTick(float bpp__DeltaSeconds__pf);
	void ResetCurrentStep();
	void SetNetStep(EPBStep bpp__NewStep__pf);
	void UpdateCharacterStep();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BP_NetActionManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_NetActionManager_C")
	}
	static class UBP_NetActionManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_NetActionManager_C>();
	}
};
DUMPER7_ASSERTS_UBP_NetActionManager_C;

}

