#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScriptInterpreter

#include "Basic.hpp"

#include "ScriptOperator_structs.hpp"
#include "Engine_classes.hpp"
#include "ScriptVariableNamespace_structs.hpp"
#include "IntArray_structs.hpp"
#include "StringArray_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// DynamicClass BP_ScriptInterpreter.BP_ScriptInterpreter_C
// 0x01C0 (0x0648 - 0x0488)
class ABP_ScriptInterpreter_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FScriptVariableNamespace>       Variables;                                         // 0x0490(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	class FString                                 EscapeString;                                      // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AllOperatorCharacters;                             // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ExtractedStringLiterals;                           // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FString                                 StringLiteralPlaceholder;                          // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Statements;                                        // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FString>                         BaseOperators;                                     // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FString>                         CurrentStatementCharArray;                         // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FString>                         OperandStack;                                      // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FScriptOperator>                OperatorStack;                                     // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScriptOperator                        PoppedOperator;                                    // 0x0530(0x0030)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 FunctionArityStack;                                // 0x0560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FString                                 Current_Statement;                                 // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                CustomFunctionHandler;                             // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      ShortCircuitRanges;                                // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<int32>                                 ScopeEndStack;                                     // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         CurrentTokenIdx;                                   // 0x05A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         TokenList;                                         // 0x05B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         TestsRan;                                          // 0x05C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TestsFailed;                                       // 0x05C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStringArray>                   StatementStack;                                    // 0x05C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FStringArray>                   StringLiteralStack;                                // 0x05D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        FunctionHandlerStack;                              // 0x05E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FString>                         PoppedOperandStack;                                // 0x05F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FStringArray>                   TokenListStack;                                    // 0x0608(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FIntArray>                      FunctionArityStackStack;                           // 0x0618(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<int32>                                 CurrentTokenIdxStack;                              // 0x0628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FStringArray>                   OperandStackStack;                                 // 0x0638(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	void ApplyOperator(const struct FScriptOperator& bpp__ScriptOperator__pf);
	void AutomationTesting();
	void BoolTest(const class FString& bpp__Text__pf__const, bool* bpp__Result__pf);
	void BuildScriptOperator(const class FString& bpp__OperatorToken__pf__const, const class FString& bpp__PreviousToken__pf__const, int32 bpp__TokenIndex__pf, struct FScriptOperator* bpp__ScriptOperator__pf, bool* bpp__IsValid__pf);
	void CallFunction(class FName bpp__Function__pf, TArray<class FString>* bpp__Arguments__pf, class FString* bpp__Result__pf);
	void CleanVariableString(const class FString& bpp__VariableString__pf__const, class FString* bpp__Result__pf);
	void DeleteVariable(class FName bpp__Namespace__pf, class FName bpp__Key__pf, bool* bpp__Deleted__pf);
	void DumpOperandStack();
	void DumpPoppedOperands();
	void ExecuteScript(const class FString& bpp__ScriptString__pf__const, class UObject* bpp__CustomHandler__pf, class FString* bpp__ResolvedString__pf);
	void ExecuteScriptStatement(const class FString& bpp__Statement__pf__const, class FString* bpp__Result__pf);
	void ExtractTokens(const class FString& bpp__StatementString__pf__const, TArray<class FString>* bpp__Tokens__pf);
	void FindMatchingEndToken(int32 bpp__StartLocation__pf, const class FString& bpp__StartToken__pf__const, const class FString& bpp__EndToken__pf__const, TArray<class FString>* bpp__Tokens__pf, int32* bpp__FoundEnd__pf);
	void FindNextInstanceOfOperator(class FString* bpp__SourceString__pf, const class FString& bpp__Operator__pf__const, bool bpp__SearchFromEnd__pf, int32* bpp__Location__pf);
	void FindNextInstanceOfToken(const class FString& bpp__TokenToFind__pf__const, int32 bpp__StartFrom__pf, bool bpp__UseCase__pf, int32* bpp__TokenIndex__pf);
	void FindNextOperator(int32 bpp__StartxFrom__pfT, class FString* bpp__OperatorFound__pf, int32* bpp__FoundIndex__pf);
	void FindVariable(class FName bpp__Namespace__pf, class FName bpp__Key__pf, int32* bpp__NamespaceIndex__pf, int32* bpp__KeyIndex__pf);
	void FindVariableNamespace(class FName bpp__Namespace__pf, int32* bpp__Index__pf);
	void FormatNumberVariable(float bpp__Number__pf, class FString* bpp__Result__pf);
	void GetExtractedStringLiteral(const class FString& bpp__SourceString__pf__const, bool bpp__RemoveQuotes__pf, class FString* bpp__FinalString__pf);
	void GetNextToken(int32 bpp__LastTokenEnd__pf, const class FString& bpp__StatementString__pf__const, class FString* bpp__Token__pf, int32* bpp__TokenEndIndex__pf, bool* bpp__IsLastToken__pf);
	void GetVariable(class FName bpp__Namespace__pf, class FName bpp__Key__pf, class FText* bpp__Value__pf);
	bool HasLowerPrecedence(const struct FScriptOperator& bpp__Op1__pf, const struct FScriptOperator& bpp__Op2__pf);
	void IsBool(const class FString& bpp__Token__pf__const, bool* bpp__ReturnxValue__pfT);
	void IsOperator(const class FString& bpp__Token__pf__const, bool* bpp__Result__pf);
	void IsParenthesis(const class FString& bpp__Token__pf__const, bool* bpp__ReturnxValue__pfT);
	void MakeStringLiteralPlaceholder(int32 bpp__Index__pf, class FString* bpp__Placeholder__pf);
	void ParseStringForVariables(const class FString& bpp__Text__pf__const, bool bpp__MarkersAreOptional__pf, class FString* bpp__Result__pf);
	void ParseVariableString(const class FString& bpp__VariableString__pf__const, class FString* bpp__Result__pf, class FName* bpp__Namespace__pf, class FName* bpp__Key__pf, bool* bpp__Successful__pf);
	void ProcessStatement(class FString* bpp__Statement__pf, class FString* bpp__Result__pf);
	void ReceiveBeginPlay();
	void RemoveStringLiterals(class FString* bpp__ScriptString__pf, class FString* bpp__String__pf);
	void ResolveOperations();
	void SetVariable(class FName bpp__Namespace__pf, class FName bpp__Key__pf, const class FText& bpp__Text__pf__const, int32* bpp__NamespaceIndex__pf, int32* bpp__VariableIndex__pf);
	void ShortCircuit(int32 bpp__FromTokenIndex__pf);
	void TestCase(class FName bpp__VariableNs__pf, class FName bpp__VariableKey__pf, const class FText& bpp__ExpectedValue__pf__const, int32 bpp__TestSet__pf, int32 bpp__TestNumber__pf, bool* bpp__Success__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BP_ScriptInterpreter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ScriptInterpreter_C")
	}
	static class ABP_ScriptInterpreter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ScriptInterpreter_C>();
	}
};
DUMPER7_ASSERTS_ABP_ScriptInterpreter_C;

}

