#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScriptInterpreter

#include "Basic.hpp"

#include "ScriptOperator_structs.hpp"


namespace SDK::Params
{

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.ApplyOperator
// 0x0030 (0x0030 - 0x0000)
struct BP_ScriptInterpreter_C_ApplyOperator final
{
public:
	struct FScriptOperator                        bpp__ScriptOperator__pf;                           // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_ApplyOperator;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.BoolTest
// 0x0018 (0x0018 - 0x0000)
struct BP_ScriptInterpreter_C_BoolTest final
{
public:
	class FString                                 bpp__Text__pf__const;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Result__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_BoolTest;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.BuildScriptOperator
// 0x0060 (0x0060 - 0x0000)
struct BP_ScriptInterpreter_C_BuildScriptOperator final
{
public:
	class FString                                 bpp__OperatorToken__pf__const;                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__PreviousToken__pf__const;                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__TokenIndex__pf;                               // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScriptOperator                        bpp__ScriptOperator__pf;                           // 0x0028(0x0030)(Parm, OutParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsValid__pf;                                  // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_BuildScriptOperator;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.CallFunction
// 0x0028 (0x0028 - 0x0000)
struct BP_ScriptInterpreter_C_CallFunction final
{
public:
	class FName                                   bpp__Function__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         bpp__Arguments__pf;                                // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 bpp__Result__pf;                                   // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_CallFunction;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.CleanVariableString
// 0x0020 (0x0020 - 0x0000)
struct BP_ScriptInterpreter_C_CleanVariableString final
{
public:
	class FString                                 bpp__VariableString__pf__const;                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__Result__pf;                                   // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_CleanVariableString;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.DeleteVariable
// 0x0014 (0x0014 - 0x0000)
struct BP_ScriptInterpreter_C_DeleteVariable final
{
public:
	class FName                                   bpp__Namespace__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Key__pf;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Deleted__pf;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_DeleteVariable;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.ExecuteScript
// 0x0028 (0x0028 - 0x0000)
struct BP_ScriptInterpreter_C_ExecuteScript final
{
public:
	class FString                                 bpp__ScriptString__pf__const;                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__CustomHandler__pf;                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__ResolvedString__pf;                           // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_ExecuteScript;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.ExecuteScriptStatement
// 0x0020 (0x0020 - 0x0000)
struct BP_ScriptInterpreter_C_ExecuteScriptStatement final
{
public:
	class FString                                 bpp__Statement__pf__const;                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__Result__pf;                                   // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_ExecuteScriptStatement;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.ExtractTokens
// 0x0020 (0x0020 - 0x0000)
struct BP_ScriptInterpreter_C_ExtractTokens final
{
public:
	class FString                                 bpp__StatementString__pf__const;                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         bpp__Tokens__pf;                                   // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_ExtractTokens;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.FindMatchingEndToken
// 0x0040 (0x0040 - 0x0000)
struct BP_ScriptInterpreter_C_FindMatchingEndToken final
{
public:
	int32                                         bpp__StartLocation__pf;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 bpp__StartToken__pf__const;                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__EndToken__pf__const;                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         bpp__Tokens__pf;                                   // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         bpp__FoundEnd__pf;                                 // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_FindMatchingEndToken;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.FindNextInstanceOfOperator
// 0x0028 (0x0028 - 0x0000)
struct BP_ScriptInterpreter_C_FindNextInstanceOfOperator final
{
public:
	class FString                                 bpp__SourceString__pf;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__Operator__pf__const;                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__SearchFromEnd__pf;                            // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__Location__pf;                                 // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_FindNextInstanceOfOperator;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.FindNextInstanceOfToken
// 0x0020 (0x0020 - 0x0000)
struct BP_ScriptInterpreter_C_FindNextInstanceOfToken final
{
public:
	class FString                                 bpp__TokenToFind__pf__const;                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__StartFrom__pf;                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__UseCase__pf;                                  // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__TokenIndex__pf;                               // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_FindNextInstanceOfToken;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.FindNextOperator
// 0x0020 (0x0020 - 0x0000)
struct BP_ScriptInterpreter_C_FindNextOperator final
{
public:
	int32                                         bpp__StartxFrom__pfT;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 bpp__OperatorFound__pf;                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__FoundIndex__pf;                               // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_FindNextOperator;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.FindVariable
// 0x0018 (0x0018 - 0x0000)
struct BP_ScriptInterpreter_C_FindVariable final
{
public:
	class FName                                   bpp__Namespace__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Key__pf;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__NamespaceIndex__pf;                           // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__KeyIndex__pf;                                 // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_FindVariable;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.FindVariableNamespace
// 0x000C (0x000C - 0x0000)
struct BP_ScriptInterpreter_C_FindVariableNamespace final
{
public:
	class FName                                   bpp__Namespace__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Index__pf;                                    // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_FindVariableNamespace;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.FormatNumberVariable
// 0x0018 (0x0018 - 0x0000)
struct BP_ScriptInterpreter_C_FormatNumberVariable final
{
public:
	float                                         bpp__Number__pf;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 bpp__Result__pf;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_FormatNumberVariable;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.GetExtractedStringLiteral
// 0x0028 (0x0028 - 0x0000)
struct BP_ScriptInterpreter_C_GetExtractedStringLiteral final
{
public:
	class FString                                 bpp__SourceString__pf__const;                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__RemoveQuotes__pf;                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 bpp__FinalString__pf;                              // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_GetExtractedStringLiteral;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.GetNextToken
// 0x0030 (0x0030 - 0x0000)
struct BP_ScriptInterpreter_C_GetNextToken final
{
public:
	int32                                         bpp__LastTokenEnd__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 bpp__StatementString__pf__const;                   // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__Token__pf;                                    // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__TokenEndIndex__pf;                            // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsLastToken__pf;                              // 0x002C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_GetNextToken;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.GetVariable
// 0x0028 (0x0028 - 0x0000)
struct BP_ScriptInterpreter_C_GetVariable final
{
public:
	class FName                                   bpp__Namespace__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Key__pf;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   bpp__Value__pf;                                    // 0x0010(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_GetVariable;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.HasLowerPrecedence
// 0x0068 (0x0068 - 0x0000)
struct BP_ScriptInterpreter_C_HasLowerPrecedence final
{
public:
	struct FScriptOperator                        bpp__Op1__pf;                                      // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScriptOperator                        bpp__Op2__pf;                                      // 0x0030(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_HasLowerPrecedence;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.IsBool
// 0x0018 (0x0018 - 0x0000)
struct BP_ScriptInterpreter_C_IsBool final
{
public:
	class FString                                 bpp__Token__pf__const;                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ReturnxValue__pfT;                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_IsBool;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.IsOperator
// 0x0018 (0x0018 - 0x0000)
struct BP_ScriptInterpreter_C_IsOperator final
{
public:
	class FString                                 bpp__Token__pf__const;                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Result__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_IsOperator;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.IsParenthesis
// 0x0018 (0x0018 - 0x0000)
struct BP_ScriptInterpreter_C_IsParenthesis final
{
public:
	class FString                                 bpp__Token__pf__const;                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ReturnxValue__pfT;                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_IsParenthesis;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.MakeStringLiteralPlaceholder
// 0x0018 (0x0018 - 0x0000)
struct BP_ScriptInterpreter_C_MakeStringLiteralPlaceholder final
{
public:
	int32                                         bpp__Index__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 bpp__Placeholder__pf;                              // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_MakeStringLiteralPlaceholder;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.ParseStringForVariables
// 0x0028 (0x0028 - 0x0000)
struct BP_ScriptInterpreter_C_ParseStringForVariables final
{
public:
	class FString                                 bpp__Text__pf__const;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__MarkersAreOptional__pf;                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 bpp__Result__pf;                                   // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_ParseStringForVariables;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.ParseVariableString
// 0x0038 (0x0038 - 0x0000)
struct BP_ScriptInterpreter_C_ParseVariableString final
{
public:
	class FString                                 bpp__VariableString__pf__const;                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__Result__pf;                                   // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Namespace__pf;                                // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Key__pf;                                      // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Successful__pf;                               // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_ParseVariableString;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.ProcessStatement
// 0x0020 (0x0020 - 0x0000)
struct BP_ScriptInterpreter_C_ProcessStatement final
{
public:
	class FString                                 bpp__Statement__pf;                                // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__Result__pf;                                   // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_ProcessStatement;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.RemoveStringLiterals
// 0x0020 (0x0020 - 0x0000)
struct BP_ScriptInterpreter_C_RemoveStringLiterals final
{
public:
	class FString                                 bpp__ScriptString__pf;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 bpp__String__pf;                                   // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_RemoveStringLiterals;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.SetVariable
// 0x0030 (0x0030 - 0x0000)
struct BP_ScriptInterpreter_C_SetVariable final
{
public:
	class FName                                   bpp__Namespace__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Key__pf;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   bpp__Text__pf__const;                              // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         bpp__NamespaceIndex__pf;                           // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__VariableIndex__pf;                            // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_SetVariable;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.ShortCircuit
// 0x0004 (0x0004 - 0x0000)
struct BP_ScriptInterpreter_C_ShortCircuit final
{
public:
	int32                                         bpp__FromTokenIndex__pf;                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_ShortCircuit;

// Function BP_ScriptInterpreter.BP_ScriptInterpreter_C.TestCase
// 0x0038 (0x0038 - 0x0000)
struct BP_ScriptInterpreter_C_TestCase final
{
public:
	class FName                                   bpp__VariableNs__pf;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__VariableKey__pf;                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   bpp__ExpectedValue__pf__const;                     // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         bpp__TestSet__pf;                                  // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__TestNumber__pf;                               // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Success__pf;                                  // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BP_ScriptInterpreter_C_TestCase;

}

