#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_Dialogue

#include "Basic.hpp"

#include "EDialogueInputType_structs.hpp"
#include "BPC_UseActionHandler_classes.hpp"


namespace SDK
{

// DynamicClass BPC_Dialogue.BPC_Dialogue_C
// 0x00D0 (0x0318 - 0x0248)
class UBPC_Dialogue_C final : public UBPC_UseActionHandler_C
{
public:
	uint8                                         Pad_248[0x18];                                     // 0x0248(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CurrentState;                                      // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 DialogueUI;                                        // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUI_Dialogue_C*                         ActiveUI;                                          // 0x0270(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           StateHistoryStack;                                 // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NativeAccessSpecifierPublic)
	bool                                          IsActiveDialogueTopic;                             // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Usable;                                            // 0x0289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28A[0x2];                                      // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name_0;                                            // 0x028C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InitialBranch;                                     // 0x0294(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDialogueInputType                            InputeType;                                        // 0x029C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ScriptedUseConditions;                             // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NativeAccessSpecifierPublic)
	TArray<class FString>                         ScriptedUseConditionKeys;                          // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NativeAccessSpecifierPublic)
	bool                                          Skipping;                                          // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Passive;                                           // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C2[0x2];                                      // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PassiveFlowDelay;                                  // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallSkipToEnd;                                     // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SkipWasRequested;                                  // 0x02C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CA[0x2];                                      // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02CC(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02D0(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBPC_Dialogue_C*>                CallFunc_GetComponentsByClass_ReturnValue;         // 0x02D8(0x0010)(ExportObject, ZeroConstructor, Transient, DuplicateTransient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UBPC_Dialogue_C*                        CallFunc_Array_Get_Item;                           // 0x02E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x02F0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Temp_bool_Variable;                                // 0x02F1(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_PC_BPC_Dialogue_C;                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CallFunc_GetNextState_Flow;                        // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      K2Node_CustomEvent_PC;                             // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0310(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_SetState_NewParam;                        // 0x0314(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ChangeHost(class UObject* bpp__NewHost__pf, class FName bpp__BranchName__pf, class APlayerController* bpp__PC__pf, bool* bpp__Success__pf);
	void Clear(bool* bpp__ClearxFailed__pfT);
	void ClearUseConditions();
	void DisplayUI(class APlayerController* bpp__PC__pf);
	void ExecuteUbergraph_BPC_Dialogue_1(int32 bpp__EntryPoint__pf);
	void Exit(bool bpp__ExitSelfOnly__pf, bool* bpp__ExitxFailed__pfT);
	void ExtractDialogueBranchHost(const class FString& bpp__RawBranch__pf__const, class UObject** bpp__Host__pf, class FName* bpp__Branch__pf);
	void FormatError_AssetNotFoundOrInvalid(const class FString& bpp__AssetName__pf__const, class FName bpp__funcName__pf, class FString* bpp__Result__pf);
	void FormatError_MissingArg(const class FString& bpp__argName__pf__const, class FName bpp__funcName__pf, int32 bpp__ArgNumber__pf, class FString* bpp__Result__pf);
	EDialogueInputType GetActualInputType();
	void GetAsset(class FName bpp__ItemName__pf, struct FNamedAsset* bpp__AssetReference__pf, bool* bpp__Found__pf);
	void GetDialogueItem(class FName bpp__ItemName__pf, struct FDialogue_TableItem* bpp__Item__pf, bool* bpp__Found__pf);
	void GetDialogueItem_Func(class FName bpp__ItemName__pf, struct FDialogue_TableItem* bpp__Item__pf, bool* bpp__Found__pf);
	void GetDialogueRowNames(TArray<class FName>* bpp__Names__pf);
	void GetDialogueRowNames_Func(TArray<class FName>* bpp__Names__pf);
	void GetNextState(class FName bpp__RequestState__pf, class FName* bpp__Flow__pf);
	void GetScriptInterpreter(class ABP_ScriptInterpreter_C** bpp__Interpreter__pf);
	void GetScriptInterpreter_Func(class ABP_ScriptInterpreter_C** bpp__Interpreter__pf);
	void GetSpeakerAttributes(class FName bpp__SpeakerID__pf, struct FDialogueSpeakerAttribute_TableItem* bpp__Result__pf, bool* bpp__Found__pf);
	void GetSpeakerAttributes_Func(class FName bpp__SpeakerID__pf, struct FDialogueSpeakerAttribute_TableItem* bpp__Result__pf, bool* bpp__Found__pf);
	void GetUseCondition(const class FString& bpp__Key__pf__const, class FString* bpp__ConditionString__pf, bool* bpp__Found__pf, int32* bpp__Index__pf);
	void HandleScriptFunction(class FName bpp__Function__pf, TArray<class FString>* bpp__Args__pf, class FString* bpp__Result__pf);
	void HandleScriptFunction_Func(class FName bpp__Function__pf, TArray<class FString>* bpp__Args__pf, class FString* bpp__Result__pf);
	void IsTopicActive(bool* bpp__Active__pf);
	void OnAllTextDisplayed();
	void OnReceiveResponse(int32 bpp__ResponseIdx__pf, class FName bpp__BranchName__pf, class UObject* bpp__BranchHost__pf, class APlayerController* bpp__PC__pf, bool* bpp__Failed__pf);
	void OnSkip();
	void OnStateChanged(class FName bpp__To__pf, class FName bpp__From__pf, class APlayerController* bpp__PC__pf, bool* bpp__ValidToProcess__pf);
	void ParseStateName(class FName bpp__FullStateName__pf, class FName* bpp__BranchName__pf, int32* bpp__PartNumber__pf);
	void PopPreviousState(class FName* bpp__Found__pf);
	void ReceiveTick(float bpp__DeltaSeconds__pf);
	void RemoveUseCondition(const class FString& bpp__Key__pf__const);
	void SetInputType(EDialogueInputType bpp__Type__pf, bool bpp__ForceUpdate__pf, class APlayerController* bpp__PC__pf);
	void SetSkipDialogue(bool bpp__DoSkip__pf);
	void SetState(class FName bpp__NewxFlow__pfT, bool bpp__Force__pf, class APlayerController* bpp__PC__pf, bool bpp__IgnoreCurrentStateInHistory__pf, bool* bpp__NewParam__pf);
	void SetUseCondition(const class FString& bpp__Key__pf__const, const class FString& bpp__Condition__pf__const);
	void Use_Func(class APlayerController* bpp__PC__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BPC_Dialogue_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_Dialogue_C")
	}
	static class UBPC_Dialogue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_Dialogue_C>();
	}
};
DUMPER7_ASSERTS_UBPC_Dialogue_C;

}

