#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Usable

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_Usable.BPI_Usable_C.GetCustomNotificationLocation
// 0x0010 (0x0010 - 0x0000)
struct BPI_Usable_C_GetCustomNotificationLocation final
{
public:
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__UseCustomLocation__pf;                        // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPI_Usable_C_GetCustomNotificationLocation;

// Function BPI_Usable.BPI_Usable_C.GetUseDistance
// 0x0004 (0x0004 - 0x0000)
struct BPI_Usable_C_GetUseDistance final
{
public:
	float                                         bpp__ReturnxValue__pfT;                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPI_Usable_C_GetUseDistance;

// Function BPI_Usable.BPI_Usable_C.HaltUsable
// 0x0001 (0x0001 - 0x0000)
struct BPI_Usable_C_HaltUsable final
{
public:
	bool                                          bpp__ReturnxValue__pfT;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPI_Usable_C_HaltUsable;

// Function BPI_Usable.BPI_Usable_C.HasUseNotification
// 0x0001 (0x0001 - 0x0000)
struct BPI_Usable_C_HasUseNotification final
{
public:
	bool                                          bpp__ReturnxValue__pfT;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPI_Usable_C_HasUseNotification;

// Function BPI_Usable.BPI_Usable_C.Use
// 0x0008 (0x0008 - 0x0000)
struct BPI_Usable_C_Use final
{
public:
	class APlayerController*                      bpp__PC__pf;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BPI_Usable_C_Use;

}

