#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_DialogueAware

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_DialogueAware.BPI_DialogueAware_C.DialogueInterfaceClosed
// 0x0010 (0x0010 - 0x0000)
struct BPI_DialogueAware_C_DialogueInterfaceClosed final
{
public:
	class UBPC_Dialogue_C*                        bpp__DialogueComponent__pf;                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__HandlingFailed__pf;                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPI_DialogueAware_C_DialogueInterfaceClosed;

// Function BPI_DialogueAware.BPI_DialogueAware_C.DialogueInterfaceOpened
// 0x0010 (0x0010 - 0x0000)
struct BPI_DialogueAware_C_DialogueInterfaceOpened final
{
public:
	class UBPC_Dialogue_C*                        bpp__DialogueComponent__pf;                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__HandlingFailed__pf;                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BPI_DialogueAware_C_DialogueInterfaceOpened;

}

