#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Root

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function Bullet_Root.Bullet_Root_C.ActiveShardButton
// 0x0001 (0x0001 - 0x0000)
struct Bullet_Root_C_ActiveShardButton final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_ActiveShardButton;

// Function Bullet_Root.Bullet_Root_C.ApplyPhysics
// 0x0028 (0x0028 - 0x0000)
struct Bullet_Root_C_ApplyPhysics final
{
public:
	class USkeletalMeshComponent*                 bpp__TargetSkeletalMesh__pf;                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*               bpp__TrailParticle__pf;                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__HitWorldLocation__pf;                         // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Radius__pf;                                   // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Strength__pf;                                 // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Bullet_Root_C_ApplyPhysics;

// Function Bullet_Root.Bullet_Root_C.DeactiveShardButton
// 0x0001 (0x0001 - 0x0000)
struct Bullet_Root_C_DeactiveShardButton final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_DeactiveShardButton;

// Function Bullet_Root.Bullet_Root_C.Disappearance
// 0x0008 (0x0008 - 0x0000)
struct Bullet_Root_C_Disappearance final
{
public:
	float                                         bpp__Start__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Duration__pf;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_Disappearance;

// Function Bullet_Root.Bullet_Root_C.ExecCommandFromNotify
// 0x000C (0x000C - 0x0000)
struct Bullet_Root_C_ExecCommandFromNotify final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Bullet_Root_C_ExecCommandFromNotify;

// Function Bullet_Root.Bullet_Root_C.FinalizeProcess
// 0x0001 (0x0001 - 0x0000)
struct Bullet_Root_C_FinalizeProcess final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_FinalizeProcess;

// Function Bullet_Root.Bullet_Root_C.GetChrIns
// 0x0010 (0x0010 - 0x0000)
struct Bullet_Root_C_GetChrIns final
{
public:
	class APB_Chr_Root_C*                         bpp__ChrIns__pf;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsValid__pf;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Bullet_Root_C_GetChrIns;

// Function Bullet_Root.Bullet_Root_C.GetMainEffect
// 0x0018 (0x0018 - 0x0000)
struct Bullet_Root_C_GetMainEffect final
{
public:
	class APBParticle*                            bpp__PBParticle__pf;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*               bpp__ParticleSystem__pf;                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsValid__pf;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Bullet_Root_C_GetMainEffect;

// Function Bullet_Root.Bullet_Root_C.GetStepIns
// 0x0010 (0x0010 - 0x0000)
struct Bullet_Root_C_GetStepIns final
{
public:
	class UStep_Root_C*                           bpp__StepIns__pf;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsValid__pf;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Bullet_Root_C_GetStepIns;

// Function Bullet_Root.Bullet_Root_C.HitToCharacterStick
// 0x0020 (0x0020 - 0x0000)
struct Bullet_Root_C_HitToCharacterStick final
{
public:
	class APBBaseCharacter*                       bpp__HitCharacter__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__HitLocation__pf;                              // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__HitNormal__pf;                                // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_HitToCharacterStick;

// Function Bullet_Root.Bullet_Root_C.HitToWorld
// 0x001C (0x001C - 0x0000)
struct Bullet_Root_C_HitToWorld final
{
public:
	struct FVector                                bpp__HitWorldLocation__pf;                         // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__WorldHitDirection__pf;                        // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Bullet_Root_C_HitToWorld;

// Function Bullet_Root.Bullet_Root_C.HitToWorldStick
// 0x0020 (0x0020 - 0x0000)
struct Bullet_Root_C_HitToWorldStick final
{
public:
	class AActor*                                 bpp__HitActor__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__HitLocation__pf;                              // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__HitNormal__pf;                                // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_HitToWorldStick;

// Function Bullet_Root.Bullet_Root_C.InitializeProcess
// 0x0001 (0x0001 - 0x0000)
struct Bullet_Root_C_InitializeProcess final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_InitializeProcess;

// Function Bullet_Root.Bullet_Root_C.OnHitToCharacter
// 0x0070 (0x0070 - 0x0000)
struct Bullet_Root_C_OnHitToCharacter final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBBulletSubActorInfo                  bpp__info__pf__const;                              // 0x0008(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_OnHitToCharacter;

// Function Bullet_Root.Bullet_Root_C.OnHitToWorld
// 0x0070 (0x0070 - 0x0000)
struct Bullet_Root_C_OnHitToWorld final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBBulletSubActorInfo                  bpp__info__pf__const;                              // 0x0008(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_OnHitToWorld;

// Function Bullet_Root.Bullet_Root_C.PlaySE
// 0x0018 (0x0018 - 0x0000)
struct Bullet_Root_C_PlaySE final
{
public:
	class FString                                 bpp__SEID__pf__const;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESOUND_PAN_MODE                               bpp__PanSetting__pf;                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESOUND_DECAY_MODE                             bpp__DecaySetting__pf;                             // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0012(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Bullet_Root_C_PlaySE;

// Function Bullet_Root.Bullet_Root_C.PlaySELoop
// 0x0020 (0x0020 - 0x0000)
struct Bullet_Root_C_PlaySELoop final
{
public:
	class FString                                 bpp__SEID__pf__const;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESOUND_PAN_MODE                               bpp__PanSetting__pf;                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESOUND_DECAY_MODE                             bpp__DecaySetting__pf;                             // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__ManageID__pf;                                 // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Bullet_Root_C_PlaySELoop;

// Function Bullet_Root.Bullet_Root_C.PostBeginPlayProcess
// 0x0001 (0x0001 - 0x0000)
struct Bullet_Root_C_PostBeginPlayProcess final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_PostBeginPlayProcess;

// Function Bullet_Root.Bullet_Root_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Bullet_Root_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_ReceiveTick;

// Function Bullet_Root.Bullet_Root_C.SetBulletWorldLocation
// 0x0010 (0x0010 - 0x0000)
struct Bullet_Root_C_SetBulletWorldLocation final
{
public:
	struct FVector                                bpp__TargetWorldLocation__pf;                      // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Bullet_Root_C_SetBulletWorldLocation;

// Function Bullet_Root.Bullet_Root_C.SetMaterialScalarParameter
// 0x0010 (0x0010 - 0x0000)
struct Bullet_Root_C_SetMaterialScalarParameter final
{
public:
	class FName                                   bpp__ParameterName__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__ParameterValue__pf;                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Bullet_Root_C_SetMaterialScalarParameter;

// Function Bullet_Root.Bullet_Root_C.SetMaterialVectorParameter
// 0x0018 (0x0018 - 0x0000)
struct Bullet_Root_C_SetMaterialVectorParameter final
{
public:
	class FName                                   bpp__ParameterName__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__ParameterValue__pf;                           // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Bullet_Root_C_SetMaterialVectorParameter;

// Function Bullet_Root.Bullet_Root_C.SetStickRagdollMesh
// 0x0008 (0x0008 - 0x0000)
struct Bullet_Root_C_SetStickRagdollMesh final
{
public:
	class USkeletalMeshComponent*                 bpp__Mesh__pf;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_SetStickRagdollMesh;

// Function Bullet_Root.Bullet_Root_C.SetSummonMaterialParameter
// 0x0020 (0x0020 - 0x0000)
struct Bullet_Root_C_SetSummonMaterialParameter final
{
public:
	float                                         bpp__SummonMaskValue__pf;                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SummonWorldLocation__pf;                      // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SummonForwardVector__pf;                      // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Bullet_Root_C_SetSummonMaterialParameter;

// Function Bullet_Root.Bullet_Root_C.StartKill
// 0x0001 (0x0001 - 0x0000)
struct Bullet_Root_C_StartKill final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_StartKill;

// Function Bullet_Root.Bullet_Root_C.StopSELoop
// 0x0018 (0x0018 - 0x0000)
struct Bullet_Root_C_StopSELoop final
{
public:
	class FString                                 bpp__SEID__pf__const;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__ManageID__pf;                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Bullet_Root_C_StopSELoop;

// Function Bullet_Root.Bullet_Root_C.UpdateDestory
// 0x0001 (0x0001 - 0x0000)
struct Bullet_Root_C_UpdateDestory final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_UpdateDestory;

// Function Bullet_Root.Bullet_Root_C.UpdateOnOffProcess
// 0x0001 (0x0001 - 0x0000)
struct Bullet_Root_C_UpdateOnOffProcess final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_UpdateOnOffProcess;

// Function Bullet_Root.Bullet_Root_C.UpdateProcess
// 0x0001 (0x0001 - 0x0000)
struct Bullet_Root_C_UpdateProcess final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_UpdateProcess;

// Function Bullet_Root.Bullet_Root_C.UpdateShardActive
// 0x0001 (0x0001 - 0x0000)
struct Bullet_Root_C_UpdateShardActive final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_UpdateShardActive;

// Function Bullet_Root.Bullet_Root_C.UpdateShardDeactive
// 0x0001 (0x0001 - 0x0000)
struct Bullet_Root_C_UpdateShardDeactive final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Bullet_Root_C_UpdateShardDeactive;

}

