#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bullet_Root

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// DynamicClass Bullet_Root.Bullet_Root_C
// 0x01B8 (0x06F8 - 0x0540)
class ABullet_Root_C : public APBBulletSubActorBase
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APB_Chr_Root_C*                         ChrIns;                                            // 0x0548(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStep_Root_C*                           StepIns;                                           // 0x0550(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalTime;                                         // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBParticle*                            MainEffectIns;                                     // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*               MainParticleSystem;                                // 0x0568(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalFrame;                                        // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAlreadyInitialize;                               // 0x0574(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_575[0x3];                                      // 0x0575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       MainMeshDynamicMaterial;                           // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         DestoryStartTime;                                  // 0x0588(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisappearanceStart;                                // 0x058C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisappearanceDuration;                             // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDead;                                            // 0x0594(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnceDead;                                          // 0x0595(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsKill;                                            // 0x0596(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CurrentShardButton;                                // 0x0597(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LastShardButton;                                   // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_599[0x3];                                      // 0x0599(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ChangeActiveTime;                                  // 0x059C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChangeDeactiveTime;                                // 0x05A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalTimeRate;                                     // 0x05A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x05A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsRagdoll;                                         // 0x05AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsStickFlag;                                       // 0x05AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5AE[0x2];                                      // 0x05AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       HitStickCharacter;                                 // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 HitStickActor;                                     // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 StickRagdollStaticMesh;                            // 0x05C0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsStickRagdoll;                                    // 0x05C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsHitStaticCollision;                              // 0x05C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBulletInstantDeath;                              // 0x05CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5CB[0x1];                                      // 0x05CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds2;                        // 0x05CC(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_InitializeProcess_Value;                  // 0x05D0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStep_Root_C*                           CallFunc_GetStepIns_StepIns;                       // 0x05D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_GetStepIns_IsValid;                       // 0x05E0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_UpdateProcess_Value;                      // 0x05E1(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_UpdateDestory_Value;                      // 0x05E2(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_UpdateOnOffProcess_Value;                 // 0x05E3(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APB_Chr_Root_C*                         CallFunc_GetChrIns_ChrIns;                         // 0x05E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_GetChrIns_IsValid;                        // 0x05F0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F1[0x3];                                      // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds1;                        // 0x05F4(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBBulletSubActorInfo                  K2Node_Event_info1;                                // 0x05F8(0x0068)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0660(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_664[0x4];                                      // 0x0664(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBBulletSubActorInfo                  K2Node_Event_info;                                 // 0x0668(0x0068)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          CallFunc_HitToWorld_Return;                        // 0x06D0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D1[0x3];                                      // 0x06D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x06D4(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStep_Root_C*                           K2Node_DynamicCast_AsStep_Root;                    // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06E0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APB_Chr_Root_C*                         CallFunc_GetChrIns_ChrIns1;                        // 0x06E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_GetChrIns_IsValid1;                       // 0x06F0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_PostBeginPlayProcess_Value;               // 0x06F1(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6F2[0x6];                                      // 0x06F2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActiveShardButton(bool* bpp__Value__pf);
	void ApplyPhysics(class USkeletalMeshComponent* bpp__TargetSkeletalMesh__pf, class UParticleSystemComponent* bpp__TrailParticle__pf, const struct FVector& bpp__HitWorldLocation__pf, float bpp__Radius__pf, float bpp__Strength__pf, bool* bpp__return__pf);
	void BeginCheckBulletInstantDeath();
	void CreateMeshDynamicMaterial();
	void DeactiveShardButton(bool* bpp__Value__pf);
	void DestroySelf();
	void Disappearance(float bpp__Start__pf, float bpp__Duration__pf);
	void ExecCommandFromNotify(class FName bpp__Command__pf, bool* bpp__Value__pf);
	void FinalizeProcess(bool* bpp__Value__pf);
	void GetChrIns(class APB_Chr_Root_C** bpp__ChrIns__pf, bool* bpp__IsValid__pf);
	void GetMainEffect(class APBParticle** bpp__PBParticle__pf, class UParticleSystemComponent** bpp__ParticleSystem__pf, bool* bpp__IsValid__pf);
	void GetStepIns(class UStep_Root_C** bpp__StepIns__pf, bool* bpp__IsValid__pf);
	void HitToCharacterStick(class APBBaseCharacter* bpp__HitCharacter__pf, const struct FVector& bpp__HitLocation__pf, const struct FVector& bpp__HitNormal__pf);
	void HitToWorld(const struct FVector& bpp__HitWorldLocation__pf, const struct FVector& bpp__WorldHitDirection__pf, bool* bpp__return__pf);
	void HitToWorldStick(class AActor* bpp__HitActor__pf, const struct FVector& bpp__HitLocation__pf, const struct FVector& bpp__HitNormal__pf);
	void InitializeProcess(bool* bpp__Value__pf);
	void OnHitToCharacter(float bpp__DeltaSeconds__pf, const struct FPBBulletSubActorInfo& bpp__info__pf__const);
	void OnHitToWorld(float bpp__DeltaSeconds__pf, const struct FPBBulletSubActorInfo& bpp__info__pf__const);
	void PlaySE(const class FString& bpp__SEID__pf__const, ESOUND_PAN_MODE bpp__PanSetting__pf, ESOUND_DECAY_MODE bpp__DecaySetting__pf, bool* bpp__IsExec__pf);
	void PlaySELoop(const class FString& bpp__SEID__pf__const, ESOUND_PAN_MODE bpp__PanSetting__pf, ESOUND_DECAY_MODE bpp__DecaySetting__pf, int32 bpp__ManageID__pf, bool* bpp__IsExec__pf);
	void PostBeginPlayProcess(bool* bpp__Value__pf);
	void ReceiveBeginPlay();
	void ReceiveTick(float bpp__DeltaSeconds__pf);
	void SetBulletWorldLocation(const struct FVector& bpp__TargetWorldLocation__pf, bool* bpp__return__pf);
	void SetMaterialScalarParameter(class FName bpp__ParameterName__pf, float bpp__ParameterValue__pf, bool* bpp__return__pf);
	void SetMaterialVectorParameter(class FName bpp__ParameterName__pf, const struct FVector& bpp__ParameterValue__pf, bool* bpp__return__pf);
	void SetStickRagdollMesh(class USkeletalMeshComponent* bpp__Mesh__pf);
	void SetSummonMaterialParameter(float bpp__SummonMaskValue__pf, const struct FVector& bpp__SummonWorldLocation__pf, const struct FVector& bpp__SummonForwardVector__pf, bool* bpp__return__pf);
	void StartKill(bool* bpp__Value__pf);
	void StopSELoop(const class FString& bpp__SEID__pf__const, int32 bpp__ManageID__pf, bool* bpp__IsExec__pf);
	void UpdateCheckKillBullet();
	void UpdateDestory(bool* bpp__Value__pf);
	void UpdateOnOffProcess(bool* bpp__Value__pf);
	void UpdateProcess(bool* bpp__Value__pf);
	void UpdateShardActive(bool* bpp__Value__pf);
	void UpdateShardDeactive(bool* bpp__Value__pf);
	void UpdateStick();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Bullet_Root_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Bullet_Root_C")
	}
	static class ABullet_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABullet_Root_C>();
	}
};
DUMPER7_ASSERTS_ABullet_Root_C;

}

