#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CategoryFlag

#include "Basic.hpp"


namespace SDK::Params
{

// Function CategoryFlag.CategoryFlag_C.ClearArchiveFlag
// 0x0010 (0x0010 - 0x0000)
struct CategoryFlag_C_ClearArchiveFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_ClearArchiveFlag;

// Function CategoryFlag.CategoryFlag_C.ClearCraftFlag
// 0x0010 (0x0010 - 0x0000)
struct CategoryFlag_C_ClearCraftFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_ClearCraftFlag;

// Function CategoryFlag.CategoryFlag_C.ClearEventFlag
// 0x0010 (0x0010 - 0x0000)
struct CategoryFlag_C_ClearEventFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_ClearEventFlag;

// Function CategoryFlag.CategoryFlag_C.ClearGimmickFlag
// 0x0010 (0x0010 - 0x0000)
struct CategoryFlag_C_ClearGimmickFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_ClearGimmickFlag;

// Function CategoryFlag.CategoryFlag_C.ClearQuestFlag
// 0x0010 (0x0010 - 0x0000)
struct CategoryFlag_C_ClearQuestFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_ClearQuestFlag;

// Function CategoryFlag.CategoryFlag_C.ClearShopFlag
// 0x0010 (0x0010 - 0x0000)
struct CategoryFlag_C_ClearShopFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_ClearShopFlag;

// Function CategoryFlag.CategoryFlag_C.DoneArchiveFlag
// 0x0010 (0x0010 - 0x0000)
struct CategoryFlag_C_DoneArchiveFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_DoneArchiveFlag;

// Function CategoryFlag.CategoryFlag_C.DoneCraftFlag
// 0x0010 (0x0010 - 0x0000)
struct CategoryFlag_C_DoneCraftFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_DoneCraftFlag;

// Function CategoryFlag.CategoryFlag_C.DoneEventFlag
// 0x0010 (0x0010 - 0x0000)
struct CategoryFlag_C_DoneEventFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_DoneEventFlag;

// Function CategoryFlag.CategoryFlag_C.DoneEventFlagWithRecord
// 0x0018 (0x0018 - 0x0000)
struct CategoryFlag_C_DoneEventFlagWithRecord final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__RecordKey__pf;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_DoneEventFlagWithRecord;

// Function CategoryFlag.CategoryFlag_C.DoneGimmickFlag
// 0x0010 (0x0010 - 0x0000)
struct CategoryFlag_C_DoneGimmickFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_DoneGimmickFlag;

// Function CategoryFlag.CategoryFlag_C.DoneQuestFlag
// 0x0010 (0x0010 - 0x0000)
struct CategoryFlag_C_DoneQuestFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_DoneQuestFlag;

// Function CategoryFlag.CategoryFlag_C.DoneShopFlag
// 0x0010 (0x0010 - 0x0000)
struct CategoryFlag_C_DoneShopFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_DoneShopFlag;

// Function CategoryFlag.CategoryFlag_C.GetArchiveFlag
// 0x0018 (0x0018 - 0x0000)
struct CategoryFlag_C_GetArchiveFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDone__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CategoryFlag_C_GetArchiveFlag;

// Function CategoryFlag.CategoryFlag_C.GetCraftFlag
// 0x0018 (0x0018 - 0x0000)
struct CategoryFlag_C_GetCraftFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDone__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CategoryFlag_C_GetCraftFlag;

// Function CategoryFlag.CategoryFlag_C.GetEventFlag
// 0x0018 (0x0018 - 0x0000)
struct CategoryFlag_C_GetEventFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDone__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CategoryFlag_C_GetEventFlag;

// Function CategoryFlag.CategoryFlag_C.GetGimmickFlag
// 0x0018 (0x0018 - 0x0000)
struct CategoryFlag_C_GetGimmickFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDone__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CategoryFlag_C_GetGimmickFlag;

// Function CategoryFlag.CategoryFlag_C.GetQuestFlag
// 0x0018 (0x0018 - 0x0000)
struct CategoryFlag_C_GetQuestFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDone__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CategoryFlag_C_GetQuestFlag;

// Function CategoryFlag.CategoryFlag_C.GetShopFlag
// 0x0018 (0x0018 - 0x0000)
struct CategoryFlag_C_GetShopFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDone__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CategoryFlag_C_GetShopFlag;

// Function CategoryFlag.CategoryFlag_C.SetArchiveFlag
// 0x0018 (0x0018 - 0x0000)
struct CategoryFlag_C_SetArchiveFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDone__pf;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_SetArchiveFlag;

// Function CategoryFlag.CategoryFlag_C.SetCraftFlag
// 0x0018 (0x0018 - 0x0000)
struct CategoryFlag_C_SetCraftFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDone__pf;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_SetCraftFlag;

// Function CategoryFlag.CategoryFlag_C.SetEventFlag
// 0x0018 (0x0018 - 0x0000)
struct CategoryFlag_C_SetEventFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDone__pf;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_SetEventFlag;

// Function CategoryFlag.CategoryFlag_C.SetGimmickFlag
// 0x0018 (0x0018 - 0x0000)
struct CategoryFlag_C_SetGimmickFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDone__pf;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_SetGimmickFlag;

// Function CategoryFlag.CategoryFlag_C.SetQuestFlag
// 0x0018 (0x0018 - 0x0000)
struct CategoryFlag_C_SetQuestFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDone__pf;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_SetQuestFlag;

// Function CategoryFlag.CategoryFlag_C.SetShopFlag
// 0x0018 (0x0018 - 0x0000)
struct CategoryFlag_C_SetShopFlag final
{
public:
	class FName                                   bpp__FlagKey__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDone__pf;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CategoryFlag_C_SetShopFlag;

}

