#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChairBase

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "InteractableBase_classes.hpp"


namespace SDK
{

// DynamicClass ChairBase.ChairBase_C
// 0x0040 (0x06F0 - 0x06B0)
class AChairBase_C : public AInteractableBase_C
{
public:
	class UTextRenderComponent*                   TextRender;                                        // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBSitDownType                                SitDownType;                                       // 0x06C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C1[0x3];                                      // 0x06C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TotalTime;                                         // 0x06C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEnableSit;                                       // 0x06C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSitting;                                         // 0x06C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6CA[0x6];                                      // 0x06CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       playerSitting;                                     // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_CheckDelete_IsDelete;                     // 0x06D8(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D9[0x3];                                      // 0x06D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds_ChairBase_C;             // 0x06DC(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBET_InteractInfo                     K2Node_Event_InteractCharacter;                    // 0x06E0(0x0010)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)

public:
	void CheckDelete(bool* bpp__IsDelete__pf);
	void MakePlayerSit(class APBBaseCharacter* bpp__PlayerCharacterToSit__pf);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChairBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChairBase_C")
	}
	static class AChairBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChairBase_C>();
	}
};
DUMPER7_ASSERTS_AChairBase_C;

}

