#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosMode_RankListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChaosMode_RankListItem.ChaosMode_RankListItem_C
// 0x0058 (0x02B0 - 0x0258)
class UChaosMode_RankListItem_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 EffBase;                                           // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Rank;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Time;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Player;                                            // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 TimeRank;                                          // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 PlayerRank;                                        // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChaosMode_RankListItem(int32 EntryPoint);
	void Construct();
	void SetValuesAndUpdate(const class FString& Rank_0, const class FString& Player_Name, const class FString& Time_0);
	void IsPlayerItem(bool* bPlayerItem);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ChaosMode_RankListItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChaosMode_RankListItem_C")
	}
	static class UChaosMode_RankListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaosMode_RankListItem_C>();
	}
};
DUMPER7_ASSERTS_UChaosMode_RankListItem_C;

}

