#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chaos_Invite_Match

#include "Basic.hpp"

#include "ChaosInviteState_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Chaos_Invite_Match.Chaos_Invite_Match_C
// 0x0288 (0x0500 - 0x0278)
class UChaos_Invite_Match_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UcraftTriangleAnm_C*                    craftTriangleAnm;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ErrorMessage;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ErrorMsg;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             FriendListing;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                FriendsList;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                FriendsNotif;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Message;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                NoFriendsNotif;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RandomStatusBox;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RandomStatusText;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonEditMenu_Backup_C*               SelectBoxHostJoinInvite;                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                StatusBorder;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         LAST;                                              // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDemoChaos_ModeSelection_C*             Menu;                                              // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonControllGuide_C*                 ControllGuide;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Val;                                               // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Top;                                               // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TH_RandomSession;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOnlineServerListing>           OnlyNonFullGames;                                  // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FTimerHandle                           TH_Update;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UOCFriendListUnit_C*>            MenuListsFriends;                                  // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	EPBGameModeType                               GameType;                                          // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           T_BackToMenu;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          TestSwitch;                                        // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ServerLists_Names;                                 // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FOnlineServerListing>           ServerLists;                                       // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 CachedName;                                        // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FOnlineServerListing                   FoundListing;                                      // 0x0388(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, int32>                            ModePlayerTypes;                                   // 0x03E8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   OnBackFromOnlineSelection;                         // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FName>                           SwitchOptionKeys;                                  // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           DefaultOptionKeys;                                 // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class AOCGameSession*                         OCGameSession;                                     // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         RoomBlockedPlayersArray;                           // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	EChaosInviteState                             CurrentInviteState;                                // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInviteMatch;                                     // 0x0481(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_482[0x6];                                      // 0x0482(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   JoinFailMessage;                                   // 0x0488(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HostingPrivateSwitch;                              // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FVector2D>         SwitchHostJoinInviteBoxSizeMap;                    // 0x04A8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          CloseMenuIsFromBadConnectionChange;                // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Chaos_Invite_Match(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ClearJoinSessionComplete();
	void Auto_MatchmakingComplete(class AOCGameSession* OCGameSession_0, bool bWasSuccessful, bool bIsHost);
	void EnterOnlineRematchState();
	void JoinFriendSessionComplete(const class FString& Result);
	void SetupJoinFriendSessionComplete();
	void OnNetworkFailure(ENetworkFailure FailureType, bool IsServer);
	void UnbindNetworkConnectionStatusChange();
	void BindNetworkConnectionStatusChange();
	void OnNetworkConnectionStatusChange(EeOnlineServerConnectionStatus LastConnectionStatus, EeOnlineServerConnectionStatus ConnectionStatus);
	void StopUpdateListing();
	void SetInviteState(EChaosInviteState NewState);
	void CompleteFriendsListUpdate_Matchmaking(class AOCGameSession* OCGameSession_0, bool bWasSuccessful);
	void UpdateListing_MatchMaking();
	void JoinSessionComplete(const class FString& Result);
	void SetupJoinSessionComplete();
	void CreateSessionComplete(class AOCGameSession* OCGameSession_0, bool bWasSuccessful);
	void SetupCreateSessionComplete();
	void Reset();
	void Create_Session_Matchmaking();
	void UpdateVisibility();
	void BreakSearch();
	void AllowRefresh();
	void FriendSession();
	void Construct();
	void LoadList();
	void FriendList();
	void Destruct();
	void UpdateListing();
	void CompleteFriendsListUpdate(class AOCGameSession* OCGameSession_0, bool bWasSuccessful);
	void CullFullGames(const TArray<struct FOnlineServerListing>& All);
	void PickRandomGameAndJoin(const TArray<struct FOnlineServerListing>& Games);
	void FindSessionOverTime();
	void BackEvent();
	void OnClose();
	void OnOpen(EPBGameModeType GameMode);
	void OnPressedButton();
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void Initialize(EPBGameModeType GameMode);
	void Setup();
	void UpdateControlGuide(bool IsAllowConfirm);
	void MoveCursor(int32 Move);
	void CloseMenu(bool ForceHostClose);
	void GameIsFull(const struct FOnlineServerListing& OnlineServerListing, bool* Full);
	void GetSelectFriend(class UOCFriendListUnit_C** Out);
	void BackToMenu();
	void SetFriendsFoundMessage(bool inFriendsFound);
	void IsWaitingMatchmaking(bool* Searching);
	void IsHostRoomBlockedByClient(const class FString& NameOrID, bool* HostByBlocked);
	void IsClientBlockedByHostRoom(TArray<class FString>& RoomBlockedPlayers, bool* IsClientBlocked);
	void CanCancelFriendsListStep(bool* CanCancel);
	void FindSessionUpdateStatusLoc(const class FString& Status, class FString* OutputStatus, bool* IsSearching);
	void StartSwitchAutoMatchmaking();
	void HandleSuccessfulSwitchAutoMatchmaking(bool IsHost);
	void HandleFailureSwitchAutoMatchmakingPt1();
	void HandleFailureSwitchAutoMatchmakingPt2();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Chaos_Invite_Match_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Chaos_Invite_Match_C")
	}
	static class UChaos_Invite_Match_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChaos_Invite_Match_C>();
	}
};
DUMPER7_ASSERTS_UChaos_Invite_Match_C;

}

