#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosMode_FilterButtons

#include "Basic.hpp"


namespace SDK::Params
{

// Function ChaosMode_FilterButtons.ChaosMode_FilterButtons_C.ExecuteUbergraph_ChaosMode_FilterButtons
// 0x0030 (0x0030 - 0x0000)
struct ChaosMode_FilterButtons_C_ExecuteUbergraph_ChaosMode_FilterButtons final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0018)()
	class USizeBoxSlot*                           K2Node_DynamicCast_AsSize_Box_Slot;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ChaosMode_FilterButtons_C_ExecuteUbergraph_ChaosMode_FilterButtons;

// Function ChaosMode_FilterButtons.ChaosMode_FilterButtons_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ChaosMode_FilterButtons_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ChaosMode_FilterButtons_C_PreConstruct;

// Function ChaosMode_FilterButtons.ChaosMode_FilterButtons_C.SetDispCursor
// 0x0018 (0x0018 - 0x0000)
struct ChaosMode_FilterButtons_C_SetDispCursor final
{
public:
	bool                                          InDisp;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ChaosMode_FilterButtons_C_SetDispCursor;

}

