#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Chr_N2004

#include "Basic.hpp"

#include "PB_Chr_Root_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// DynamicClass Chr_N2004.Chr_N2004_C
// 0x0150 (0x3950 - 0x3800)
class AChr_N2004_C final : public APB_Chr_Root_C
{
public:
	class UPBET_OnOverlapPCBox*                   PBET_OnOverlapPCBox_Geno;                          // 0x37F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBET_OnOverlapPCBox*                   PBET_OnOverlapPCBox_Kick;                          // 0x3800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh_Wing10;                               // 0x3808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh_Wing9;                                // 0x3810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh_Wing8;                                // 0x3818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh_Wing7;                                // 0x3820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh_Wing6;                                // 0x3828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh_Wing5;                                // 0x3830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh_Wing4;                                // 0x3838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh_Wing3;                                // 0x3840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh_Wing1;                                // 0x3848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh_Wing2;                                // 0x3850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh_Wing11;                               // 0x3858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Crystal_Rate_F73BC1714C2B4B9973C2DBB90352160C;     // 0x3860(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETimelineDirection                            Crystal__Direction_F73BC1714C2B4B9973C2DBB90352160C; // 0x3864(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3865[0x3];                                     // 0x3865(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Crystal;                                           // 0x3868(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USkeletalMeshComponent*>         wings;                                             // 0x3870(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         Dulation;                                          // 0x3880(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3884[0x4];                                     // 0x3884(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStep_N2004_C*                          StepN2004;                                         // 0x3888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStep_P0000_C*                          Miram;                                             // 0x3890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InitLocation;                                      // 0x3898(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38A4[0x4];                                     // 0x38A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APBParticle*>                    WingEffectArray;                                   // 0x38A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Array_Index_Variable_Chr_N2004_C;         // 0x38B8(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38BC[0x4];                                     // 0x38BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStep_N2004_C*                          K2Node_DynamicCast_AsStep_N2004;                   // 0x38C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess_Chr_N2004_C;           // 0x38C8(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38C9[0x3];                                     // 0x38C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_Chr_N2004_C;        // 0x38CC(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x38D0(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                K2Node_CustomEvent_Velocity;                       // 0x38D4(0x000C)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                K2Node_CustomEvent_ShaderColor;                    // 0x38E0(0x000C)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K2Node_CustomEvent_Duration;                       // 0x38EC(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item_Chr_N2004_C;               // 0x38F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K2Node_Event_DeltaSeconds_Chr_N2004_C;             // 0x38F8(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38FC[0x4];                                     // 0x38FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStep_N2004_C*                          K2Node_DynamicCast_AsStep_N20041;                  // 0x3900(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess1_Chr_N2004_C;          // 0x3908(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3909[0x3];                                     // 0x3909(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x390C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStep_P0000_C*                          K2Node_DynamicCast_AsStep_P0000;                   // 0x3910(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess2_Chr_N2004_C;          // 0x3918(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3919[0x7];                                     // 0x3919(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBParticle*                            CallFunc_SpawnEffect_ReturnValue;                  // 0x3920(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                K2Node_Event_EndPlayReason_Chr_N2004_C;            // 0x3928(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3929[0x7];                                     // 0x3929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBParticle*                            CallFunc_Array_Get_Item1_Chr_N2004_C;              // 0x3930(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x3938(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_Chr_N2004_C;  // 0x393C(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_394C[0x4];                                     // 0x394C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BreakCrystal();
	void ChangeToDestructible();
	void Crystal__FinishedFunc();
	void Crystal__UpdateFunc();
	void DropShard();
	void End_Event();
	void ExecuteUbergraph_Chr_N2004_2(int32 bpp__EntryPoint__pf);
	void ExecuteUbergraph_Chr_N2004_4(int32 bpp__EntryPoint__pf);
	void MULTICAST_SyncVelocity(const struct FVector& bpp__Velocity__pf);
	void OnKilledAndre();
	void StartCrystalTransition(const struct FVector& bpp__ShaderColor__pf, float bpp__Duration__pf);
	void Start_Event();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Chr_N2004_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Chr_N2004_C")
	}
	static class AChr_N2004_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChr_N2004_C>();
	}
};
DUMPER7_ASSERTS_AChr_N2004_C;

}

