#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CinematicPlaySoundWithPanArgument

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK
{

// ScriptStruct CinematicPlaySoundWithPanArgument.CinematicPlaySoundWithPanArgument
// 0x0030 (0x0030 - 0x0000)
struct FCinematicPlaySoundWithPanArgument final
{
public:
	class FString                                 SoundID_2_B4847B18486821ED4F45B485C0CFCD37;        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FollowActorName_14_A404451C4AB72772040C6FB4E0BC9EAF; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESOUND_FOLLOW_MODE                            FollowMode_15_B806693B41504C6A81A52D8024A1BD5B;    // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Is3DSound_16_475A454A4F7571B7CEAF0C8A1702EF2B;     // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location_17_17EDE23D4C9629BB7985778B7FC90335;      // 0x0024(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCinematicPlaySoundWithPanArgument;

}

