#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cmp_SensorControler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_Rectangle_structs.hpp"


namespace SDK::Params
{

// Function Cmp_SensorControler.Cmp_SensorControler_C.DebugIsInner
// 0x0040 (0x0040 - 0x0000)
struct Cmp_SensorControler_C_DebugIsInner final
{
public:
	int32                                         bpp__actionId__pf;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__actionIdToDebug__pf;                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__isInnerSuccessful__pf;                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Radius__pf;                                   // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Position__pf;                                 // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBStepBase*                            bpp__Step__pf;                                     // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       bpp__baseChr__pf;                                  // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__boxWidth__pf;                                 // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__boxHeight__pf;                                // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       bpp__targetChr__pf;                                // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_DebugIsInner;

// Function Cmp_SensorControler.Cmp_SensorControler_C.DrawSensorEX
// 0x0014 (0x0014 - 0x0000)
struct Cmp_SensorControler_C_DrawSensorEX final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           bpp__Color__pf;                                    // 0x0004(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_DrawSensorEX;

// Function Cmp_SensorControler.Cmp_SensorControler_C.DrawSensorEX_WithScale
// 0x001C (0x001C - 0x0000)
struct Cmp_SensorControler_C_DrawSensorEX_WithScale final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           bpp__Color__pf;                                    // 0x0004(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__ScaleWidth__pf;                               // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__ScaleHeight__pf;                              // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_DrawSensorEX_WithScale;

// Function Cmp_SensorControler.Cmp_SensorControler_C.GetAllSeonsor
// 0x0010 (0x0010 - 0x0000)
struct Cmp_SensorControler_C_GetAllSeonsor final
{
public:
	TArray<struct FStruct_Rectangle>              bpp__Sensors__pf;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_GetAllSeonsor;

// Function Cmp_SensorControler.Cmp_SensorControler_C.GetFreeIndex
// 0x0008 (0x0008 - 0x0000)
struct Cmp_SensorControler_C_GetFreeIndex final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Index__pf;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_GetFreeIndex;

// Function Cmp_SensorControler.Cmp_SensorControler_C.GetPosition
// 0x0018 (0x0018 - 0x0000)
struct Cmp_SensorControler_C_GetPosition final
{
public:
	struct FVector                                bpp__Position__pf;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Value__pf;                                    // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_GetPosition;

// Function Cmp_SensorControler.Cmp_SensorControler_C.GetProcessTime
// 0x0008 (0x0008 - 0x0000)
struct Cmp_SensorControler_C_GetProcessTime final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Time__pf;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_GetProcessTime;

// Function Cmp_SensorControler.Cmp_SensorControler_C.GetSensor
// 0x0040 (0x0040 - 0x0000)
struct Cmp_SensorControler_C_GetSensor final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSuccess__pf;                                // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_Rectangle                      bpp__Sensor__pf;                                   // 0x0008(0x0030)(Parm, OutParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Index__pf;                                    // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_GetSensor;

// Function Cmp_SensorControler.Cmp_SensorControler_C.GetSensorWithExec
// 0x0040 (0x0040 - 0x0000)
struct Cmp_SensorControler_C_GetSensorWithExec final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSuccess__pf;                                // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_Rectangle                      bpp__Sensor__pf;                                   // 0x0008(0x0030)(Parm, OutParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Index__pf;                                    // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_GetSensorWithExec;

// Function Cmp_SensorControler.Cmp_SensorControler_C.IsInner
// 0x0018 (0x0018 - 0x0000)
struct Cmp_SensorControler_C_IsInner final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       bpp__Target__pf;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Radius__pf;                                   // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsIn__pf;                                     // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_IsInner;

// Function Cmp_SensorControler.Cmp_SensorControler_C.IsInnerEx
// 0x0028 (0x0028 - 0x0000)
struct Cmp_SensorControler_C_IsInnerEx final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Target__pf;                                   // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Radius__pf;                                   // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SpeedVector__pf;                              // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Rate__pf;                                     // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsIn__pf;                                     // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_IsInnerEx;

// Function Cmp_SensorControler.Cmp_SensorControler_C.IsInnerForActiveSencor
// 0x0018 (0x0018 - 0x0000)
struct Cmp_SensorControler_C_IsInnerForActiveSencor final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       bpp__Target__pf;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsIn__pf;                                     // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_IsInnerForActiveSencor;

// Function Cmp_SensorControler.Cmp_SensorControler_C.IsInnerHomingLocation
// 0x0018 (0x0018 - 0x0000)
struct Cmp_SensorControler_C_IsInnerHomingLocation final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       bpp__Target__pf;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Radius__pf;                                   // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsIn__pf;                                     // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_IsInnerHomingLocation;

// Function Cmp_SensorControler.Cmp_SensorControler_C.IsInRectangle
// 0x0024 (0x0024 - 0x0000)
struct Cmp_SensorControler_C_IsInRectangle final
{
public:
	struct FVector                                bpp__Point__pf;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Center__pf;                                   // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Width__pf;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Height__pf;                                   // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsIn__pf;                                     // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_IsInRectangle;

// Function Cmp_SensorControler.Cmp_SensorControler_C.IsInRectangleForSpline
// 0x0024 (0x0024 - 0x0000)
struct Cmp_SensorControler_C_IsInRectangleForSpline final
{
public:
	struct FVector                                bpp__Point__pf;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Center__pf;                                   // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Width__pf;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Height__pf;                                   // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsIn__pf;                                     // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_IsInRectangleForSpline;

// Function Cmp_SensorControler.Cmp_SensorControler_C.SetBufferSize
// 0x0004 (0x0004 - 0x0000)
struct Cmp_SensorControler_C_SetBufferSize final
{
public:
	int32                                         bpp__Size__pf;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_SetBufferSize;

// Function Cmp_SensorControler.Cmp_SensorControler_C.SetSensor
// 0x001C (0x001C - 0x0000)
struct Cmp_SensorControler_C_SetSensor final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Width__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Height__pf;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Offset__pf;                                   // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSuccess__pf;                                // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_SensorControler_C_SetSensor;

}

