#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cmp_StepCondition

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function Cmp_StepCondition.Cmp_StepCondition_C.Disable
// 0x0001 (0x0001 - 0x0000)
struct Cmp_StepCondition_C_Disable final
{
public:
	EPBCharacterCondition                         bpp__Condition__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_StepCondition_C_Disable;

// Function Cmp_StepCondition.Cmp_StepCondition_C.Enable
// 0x0001 (0x0001 - 0x0000)
struct Cmp_StepCondition_C_Enable final
{
public:
	EPBCharacterCondition                         bpp__Condition__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_StepCondition_C_Enable;

// Function Cmp_StepCondition.Cmp_StepCondition_C.GetCondition
// 0x0002 (0x0002 - 0x0000)
struct Cmp_StepCondition_C_GetCondition final
{
public:
	EPBCharacterCondition                         bpp__Condition__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_StepCondition_C_GetCondition;

// Function Cmp_StepCondition.Cmp_StepCondition_C.SetCondition
// 0x0002 (0x0002 - 0x0000)
struct Cmp_StepCondition_C_SetCondition final
{
public:
	EPBCharacterCondition                         bpp__Condition__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_StepCondition_C_SetCondition;

// Function Cmp_StepCondition.Cmp_StepCondition_C.SetConditions
// 0x0009 (0x0009 - 0x0000)
struct Cmp_StepCondition_C_SetConditions final
{
public:
	bool                                          bpp__IsFall__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDamage__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsTurn__pf;                                   // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsJump__pf;                                   // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsAttack__pf;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsLand__pf;                                   // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsEvasion__pf;                                // 0x0006(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDead__pf;                                   // 0x0007(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsDash__pf;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_StepCondition_C_SetConditions;

}

