#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cmp_SpeedControler

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Cmp_SpeedControler.Cmp_SpeedControler_C.Accel_X
// 0x001C (0x001C - 0x0000)
struct Cmp_SpeedControler_C_Accel_X final
{
public:
	float                                         bpp__Accel__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MinSpeed__pf;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MaxSpeed__pf;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__DeltaSecond__pf;                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Speed__pf;                                    // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SpeedControler_C_Accel_X;

// Function Cmp_SpeedControler.Cmp_SpeedControler_C.Accel_Z
// 0x000C (0x000C - 0x0000)
struct Cmp_SpeedControler_C_Accel_Z final
{
public:
	float                                         bpp__FirstSpeed__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Accel__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__SpeedZ__pf;                                   // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SpeedControler_C_Accel_Z;

// Function Cmp_SpeedControler.Cmp_SpeedControler_C.AccelCharacterFront_X
// 0x0018 (0x0018 - 0x0000)
struct Cmp_SpeedControler_C_AccelCharacterFront_X final
{
public:
	float                                         bpp__Accel__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MaxSpeed__pf;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFront__pf;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__Speed__pf;                                    // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SpeedControler_C_AccelCharacterFront_X;

// Function Cmp_SpeedControler.Cmp_SpeedControler_C.Break_X
// 0x0010 (0x0010 - 0x0000)
struct Cmp_SpeedControler_C_Break_X final
{
public:
	float                                         bpp__Break__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Speed__pf;                                    // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SpeedControler_C_Break_X;

// Function Cmp_SpeedControler.Cmp_SpeedControler_C.MakeMoveOutput
// 0x001C (0x001C - 0x0000)
struct Cmp_SpeedControler_C_MakeMoveOutput final
{
public:
	struct FStepUpdateOutput                      bpp__NewParam__pf;                                 // 0x0000(0x001C)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SpeedControler_C_MakeMoveOutput;

// Function Cmp_SpeedControler.Cmp_SpeedControler_C.SetZ
// 0x0010 (0x0010 - 0x0000)
struct Cmp_SpeedControler_C_SetZ final
{
public:
	float                                         bpp__Z__pf;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__return__pf;                                   // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SpeedControler_C_SetZ;

// Function Cmp_SpeedControler.Cmp_SpeedControler_C.UpdateMoveInfo
// 0x0094 (0x0094 - 0x0000)
struct Cmp_SpeedControler_C_UpdateMoveInfo final
{
public:
	struct FStepUpdateMoveInfo                    bpp__MoveInfo__pf;                                 // 0x0000(0x0094)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_SpeedControler_C_UpdateMoveInfo;

}

