#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cmp_JumpControler

#include "Basic.hpp"

#include "Cmp_Root_classes.hpp"


namespace SDK
{

// DynamicClass Cmp_JumpControler.Cmp_JumpControler_C
// 0x0028 (0x0278 - 0x0250)
class UCmp_JumpControler_C final : public UCmp_Root_C
{
public:
	float                                         JumpTimer;                                         // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            JumpCurve;                                         // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            GravityCurve;                                      // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCmp_SpeedControler_C*                  SpdIns;                                            // 0x0268(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallTimer;                                         // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetSpdIns(class UCmp_SpeedControler_C** bpp__SpdIns__pf);
	void InitFall();
	void InitJump(float bpp__GravityScale__pf, int32 bpp__ManId__pf);
	void SetGravityCurve(class UCurveFloat* bpp__Curve__pf);
	void SetJumpCurve(class UCurveFloat* bpp__Curve__pf);
	void StartFall(int32 bpp__ManId__pf, class UCurveFloat* bpp__GravityCurve__pf);
	void StartJump(int32 bpp__ManId__pf, float bpp__GravityScale__pf, class UCurveFloat* bpp__JumpCurve__pf);
	void UpdateFall(bool* bpp__IsFinish__pf);
	void UpdateJump(bool* bpp__IsJumpFinish__pf);
	void UpdateTime(float* bpp__Target__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Cmp_JumpControler_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Cmp_JumpControler_C")
	}
	static class UCmp_JumpControler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCmp_JumpControler_C>();
	}
};
DUMPER7_ASSERTS_UCmp_JumpControler_C;

}

