#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cmp_JumpControler

#include "Basic.hpp"


namespace SDK::Params
{

// Function Cmp_JumpControler.Cmp_JumpControler_C.GetSpdIns
// 0x0008 (0x0008 - 0x0000)
struct Cmp_JumpControler_C_GetSpdIns final
{
public:
	class UCmp_SpeedControler_C*                  bpp__SpdIns__pf;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_JumpControler_C_GetSpdIns;

// Function Cmp_JumpControler.Cmp_JumpControler_C.InitJump
// 0x0008 (0x0008 - 0x0000)
struct Cmp_JumpControler_C_InitJump final
{
public:
	float                                         bpp__GravityScale__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__ManId__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_JumpControler_C_InitJump;

// Function Cmp_JumpControler.Cmp_JumpControler_C.SetGravityCurve
// 0x0008 (0x0008 - 0x0000)
struct Cmp_JumpControler_C_SetGravityCurve final
{
public:
	class UCurveFloat*                            bpp__Curve__pf;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_JumpControler_C_SetGravityCurve;

// Function Cmp_JumpControler.Cmp_JumpControler_C.SetJumpCurve
// 0x0008 (0x0008 - 0x0000)
struct Cmp_JumpControler_C_SetJumpCurve final
{
public:
	class UCurveFloat*                            bpp__Curve__pf;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_JumpControler_C_SetJumpCurve;

// Function Cmp_JumpControler.Cmp_JumpControler_C.StartFall
// 0x0010 (0x0010 - 0x0000)
struct Cmp_JumpControler_C_StartFall final
{
public:
	int32                                         bpp__ManId__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            bpp__GravityCurve__pf;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_JumpControler_C_StartFall;

// Function Cmp_JumpControler.Cmp_JumpControler_C.StartJump
// 0x0010 (0x0010 - 0x0000)
struct Cmp_JumpControler_C_StartJump final
{
public:
	int32                                         bpp__ManId__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__GravityScale__pf;                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            bpp__JumpCurve__pf;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_JumpControler_C_StartJump;

// Function Cmp_JumpControler.Cmp_JumpControler_C.UpdateFall
// 0x0001 (0x0001 - 0x0000)
struct Cmp_JumpControler_C_UpdateFall final
{
public:
	bool                                          bpp__IsFinish__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_JumpControler_C_UpdateFall;

// Function Cmp_JumpControler.Cmp_JumpControler_C.UpdateJump
// 0x0001 (0x0001 - 0x0000)
struct Cmp_JumpControler_C_UpdateJump final
{
public:
	bool                                          bpp__IsJumpFinish__pf;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_JumpControler_C_UpdateJump;

// Function Cmp_JumpControler.Cmp_JumpControler_C.UpdateTime
// 0x0004 (0x0004 - 0x0000)
struct Cmp_JumpControler_C_UpdateTime final
{
public:
	float                                         bpp__Target__pf;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_JumpControler_C_UpdateTime;

}

