#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cmp_Root

#include "Basic.hpp"


namespace SDK::Params
{

// Function Cmp_Root.Cmp_Root_C.CheckAndRegist
// 0x0008 (0x0008 - 0x0000)
struct Cmp_Root_C_CheckAndRegist final
{
public:
	int32                                         bpp__ManId__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsRegist__pf;                                 // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_Root_C_CheckAndRegist;

// Function Cmp_Root.Cmp_Root_C.IsRegist
// 0x0008 (0x0008 - 0x0000)
struct Cmp_Root_C_IsRegist final
{
public:
	int32                                         bpp__ManId__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsRegister__pf;                               // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_Root_C_IsRegist;

// Function Cmp_Root.Cmp_Root_C.Regist
// 0x0008 (0x0008 - 0x0000)
struct Cmp_Root_C_Regist final
{
public:
	int32                                         bpp__ManId__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Index__pf;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_Root_C_Regist;

}

