#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cmp_TargetManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EOffsetType_structs.hpp"
#include "ETargetType_structs.hpp"


namespace SDK::Params
{

// Function Cmp_TargetManager.Cmp_TargetManager_C._GetCharacterAimOffset
// 0x0028 (0x0028 - 0x0000)
struct Cmp_TargetManager_C__GetCharacterAimOffset final
{
public:
	class APBBaseCharacter*                       bpp__Chr__pf;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Offset__pf;                                   // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsRight__pf;                                  // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__Value__pf;                                    // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_TargetManager_C__GetCharacterAimOffset;

// Function Cmp_TargetManager.Cmp_TargetManager_C._GetCharacterForwardOffset
// 0x0020 (0x0020 - 0x0000)
struct Cmp_TargetManager_C__GetCharacterForwardOffset final
{
public:
	class APBBaseCharacter*                       bpp__Chr__pf;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Offset__pf;                                   // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Value__pf;                                    // 0x0014(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_TargetManager_C__GetCharacterForwardOffset;

// Function Cmp_TargetManager.Cmp_TargetManager_C._IsAimRight
// 0x0010 (0x0010 - 0x0000)
struct Cmp_TargetManager_C__IsAimRight final
{
public:
	class APBBaseCharacter*                       bpp__Target__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsRight__pf;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_TargetManager_C__IsAimRight;

// Function Cmp_TargetManager.Cmp_TargetManager_C.AddOffset
// 0x0018 (0x0018 - 0x0000)
struct Cmp_TargetManager_C_AddOffset final
{
public:
	struct FVector                                bpp__AddOffset__pf;                                // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Position__pf;                                 // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_TargetManager_C_AddOffset;

// Function Cmp_TargetManager.Cmp_TargetManager_C.GetTargetPosition
// 0x000C (0x000C - 0x0000)
struct Cmp_TargetManager_C_GetTargetPosition final
{
public:
	struct FVector                                bpp__Position__pf;                                 // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_TargetManager_C_GetTargetPosition;

// Function Cmp_TargetManager.Cmp_TargetManager_C.IsInnertTarget
// 0x0014 (0x0014 - 0x0000)
struct Cmp_TargetManager_C_IsInnertTarget final
{
public:
	struct FVector                                bpp__Target__pf;                                   // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Distance__pf;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsInner__pf;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_TargetManager_C_IsInnertTarget;

// Function Cmp_TargetManager.Cmp_TargetManager_C.IsInnertTargetX
// 0x0014 (0x0014 - 0x0000)
struct Cmp_TargetManager_C_IsInnertTargetX final
{
public:
	struct FVector                                bpp__Target__pf;                                   // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Distance__pf;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsInner__pf;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_TargetManager_C_IsInnertTargetX;

// Function Cmp_TargetManager.Cmp_TargetManager_C.IsTargetFront
// 0x0010 (0x0010 - 0x0000)
struct Cmp_TargetManager_C_IsTargetFront final
{
public:
	struct FVector                                bpp__Target__pf;                                   // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFront__pf;                                  // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_TargetManager_C_IsTargetFront;

// Function Cmp_TargetManager.Cmp_TargetManager_C.SetTarget
// 0x0018 (0x0018 - 0x0000)
struct Cmp_TargetManager_C_SetTarget final
{
public:
	ETargetType                                   bpp__TargetType__pf;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOffsetType                                   bpp__OffsetType__pf;                               // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__Offset__pf;                                   // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Interval__pf;                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsReverse__pf;                                // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Cmp_TargetManager_C_SetTarget;

// Function Cmp_TargetManager.Cmp_TargetManager_C.UpdateTarget
// 0x000C (0x000C - 0x0000)
struct Cmp_TargetManager_C_UpdateTarget final
{
public:
	struct FVector                                bpp__Position__pf;                                 // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_TargetManager_C_UpdateTarget;

// Function Cmp_TargetManager.Cmp_TargetManager_C.UpdateTargetInterval
// 0x000C (0x000C - 0x0000)
struct Cmp_TargetManager_C_UpdateTargetInterval final
{
public:
	struct FVector                                bpp__Position__pf;                                 // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cmp_TargetManager_C_UpdateTargetInterval;

}

