#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cmp_SpeedControler

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Cmp_Root_classes.hpp"


namespace SDK
{

// DynamicClass Cmp_SpeedControler.Cmp_SpeedControler_C
// 0x00D0 (0x0320 - 0x0250)
class UCmp_SpeedControler_C final : public UCmp_Root_C
{
public:
	struct FVector                                Speed;                                             // 0x0250(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStepUpdateMoveInfo                    MoveInfo;                                          // 0x025C(0x0094)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FStepUpdateOutput                      MoveOutput;                                        // 0x02F0(0x001C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                         TimeJump;                                          // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FirstSpeed;                                        // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RootMoveRate;                                      // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawMove;                                           // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMove;                                         // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void Accel_X(float bpp__Accel__pf, float bpp__MinSpeed__pf, float bpp__MaxSpeed__pf, float bpp__DeltaSecond__pf, struct FVector* bpp__Speed__pf);
	void Accel_Z(float bpp__FirstSpeed__pf, float bpp__Accel__pf, float* bpp__SpeedZ__pf);
	void AccelCharacterFront_X(float bpp__Accel__pf, float bpp__MaxSpeed__pf, bool bpp__IsFront__pf, struct FVector* bpp__Speed__pf);
	void AxcelToTarget_X();
	void Break_X(float bpp__Break__pf, struct FVector* bpp__Speed__pf);
	void MakeMoveOutput(struct FStepUpdateOutput* bpp__NewParam__pf);
	void SetZ(float bpp__Z__pf, struct FVector* bpp__return__pf);
	void UpdateMoveInfo(const struct FStepUpdateMoveInfo& bpp__MoveInfo__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Cmp_SpeedControler_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Cmp_SpeedControler_C")
	}
	static class UCmp_SpeedControler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCmp_SpeedControler_C>();
	}
};
DUMPER7_ASSERTS_UCmp_SpeedControler_C;

}

