#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Coin01_CollectableBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// DynamicClass Coin01_CollectableBP.Coin01_CollectableBP_C
// 0x00A8 (0x0758 - 0x06B0)
class ACoin01_CollectableBP_C : public APBCollectableSkeletalObject
{
public:
	uint8                                         Pad_6B0[0x8];                                      // 0x06B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBET_OnOverlapPCBox*                   PBET_OnOverlapPCBox;                               // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBSoundControlComponent*               PBSoundControl;                                    // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 Sk_Mitem_coin01;                                   // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Dollar;                                            // 0x06D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Param_Money;                                       // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Param_Icon;                                        // 0x06E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnceGet;                                           // 0x06E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SlotDamageCoin;                                    // 0x06E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6EA[0x6];                                      // 0x06EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStringFromKey_ReturnValue;             // 0x06F0(0x0010)(ZeroConstructor, Transient, DuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0700(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_701[0x7];                                      // 0x0701(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBGameInstance*                        K2Node_DynamicCast_AsPBGame_Instance;              // 0x0708(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0710(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_711[0x7];                                      // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBInterfaceHUD*                        CallFunc_GetHUDInstance_ReturnValue;               // 0x0718(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBET_OverlapPCInfo                    K2Node_ComponentBoundEvent_OverlapPCInfo;          // 0x0720(0x0038)(Transient, DuplicateTransient, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	void BndEvt__PBET_OnOverlapPCBox_K2Node_ComponentBoundEvent_0_PBETDelegate_OnOverlapPC__DelegateSignature(const struct FPBET_OverlapPCInfo& bpp__OverlapPCInfo__pf__const);
	void BulletInfo_AddDamage(float bpp__Damage__pf, bool* bpp__return__pf);
	void BulletInfo_Destroy(bool* bpp__return__pf);
	void BulletInfo_GetBoolParameter(class FName bpp__Command__pf, bool* bpp__return__pf);
	void BulletInfo_RemoveDamage(bool* bpp__return__pf);
	void BulletInfo_SetActor(class AActor** bpp__ActorReference__pf, bool* bpp__return__pf);
	void BulletInfo_SetBoolParamter(class FName bpp__Command__pf, bool bpp__Value__pf, bool* bpp__return__pf);
	void BulletInfo_SetChrIns(class APBBaseCharacter* bpp__ChrIns__pf, bool* bpp__return__pf);
	void BulletInfo_SetDamageID(class FName bpp__DamageMasterID__pf, bool* bpp__return__pf);
	void BulletInfo_SetFloatValue(int32 bpp__Index__pf, float bpp__Value__pf, bool* bpp__return__pf);
	void BulletInfo_SetIsPlayer(bool bpp__IsPlayer__pf, bool* bpp__return__pf);
	void BulletInfo_SetNameValue(int32 bpp__Index__pf, class FName bpp__Value__pf, bool* bpp__return__pf);
	void BulletInfo_SetOffsetVector(const struct FVector& bpp__OffsetVector__pf, bool* bpp__return__pf);
	void BulletInfo_SetOwnerInstance(class AActor* bpp__Instance__pf, bool* bpp__return__pf);
	void BulletInfo_SetVectorParameter(class FName bpp__Command__pf, const struct FVector& bpp__VectorParameter__pf, bool* bpp__return__pf);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason bpp__EndPlayReason__pf);
	void SetMoneyValue();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Coin01_CollectableBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Coin01_CollectableBP_C")
	}
	static class ACoin01_CollectableBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACoin01_CollectableBP_C>();
	}
};
DUMPER7_ASSERTS_ACoin01_CollectableBP_C;

}

