#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Coin_01_ABP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Coin_01_ABP.Coin_01_ABP_C
// 0x0190 (0x0B70 - 0x09E0)
class UCoin_01_ABP_C final : public UPBAnimInstanceBase
{
public:
	uint8                                         Pad_9D8[0x8];                                      // 0x09D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_8BD1A09545EEBA539F60A488647D0684; // 0x09E8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A2330A024D2AF8129E83D48F9AC67F8A; // 0x0A08(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0684548345037AA0DFEB4FAA06BE246C; // 0x0A80(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2FC6E84F4130E494304525818EAB6890; // 0x0AA0(0x00C8)()

public:
	void ExecuteUbergraph_Coin_01_ABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Coin_01_ABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Coin_01_ABP_C")
	}
	static class UCoin_01_ABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCoin_01_ABP_C>();
	}
};
DUMPER7_ASSERTS_UCoin_01_ABP_C;

}

