#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Coin_05_ABP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Coin_05_ABP.Coin_05_ABP_C
// 0x0190 (0x0B70 - 0x09E0)
class UCoin_05_ABP_C final : public UPBAnimInstanceBase
{
public:
	uint8                                         Pad_9D8[0x8];                                      // 0x09D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_89F2C43F4F56A737098D5C9D8544692E; // 0x09E8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C5EAD8D34FB665B6462846849F14A251; // 0x0A08(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_84121A8C438C01BC668E5899F638660A; // 0x0A80(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9A1BEA534E50A5D8F1B82FADD8ACF1C7; // 0x0AA0(0x00C8)()

public:
	void ExecuteUbergraph_Coin_05_ABP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Coin_05_ABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Coin_05_ABP_C")
	}
	static class UCoin_05_ABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCoin_05_ABP_C>();
	}
};
DUMPER7_ASSERTS_UCoin_05_ABP_C;

}

