#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Com_TimerControler

#include "Basic.hpp"

#include "EPBTimerIndex_structs.hpp"


namespace SDK::Params
{

// Function Com_TimerControler.Com_TimerControler_C._GetTime
// 0x0004 (0x0004 - 0x0000)
struct Com_TimerControler_C__GetTime final
{
public:
	float                                         bpp__Time__pf;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Com_TimerControler_C__GetTime;

// Function Com_TimerControler.Com_TimerControler_C._Size
// 0x0004 (0x0004 - 0x0000)
struct Com_TimerControler_C__Size final
{
public:
	int32                                         bpp__Size__pf;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Com_TimerControler_C__Size;

// Function Com_TimerControler.Com_TimerControler_C._ToInt
// 0x0008 (0x0008 - 0x0000)
struct Com_TimerControler_C__ToInt final
{
public:
	EPBTimerIndex                                 bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__Index__pf;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Com_TimerControler_C__ToInt;

// Function Com_TimerControler.Com_TimerControler_C.GetTimer
// 0x0008 (0x0008 - 0x0000)
struct Com_TimerControler_C_GetTimer final
{
public:
	EPBTimerIndex                                 bpp__Index__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Time__pf;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Com_TimerControler_C_GetTimer;

// Function Com_TimerControler.Com_TimerControler_C.IsFinishTimer
// 0x000C (0x000C - 0x0000)
struct Com_TimerControler_C_IsFinishTimer final
{
public:
	EPBTimerIndex                                 bpp__Index__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Time__pf;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFnish__pf;                                  // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Com_TimerControler_C_IsFinishTimer;

// Function Com_TimerControler.Com_TimerControler_C.StartTimer
// 0x0001 (0x0001 - 0x0000)
struct Com_TimerControler_C_StartTimer final
{
public:
	EPBTimerIndex                                 bpp__Index__pf;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Com_TimerControler_C_StartTimer;

}

