#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonMenuSortListWindowAll

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonMenuSortListWindowAll.CommonMenuSortListWindowAll_C
// 0x0028 (0x02A0 - 0x0278)
class UCommonMenuSortListWindowAll_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonPickWindow_C*                    CommonPickWindow;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonSortWindow_C*                    CommonSortWindow;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Root;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ret;                                               // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPick;                                            // 0x029C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EInventorySort                                Sort;                                              // 0x029D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponType                                   pick;                                              // 0x029E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isOrder;                                           // 0x029F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CommonMenuSortListWindowAll(int32 EntryPoint);
	void OnPressedButton();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void OnSelectSort();
	void OnSelectPick();
	void OpenWindow(bool IsPick_0);
	void CloseWindow();
	void GetWeaponPickKey(EWeaponType* PickKey);
	void GetSortKey(EInventorySort* sortKey);
	void UpdateSortList(TArray<EInventorySort>& Array, const struct FPBInventorySortData& Input);
	void ChangeStep(class FName Step_0);
	void GetSortOrder(bool* isOrder_0);
	void GetReturnValue(int32* ret_0);
	void GetSortData(struct FPBInventorySortData* Output);
	void Initialize();
	void Setup();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonMenuSortListWindowAll_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonMenuSortListWindowAll_C")
	}
	static class UCommonMenuSortListWindowAll_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonMenuSortListWindowAll_C>();
	}
};
DUMPER7_ASSERTS_UCommonMenuSortListWindowAll_C;

}

