#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonWaitMsgPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PopupParam_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonWaitMsgPopup.CommonWaitMsgPopup_C
// 0x00B0 (0x0308 - 0x0258)
class UCommonWaitMsgPopup_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Close;                                             // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOff;                                           // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOn;                                            // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFadeWidget_C*                          FadeWidget;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLoadWaitAnim_C*                  LoadWaitAnim;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMsgPopup_C*                            MsgPopup;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   text;                                              // 0x0298(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPopupParam                            Param;                                             // 0x02B0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventWaitMessageClosed;                            // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         Limit;                                             // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CommonWaitMsgPopup(int32 EntryPoint);
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void Construct();
	void ClosedMsg();
	void SetupClosedMsg();
	void カスタムイベント_0();
	void BndEvt__MsgPopup_K2Node_ComponentBoundEvent_1_EventClosedPopup__DelegateSignature();
	void BndEvt__MsgPopup_K2Node_ComponentBoundEvent_0_EventOpenedPopup__DelegateSignature();
	void Initialize();
	void Setup();
	void OnStart();
	void SetPopupText(const class FText& input_text);
	void OpenPopup(const class FText& input_text, const struct FPopupParam& input_param);
	void ClosePopup();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonWaitMsgPopup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonWaitMsgPopup_C")
	}
	static class UCommonWaitMsgPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonWaitMsgPopup_C>();
	}
};
DUMPER7_ASSERTS_UCommonWaitMsgPopup_C;

}

