#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonWaitMsgPopup

#include "Basic.hpp"

#include "PopupParam_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CommonWaitMsgPopup.CommonWaitMsgPopup_C.ExecuteUbergraph_CommonWaitMsgPopup
// 0x0048 (0x0048 - 0x0000)
struct CommonWaitMsgPopup_C_ExecuteUbergraph_CommonWaitMsgPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> K2Node_Event_OnStepChanged; // 0x0030(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_ZOrder;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonWaitMsgPopup_C_ExecuteUbergraph_CommonWaitMsgPopup;

// Function CommonWaitMsgPopup.CommonWaitMsgPopup_C.Start
// 0x0014 (0x0014 - 0x0000)
struct CommonWaitMsgPopup_C_Start final
{
public:
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> OnStepChanged; // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	int32                                         ZOrder;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonWaitMsgPopup_C_Start;

// Function CommonWaitMsgPopup.CommonWaitMsgPopup_C.Setup
// 0x0010 (0x0010 - 0x0000)
struct CommonWaitMsgPopup_C_Setup final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonWaitMsgPopup_C_Setup;

// Function CommonWaitMsgPopup.CommonWaitMsgPopup_C.SetPopupText
// 0x0018 (0x0018 - 0x0000)
struct CommonWaitMsgPopup_C_SetPopupText final
{
public:
	class FText                                   input_text;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_CommonWaitMsgPopup_C_SetPopupText;

// Function CommonWaitMsgPopup.CommonWaitMsgPopup_C.OpenPopup
// 0x0070 (0x0070 - 0x0000)
struct CommonWaitMsgPopup_C_OpenPopup final
{
public:
	class FText                                   input_text;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPopupParam                            input_param;                                       // 0x0018(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonWaitMsgPopup_C_OpenPopup;

// Function CommonWaitMsgPopup.CommonWaitMsgPopup_C.ClosePopup
// 0x0018 (0x0018 - 0x0000)
struct CommonWaitMsgPopup_C_ClosePopup final
{
public:
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonWaitMsgPopup_C_ClosePopup;

}

