#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonEditMenu_backup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonEditMenu_backup.CommonEditMenu_Backup_C
// 0x00B8 (0x0330 - 0x0278)
class UCommonEditMenu_Backup_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 back;                                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           List;                                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Root;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUICommonFreeWindow_C*                  Window;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCommonSubMenuLIst_C*>           MenuLists;                                         // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Top;                                               // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LAST;                                              // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Default;                                           // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           UniqueId;                                          // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<class FName, class FText>                Content;                                           // 0x02E0(0x0050)(Edit, BlueprintVisible, ZeroConstructor)

public:
	void ExecuteUbergraph_CommonEditMenu_Backup(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void AddList(class UCommonSubMenuLIst_C* Input);
	void GetList(int32 Param_Index_0, class UCommonSubMenuLIst_C** Output);
	void GetSelectList(class UCommonSubMenuLIst_C** Output);
	void Clean();
	void Refresh();
	void MoveCursor(int32 Move);
	void GetSelectMenuID(class FName* UniqueId_0);
	void AddUniqueID(const class FName& input_key);
	void ResetMenu();
	void IsDecideMenu(bool* is_enable);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonEditMenu_Backup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonEditMenu_Backup_C")
	}
	static class UCommonEditMenu_Backup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonEditMenu_Backup_C>();
	}
};
DUMPER7_ASSERTS_UCommonEditMenu_Backup_C;

}

