#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonMenuInformation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonMenuInformation.CommonMenuInformation_C
// 0x00F0 (0x0348 - 0x0258)
class UCommonMenuInformation_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AlternateBG_Extended;                              // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AdjustForBloodlessMode;                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideStatus;                                        // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowStatus;                                        // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AlternateBG;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextPanel_C*                     Description;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInfomationIcon_C*                      icon;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipSubInformationShard_C*            OptionalShardInformation;                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ShardMPCost_0::UShardMPCost_C*          ShardMPCost;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInfomationStatus_C*                    Status;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UImage*>                         AttributeIcons;                                    // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UItemListItem_C*                        LocalVar_CommonMenuItem;                           // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FPBItemCatalogData                     itemData;                                          // 0x02C8(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsDisp;                                            // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnableBuiltInShardInfo;                            // 0x0341(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CommonMenuInformation(int32 EntryPoint);
	void SetBRVMPCost(const class FString& mp, bool IsHold);
	void Construct();
	void SetIconImage(const class FString& input_path);
	void SetDescription(const struct FPBItemCatalogData& input_data);
	void SetDescriptionText(const class FText& InText);
	void SetDispStatus(bool is_disp);
	void UnsetNewFlag(class UItemListItem_C* EquipItemMenuList, ECarriedCatalog ItemType);
	void IsDispStatus(bool* is_enable);
	void UpdateDispStatus();
	void Clear();
	void SetupForBloodlessMode();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonMenuInformation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonMenuInformation_C")
	}
	static class UCommonMenuInformation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonMenuInformation_C>();
	}
};
DUMPER7_ASSERTS_UCommonMenuInformation_C;

}

