#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonNumbers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonNumbersSideType_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonNumbers.CommonNumbers_C
// 0x0038 (0x0268 - 0x0230)
class UCommonNumbers_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Numbers01;                                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Numbers02;                                         // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Numbers03;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Numbers04;                                         // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Numbers05;                                         // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ECommonNumbersSideType                        SideType;                                          // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CommonNumbers(int32 EntryPoint);
	void Construct();
	void SetNumber(int32 Number);
	int32 NumberBreak(int32 Value, int32 Digit);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonNumbers_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonNumbers_C")
	}
	static class UCommonNumbers_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonNumbers_C>();
	}
};
DUMPER7_ASSERTS_UCommonNumbers_C;

}

