#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonListItem

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonListItem.CommonListItem_C
// 0x0090 (0x02E8 - 0x0258)
#pragma pack(push, 0x1)
class alignas(0x08) UCommonListItem_C : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Blink;                                             // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 back;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEffChoiceBP_C*                         EffChoiceBP;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewIcon;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Root;                                              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          isNew;                                             // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          isEnable;                                          // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   text;                                              // 0x0298(0x0018)(Edit, BlueprintVisible)
	class FName                                   UniqueKey;                                         // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TextColor;                                         // 0x02B8(0x0028)(Edit, BlueprintVisible)
	ETextJustify                                  TextJustification;                                 // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CommonListItem(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void SetNewIcon(bool IsVisible_0);
	void SetEnable(bool IsEnabled);
	void SetNameText(const class FText& InText);
	void SetNameColor(const struct FSlateColor& InColorAndOpacity);
	void SetNameJustification(ETextJustify InJustification);
	void SetNameVisible(ESlateVisibility InVisibility);
	void GetNameText(class FText* text_0);
	void SetUniqueKey(class FName input_key);
	void SetDispCursor(bool isEnable_0);
	void Initialize();
	void PlayBlink();
	void Setup();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonListItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonListItem_C")
	}
	static class UCommonListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonListItem_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UCommonListItem_C;

}

