#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonDiaryPage

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function CommonDiaryPage.CommonDiaryPage_C.ExecuteUbergraph_CommonDiaryPage
// 0x0018 (0x0018 - 0x0000)
struct CommonDiaryPage_C_ExecuteUbergraph_CommonDiaryPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> K2Node_Event_OnStepChanged; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_ZOrder;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonDiaryPage_C_ExecuteUbergraph_CommonDiaryPage;

// Function CommonDiaryPage.CommonDiaryPage_C.Start
// 0x0014 (0x0014 - 0x0000)
struct CommonDiaryPage_C_Start final
{
public:
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> OnStepChanged; // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	int32                                         ZOrder;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonDiaryPage_C_Start;

// Function CommonDiaryPage.CommonDiaryPage_C.CloseDiary
// 0x0008 (0x0008 - 0x0000)
struct CommonDiaryPage_C_CloseDiary final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonDiaryPage_C_CloseDiary;

// Function CommonDiaryPage.CommonDiaryPage_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct CommonDiaryPage_C_Initialize final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonDiaryPage_C_Initialize;

// Function CommonDiaryPage.CommonDiaryPage_C.OpenDiary
// 0x0008 (0x0008 - 0x0000)
struct CommonDiaryPage_C_OpenDiary final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonDiaryPage_C_OpenDiary;

// Function CommonDiaryPage.CommonDiaryPage_C.OpenDiaryArchive
// 0x0008 (0x0008 - 0x0000)
struct CommonDiaryPage_C_OpenDiaryArchive final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonDiaryPage_C_OpenDiaryArchive;

// Function CommonDiaryPage.CommonDiaryPage_C.Setup
// 0x0058 (0x0058 - 0x0000)
struct CommonDiaryPage_C_Setup final
{
public:
	struct FPBArchiveDiaryCatalogData             diary_data;                                        // 0x0000(0x0058)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_CommonDiaryPage_C_Setup;

// Function CommonDiaryPage.CommonDiaryPage_C.SetupDiary
// 0x00C8 (0x00C8 - 0x0000)
struct CommonDiaryPage_C_SetupDiary final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Key;                                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBArchiveDiaryCatalogData             diary_data;                                        // 0x0010(0x0058)(Edit, BlueprintVisible)
	class UPBArchiveManager*                      CallFunc_GetArchiveManager_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBArchiveDiaryCatalogData             CallFunc_GetArchiveDiaryCatalogData_ReturnValue;   // 0x0070(0x0058)()
};
DUMPER7_ASSERTS_CommonDiaryPage_C_SetupDiary;

}

