#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonHelpMessage

#include "Basic.hpp"


namespace SDK::Params
{

// Function CommonHelpMessage.CommonHelpMessage_C.ExecuteUbergraph_CommonHelpMessage
// 0x0008 (0x0008 - 0x0000)
struct CommonHelpMessage_C_ExecuteUbergraph_CommonHelpMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonHelpMessage_C_ExecuteUbergraph_CommonHelpMessage;

// Function CommonHelpMessage.CommonHelpMessage_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CommonHelpMessage_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonHelpMessage_C_PreConstruct;

// Function CommonHelpMessage.CommonHelpMessage_C.CloseMessage
// 0x0008 (0x0008 - 0x0000)
struct CommonHelpMessage_C_CloseMessage final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonHelpMessage_C_CloseMessage;

// Function CommonHelpMessage.CommonHelpMessage_C.OpenMessage
// 0x0008 (0x0008 - 0x0000)
struct CommonHelpMessage_C_OpenMessage final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonHelpMessage_C_OpenMessage;

// Function CommonHelpMessage.CommonHelpMessage_C.SetMessageText
// 0x0028 (0x0028 - 0x0000)
struct CommonHelpMessage_C_SetMessageText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonHelpMessage_C_SetMessageText;

}

