#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonSelectLamp

#include "Basic.hpp"


namespace SDK::Params
{

// Function CommonSelectLamp.CommonSelectLamp_C.ExecuteUbergraph_CommonSelectLamp
// 0x0004 (0x0004 - 0x0000)
struct CommonSelectLamp_C_ExecuteUbergraph_CommonSelectLamp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonSelectLamp_C_ExecuteUbergraph_CommonSelectLamp;

// Function CommonSelectLamp.CommonSelectLamp_C.Setup
// 0x0008 (0x0008 - 0x0000)
struct CommonSelectLamp_C_Setup final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonSelectLamp_C_Setup;

// Function CommonSelectLamp.CommonSelectLamp_C.SetActivate
// 0x0018 (0x0018 - 0x0000)
struct CommonSelectLamp_C_SetActivate final
{
public:
	bool                                          is_activate;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NewLocalVar_0;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonSelectLamp_C_SetActivate;

}

