#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonTabMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonTabMenu.CommonTabMenu_C
// 0x0048 (0x02A0 - 0x0258)
class UCommonTabMenu_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SELECT;                                            // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             MainText;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Off;                                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 On;                                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TagText;                                           // 0x0280(0x0018)(Edit, BlueprintVisible)
	class FName                                   Unique;                                            // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CommonTabMenu(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Selected(bool IsOn);
	void GetUniqueCode(class FName* Output);
	void Initialize();
	void SetTagTitle(const class FText& InText);
	void Setup();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonTabMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonTabMenu_C")
	}
	static class UCommonTabMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonTabMenu_C>();
	}
};
DUMPER7_ASSERTS_UCommonTabMenu_C;

}

