#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonSubMenuLIst

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonSubMenuLIst.CommonSubMenuLIst_C
// 0x00D0 (0x0328 - 0x0258)
class UCommonSubMenuLIst_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 back;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEffChoiceBP_C*                         EffChoiceBP;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Root;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          isNew;                                             // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          isEnable;                                          // 0x0281(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   text;                                              // 0x0288(0x0018)(Edit, BlueprintVisible)
	class FName                                   UniqueId;                                          // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TextColor;                                         // 0x02A8(0x0028)(Edit, BlueprintVisible)
	ETextJustify                                  TextJustification;                                 // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FText>                Contents;                                          // 0x02D8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_CommonSubMenuLIst(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Initialize();
	void Setup();
	void SetDispCursor(bool is_disp);
	void SetNameText(const class FText& InText);
	void SetNameColor(const struct FSlateColor& InColorAndOpacity);
	void SetNameJustification(ETextJustify InJustification);
	void SetUniqueID(class FName Input);
	void GetUniqueID(class FName* UniqueId_0);
	void SetEnable(bool IsEnabled);
	void GetEnable(bool is_true, bool* is_enable);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonSubMenuLIst_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonSubMenuLIst_C")
	}
	static class UCommonSubMenuLIst_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonSubMenuLIst_C>();
	}
};
DUMPER7_ASSERTS_UCommonSubMenuLIst_C;

}

