#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonLoadWaitAnim

#include "Basic.hpp"


namespace SDK::Params
{

// Function CommonLoadWaitAnim.CommonLoadWaitAnim_C.ExecuteUbergraph_CommonLoadWaitAnim
// 0x0018 (0x0018 - 0x0000)
struct CommonLoadWaitAnim_C_ExecuteUbergraph_CommonLoadWaitAnim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> K2Node_Event_OnStepChanged; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_ZOrder;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonLoadWaitAnim_C_ExecuteUbergraph_CommonLoadWaitAnim;

// Function CommonLoadWaitAnim.CommonLoadWaitAnim_C.Start
// 0x0014 (0x0014 - 0x0000)
struct CommonLoadWaitAnim_C_Start final
{
public:
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> OnStepChanged; // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	int32                                         ZOrder;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonLoadWaitAnim_C_Start;

// Function CommonLoadWaitAnim.CommonLoadWaitAnim_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct CommonLoadWaitAnim_C_Initialize final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonLoadWaitAnim_C_Initialize;

// Function CommonLoadWaitAnim.CommonLoadWaitAnim_C.OnStart
// 0x0008 (0x0008 - 0x0000)
struct CommonLoadWaitAnim_C_OnStart final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonLoadWaitAnim_C_OnStart;

}

