#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonMenuSortListWindowAll

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CommonMenuSortListWindowAll.CommonMenuSortListWindowAll_C.ExecuteUbergraph_CommonMenuSortListWindowAll
// 0x0044 (0x0044 - 0x0000)
struct CommonMenuSortListWindowAll_C_ExecuteUbergraph_CommonMenuSortListWindowAll final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName1_CmpSuccess;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonMenuSortListWindowAll_C_ExecuteUbergraph_CommonMenuSortListWindowAll;

// Function CommonMenuSortListWindowAll.CommonMenuSortListWindowAll_C.Tick
// 0x003C (0x003C - 0x0000)
struct CommonMenuSortListWindowAll_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonMenuSortListWindowAll_C_Tick;

// Function CommonMenuSortListWindowAll.CommonMenuSortListWindowAll_C.OnSelectSort
// 0x0010 (0x0010 - 0x0000)
struct CommonMenuSortListWindowAll_C_OnSelectSort final
{
public:
	class UPBSoundControlComponent*               CallFunc_GetSoundControlComponent_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelectLeft_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonMenuSortListWindowAll_C_OnSelectSort;

// Function CommonMenuSortListWindowAll.CommonMenuSortListWindowAll_C.OnSelectPick
// 0x0018 (0x0018 - 0x0000)
struct CommonMenuSortListWindowAll_C_OnSelectPick final
{
public:
	bool                                          CallFunc_IsSelectRight_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSoundControlComponent*               CallFunc_GetSoundControlComponent_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonMenuSortListWindowAll_C_OnSelectPick;

// Function CommonMenuSortListWindowAll.CommonMenuSortListWindowAll_C.OpenWindow
// 0x0001 (0x0001 - 0x0000)
struct CommonMenuSortListWindowAll_C_OpenWindow final
{
public:
	bool                                          IsPick_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonMenuSortListWindowAll_C_OpenWindow;

// Function CommonMenuSortListWindowAll.CommonMenuSortListWindowAll_C.GetWeaponPickKey
// 0x0002 (0x0002 - 0x0000)
struct CommonMenuSortListWindowAll_C_GetWeaponPickKey final
{
public:
	EWeaponType                                   PickKey;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponType                                   CallFunc_GetSelectPickKey_PickKey;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonMenuSortListWindowAll_C_GetWeaponPickKey;

// Function CommonMenuSortListWindowAll.CommonMenuSortListWindowAll_C.GetSortKey
// 0x0002 (0x0002 - 0x0000)
struct CommonMenuSortListWindowAll_C_GetSortKey final
{
public:
	EInventorySort                                sortKey;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInventorySort                                CallFunc_GetSelectSortKey_SortKey;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonMenuSortListWindowAll_C_GetSortKey;

// Function CommonMenuSortListWindowAll.CommonMenuSortListWindowAll_C.UpdateSortList
// 0x0050 (0x0050 - 0x0000)
struct CommonMenuSortListWindowAll_C_UpdateSortList final
{
public:
	TArray<EInventorySort>                        Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	struct FPBInventorySortData                   Input;                                             // 0x0010(0x0003)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EWeaponType>                           PickArray;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	struct FPBInventorySortData                   SortData;                                          // 0x0028(0x0003)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EInventorySort>                        keyArray;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<EWeaponType>                           K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
};
DUMPER7_ASSERTS_CommonMenuSortListWindowAll_C_UpdateSortList;

// Function CommonMenuSortListWindowAll.CommonMenuSortListWindowAll_C.ChangeStep
// 0x0014 (0x0014 - 0x0000)
struct CommonMenuSortListWindowAll_C_ChangeStep final
{
public:
	class FName                                   Step_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NewStep;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonMenuSortListWindowAll_C_ChangeStep;

// Function CommonMenuSortListWindowAll.CommonMenuSortListWindowAll_C.GetSortOrder
// 0x0002 (0x0002 - 0x0000)
struct CommonMenuSortListWindowAll_C_GetSortOrder final
{
public:
	bool                                          isOrder_0;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelectSortOrder_IsOrder;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonMenuSortListWindowAll_C_GetSortOrder;

// Function CommonMenuSortListWindowAll.CommonMenuSortListWindowAll_C.GetReturnValue
// 0x0004 (0x0004 - 0x0000)
struct CommonMenuSortListWindowAll_C_GetReturnValue final
{
public:
	int32                                         ret_0;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonMenuSortListWindowAll_C_GetReturnValue;

// Function CommonMenuSortListWindowAll.CommonMenuSortListWindowAll_C.GetSortData
// 0x000C (0x000C - 0x0000)
struct CommonMenuSortListWindowAll_C_GetSortData final
{
public:
	struct FPBInventorySortData                   Output;                                            // 0x0000(0x0003)(Parm, OutParm, NoDestructor)
	struct FPBInventorySortData                   NewLocalVar_1;                                     // 0x0003(0x0003)(Edit, BlueprintVisible, NoDestructor)
	EInventorySort                                CallFunc_GetSortKey_SortKey;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBInventorySortData                   K2Node_MakeStruct_PBInventorySortData;             // 0x0007(0x0003)(NoDestructor)
	EWeaponType                                   CallFunc_GetWeaponPickKey_PickKey;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSortOrder_IsOrder;                     // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonMenuSortListWindowAll_C_GetSortData;

}

