#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonAnimationArrow

#include "Basic.hpp"


namespace SDK::Params
{

// Function CommonAnimationArrow.CommonAnimationArrow_C.ExecuteUbergraph_CommonAnimationArrow
// 0x0008 (0x0008 - 0x0000)
struct CommonAnimationArrow_C_ExecuteUbergraph_CommonAnimationArrow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonAnimationArrow_C_ExecuteUbergraph_CommonAnimationArrow;

// Function CommonAnimationArrow.CommonAnimationArrow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CommonAnimationArrow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonAnimationArrow_C_PreConstruct;

// Function CommonAnimationArrow.CommonAnimationArrow_C.Setup
// 0x0008 (0x0008 - 0x0000)
struct CommonAnimationArrow_C_Setup final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonAnimationArrow_C_Setup;

// Function CommonAnimationArrow.CommonAnimationArrow_C.Selected
// 0x0008 (0x0008 - 0x0000)
struct CommonAnimationArrow_C_Selected final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CommonAnimationArrow_C_Selected;

// Function CommonAnimationArrow.CommonAnimationArrow_C.SetDispArrow
// 0x0001 (0x0001 - 0x0000)
struct CommonAnimationArrow_C_SetDispArrow final
{
public:
	bool                                          is_disp;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonAnimationArrow_C_SetDispArrow;

}

