#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonPopupButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function CommonPopupButton.CommonPopupButton_C.ExecuteUbergraph_CommonPopupButton
// 0x0008 (0x0008 - 0x0000)
struct CommonPopupButton_C_ExecuteUbergraph_CommonPopupButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonPopupButton_C_ExecuteUbergraph_CommonPopupButton;

// Function CommonPopupButton.CommonPopupButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CommonPopupButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonPopupButton_C_PreConstruct;

// Function CommonPopupButton.CommonPopupButton_C.SetButtonText
// 0x0018 (0x0018 - 0x0000)
struct CommonPopupButton_C_SetButtonText final
{
public:
	class FText                                   Input;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_CommonPopupButton_C_SetButtonText;

// Function CommonPopupButton.CommonPopupButton_C.SetCursorVisible
// 0x0001 (0x0001 - 0x0000)
struct CommonPopupButton_C_SetCursorVisible final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_CommonPopupButton_C_SetCursorVisible;

}

