#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonMenuListWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "UIScroll_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonMenuListWindow.CommonMenuListWindow_C
// 0x0040 (0x02E8 - 0x02A8)
class UCommonMenuListWindow_C : public UUIScroll_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CommonMenuListWindow_C;             // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Base;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeadBar;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollView;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UItemListItem_C*>                MenuLists;                                         // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Index_0;                                           // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDescendantScrollDestination                  ScrollType;                                        // 0x02E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CommonMenuListWindow(int32 EntryPoint);
	void BndEvt__ScrollView_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(float CurrentOffset);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void IsEnableListItem(bool* isEnable);
	void Initialize();
	void Setup();
	void Clean();
	void AddList(int32* Param_Index_0, class UItemListItem_C** retItem);
	void GetList(int32 Param_Index_0, class UItemListItem_C** ret);
	void GetSelectList(class UItemListItem_C** ret);
	void UpdateLast();
	void UpdateScroll();
	void SetMenuCursor(int32 Param_Index_0);
	void MoveMenuCursor(int32 MoveVal, class UItemListItem_C** Description);
	void ResetScrollOffset();
	void UpdateScrollOffset();
	void SetListIndex(int32 Param_Index_0);
	void ResetInternalScroll();
	void ClampListIndex();
	void IsListEmpty(bool* IsListEmpty_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonMenuListWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonMenuListWindow_C")
	}
	static class UCommonMenuListWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonMenuListWindow_C>();
	}
};
DUMPER7_ASSERTS_UCommonMenuListWindow_C;

}

