#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonAnimationArrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonAnimationArrow.CommonAnimationArrow_C
// 0x0028 (0x0280 - 0x0258)
class UCommonAnimationArrow_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SELECT;                                            // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 effect;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Root;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CommonAnimationArrow(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Initialize();
	void Setup();
	void Selected();
	void SetDispArrow(bool is_disp);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonAnimationArrow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonAnimationArrow_C")
	}
	static class UCommonAnimationArrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonAnimationArrow_C>();
	}
};
DUMPER7_ASSERTS_UCommonAnimationArrow_C;

}

