#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonYesNoPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "PopupParam_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommonYesNoPopup.CommonYesNoPopup_C
// 0x00F8 (0x0370 - 0x0278)
class UCommonYesNoPopup_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOff;                                           // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOn;                                            // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CountdownImage;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFadeWidget_C*                          FadeWidget;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SelectTimeText;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UYesNoPopup_C*                          YesNoPopup;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         Inventory;                                         // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBSoundControlComponent*               SoundComponent;                                    // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   text;                                              // 0x02C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FPopupParam                            Param;                                             // 0x02D8(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventPopupOpened;                                  // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventPopupClosed;                                  // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventPopupSelectYes;                               // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventPopupSelectNo;                                // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         CountTime;                                         // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           T_CountDown;                                       // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CommonYesNoPopup(int32 EntryPoint);
	void OnYes();
	void OnNo();
	void UpdateCountdown();
	void PreConstruct(bool IsDesignTime);
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void Construct();
	void BndEvt__YesNoPopup_K2Node_ComponentBoundEvent_2_EventPopupClosed__DelegateSignature();
	void BndEvt__YesNoPopup_K2Node_ComponentBoundEvent_1_EventPopupOpened__DelegateSignature();
	void PopupClosed();
	void SetupEventPopupClosed();
	void Initialize();
	void Setup();
	void OnStart();
	void OpenPopup(const class FText& input_text, const struct FPopupParam& input_param);
	void ClosePopup();
	void GetPopupReturn(int32* return_0);
	void SetPopupText(const class FText& in_text);
	void UpdateChaosEvents();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CommonYesNoPopup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonYesNoPopup_C")
	}
	static class UCommonYesNoPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonYesNoPopup_C>();
	}
};
DUMPER7_ASSERTS_UCommonYesNoPopup_C;

}

