#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConfigOtherMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UIScroll_classes.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ConfigOtherMenu.ConfigOtherMenu_C
// 0x0138 (0x03E0 - 0x02A8)
class UConfigOtherMenu_C final : public UUIScroll_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ConfigOtherMenu_C;                  // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonSideSelecterItem_C*              Other00_language;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonSideSelecterItem_C*              Other01_voice;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonSideSelecterItem_C*              Other02_subtitles;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonSideSelecterItem_C*              Other03_vibration;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonSideSelecterItem_C*              Other04_showhints;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonSideSelecterItem_C*              Other05_shardgetanimation;                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonSideSelecterItem_C*              Other06_bloodcolor;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonSideSelecterItem_C*              Other07_swapconfirmback;                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonSideSelecterItem_C*              Other08_mousemenuinput;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonSideSelecterItem_C*              Other09_reduceinputlag;                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonSideSelecterItem_C*              Other10_epicaccount;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCommonSideSelecterItem_C*>      ListItems;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<class FString, int32>                    Cultures;                                          // 0x0328(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 DefCulture;                                        // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<class FString, int32>                    VoLanguages;                                       // 0x0388(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UCommonSideSelecterItem_C*              AddItem;                                           // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ConfigOtherMenu(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void SetupList();
	void AddList(class UCommonSideSelecterItem_C* add_list);
	void GetList(int32 Param_Index_0, class UCommonSideSelecterItem_C** Output);
	void GetSelectList(class UCommonSideSelecterItem_C** Output);
	void RevertSettingsToInitialValues();
	void RevertCultureAndVoice();
	void Clean();
	void Refresh();
	void MoveCursor(int32 Move);
	void SetupCulture();
	void SetupVoiceCulture();
	void SwitchSelecter(int32 Move);
	void IsUpdateMenu(bool* isEnable);
	void GetSelectCulture(class FString* Output);
	void GetSelectedVoiceCultureString(class FString* Output);
	void SetVoiceCulture();
	void IsChangeCulture(bool* is_enable);
	void IsAddList(class UCommonSideSelecterItem_C* AddItem_0, bool* isEnable);
	void ResetAllSettings();
	void SetupOtherSettings();
	void ApplyOtherSettings();
	void GetCurrentSelectHelpText(class FText* helpText);
	void ForceEpicAccountSettingOff();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ConfigOtherMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConfigOtherMenu_C")
	}
	static class UConfigOtherMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfigOtherMenu_C>();
	}
};
DUMPER7_ASSERTS_UConfigOtherMenu_C;

}

