#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConfigMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ConfigMenu.ConfigMenu_C
// 0x0130 (0x03A8 - 0x0278)
class UConfigMenu_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UClanListWindow_C*                      ClanMenuList;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonMenuHeader_C*                    CommonHeader;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonHelpMessage_C*                   CommonHelpMessage;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConfigKeyAssignMenu_C*                 ConfigKeyAssignMenu;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConfigMenuTab_C*                       ConfigMenuTab;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConfigOtherMenu_C*                     ConfigOtherMenu;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ConfigPanel;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConfigSoundMenu_C*                     ConfigSoundMenu;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfigTabWindow;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConfigUserDataMenu_C*                  ConfigUserDataMenu;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConfigVisualMenu_C*                    ConfigVisualMenu;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonControllGuide_C*                 ControllGuide;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFadeWidget_C*                          FadeWidget;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MenuSwitcher;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UYesNoPopup_C*                          YesNoPopup;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UObject*>                        KeySetMenuList;                                    // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         buttonIndex;                                       // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUpdate;                                          // 0x031C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCharacterInventoryComponent*         RefCharacterInventry;                              // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 OtherList;                                         // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UCommonTabMenu_C*>               TabMenuList;                                       // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FText                                   PopupText;                                         // 0x0348(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	UMulticastDelegateProperty_                   EventConfirmed;                                    // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventClosedMenu;                                   // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWidgetAnimation*                       FinishedAnim;                                      // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsReturnKey;                                       // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   EventCanceled;                                     // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          WaitingForEpicLogin;                               // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          WaitingForEpicSave;                                // 0x03A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EpicAccountRetry;                                  // 0x03A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ConfigMenu(int32 EntryPoint);
	void OnSaveWidgetClosed();
	void EpicAccountLoginComplete(bool Success, bool NoEAS);
	void OnPressedButton();
	void ReturnUserDataMenu();
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void MoveTabLeftApply();
	void MoveTabLeftNo();
	void MoveTabLeftYes();
	void SetupMoveTabLeftNo();
	void SetupMoveTabLeftYes();
	void EventMoveTabLeft(const class FText& in_text);
	void MoveTabRightApply();
	void MoveTabRightNo();
	void MoveTabRightYes();
	void SetupMoveTabRightNo();
	void SetupMoveTabRightYes();
	void EventMoveTabRight(const class FText& in_text);
	void EventCloseMenuApply();
	void EventCloseMenuNo();
	void EventCloseMenuYes();
	void SetupEventCloseMenuNo();
	void SetupEventCloseMenuYes();
	void EventCloseMenu(const class FText& in_text);
	void EventAllApplyNo();
	void EventAllApplyYes();
	void SetupEventAllApplyNo();
	void SetupEventAllApplyYes();
	void EventAllApply(const class FText& in_text);
	void EventReturnDefaultNo();
	void EventReturnDefaultYes();
	void SetupEventReturnDefaultNo();
	void SetupEventReturnDefaultYes();
	void EventReturnDefault(const class FText& in_text);
	void WidgetAnimationEvt_out_K2Node_WidgetAnimationEvent_0();
	void BactToConfig();
	void カスタムイベント_0();
	void SwitchTab(int32 Move);
	void DecideKeyAction();
	void ApplyChanges();
	void UpdateControllGuide();
	void ReturnConfigMenu(class FName NextStep);
	void OpenClanListMenu();
	void CloseClanListMenu();
	void ReturnToConfig();
	void ApplyAll();
	void ResetAllSettingsInCurrentMenuToDefault();
	void SwitchMenu(int32 Index_0, bool ForceUpdateTabIndex);
	void ApplyScreenModeAndResolution();
	void OnSetKeyAssign();
	void OnVisualMenu();
	void OnOtherMenu();
	void OnUserDataMenu();
	void OnSelectClan();
	void OnYesNoPopup();
	void SetMenuStep();
	void RevertAllSettingsInCurrentMenuToInitialValues();
	void ApplyCancel();
	void GetSelectCulture(class FString* Output);
	void Initialize();
	void Setup();
	void OnStart();
	void OnSelectKeyAction();
	void OnSoundMenu();
	void IsChangeCulture(bool* is_enable);
	void OpenMenu(EUserWidgetPriority Priority_0);
	void ApplyNonScreenModeGraphicsSettings();
	void ApplyOtherSettings();
	void UpdateHelpText();
	void ApplyEpicAccountLinking();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ConfigMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConfigMenu_C")
	}
	static class UConfigMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfigMenu_C>();
	}
};
DUMPER7_ASSERTS_UConfigMenu_C;

}

