#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConfigSoundMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIScroll_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ConfigSoundMenu.ConfigSoundMenu_C
// 0x0050 (0x02F8 - 0x02A8)
class UConfigSoundMenu_C final : public UUIScroll_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ConfigSoundMenu_C;                  // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             ScrollboxSound;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundSliderSet_C*                      Sound00;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundSliderSet_C*                      Sound000Master;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundSliderSet_C*                      Sound01;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundSliderSet_C*                      Sound02;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundSliderSet_C*                      Sound03;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class USoundSliderSet_C*>              ListItems;                                         // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Index_0;                                           // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUpdate;                                          // 0x02F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ConfigSoundMenu(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void GetList(int32 Input, class USoundSliderSet_C** Output);
	void GetSelectList(class USoundSliderSet_C** Output);
	void Refresh();
	void MoveCursor(int32 Move);
	void SetVolumeByType(float Move);
	void GetVolumeByType(float* Output);
	void SwitchVolume(float Value, bool* is_enable);
	void IsSelectSoundTest(bool* isEnable);
	void IsUpdateMenu(bool* isEnable);
	void RevertSettingsToInitialValues();
	void GetCurrentSelectHelpText(class FText* helpText);
	void ResetAllVolumeSettingsToDefault();
	void StopPlayingSounds();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ConfigSoundMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConfigSoundMenu_C")
	}
	static class UConfigSoundMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfigSoundMenu_C>();
	}
};
DUMPER7_ASSERTS_UConfigSoundMenu_C;

}

