#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlActName

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ControlActName.ControlActName_C
// 0x01F8 (0x0450 - 0x0258)
class UControlActName_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Name_0;                                            // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ETextJustify                                  Justificate;                                       // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBGamePadKey                                 Pad;                                               // 0x0269(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPBGameKey, class FText>                 ActionText;                                        // 0x0270(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<EPBGameKey, class FText>                 ActionText_Zangetsu;                               // 0x02C0(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<EPBGameKey, class FText>                 ActionText_Bloodless;                              // 0x0310(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<EPBGameKey, EPBBloodlessAbilityType>     ActionText_Bloodless_AbilityMap;                   // 0x0360(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<EPBGameKey, class FText>                 ActionText_ChildOfLight;                           // 0x03B0(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<EPBGameKey, class FText>                 ActionText_Classic;                                // 0x0400(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ControlActName(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Initialize();
	void Setup();
	void UpdateActionName();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ControlActName_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ControlActName_C")
	}
	static class UControlActName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlActName_C>();
	}
};
DUMPER7_ASSERTS_UControlActName_C;

}

