#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Course

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Course.Course_C.ExecuteUbergraph_Course
// 0x0008 (0x0008 - 0x0000)
struct Course_C_ExecuteUbergraph_Course final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Course_C_ExecuteUbergraph_Course;

// Function Course.Course_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Course_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Course_C_PreConstruct;

// Function Course.Course_C.SetDispCursor
// 0x0018 (0x0018 - 0x0000)
struct Course_C_SetDispCursor final
{
public:
	bool                                          InDisp;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NewLocalVar_0;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Visible;                                           // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Course_C_SetDispCursor;

// Function Course.Course_C.SetUnlockedFlag
// 0x0118 (0x0118 - 0x0000)
struct Course_C_SetUnlockedFlag final
{
public:
	struct FPBSystemInformation                   Information;                                       // 0x0000(0x0080)(Edit, BlueprintVisible)
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBSystemInformation                   CallFunc_GetSystemInformation_Information;         // 0x0090(0x0080)()
	bool                                          CallFunc_GetSystemInformation_ReturnValue;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Course_C_SetUnlockedFlag;

// Function Course.Course_C.SetCourceImage
// 0x0008 (0x0008 - 0x0000)
struct Course_C_SetCourceImage final
{
public:
	class UTexture2D*                             In_Texture;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Course_C_SetCourceImage;

// Function Course.Course_C.SetCourceMode
// 0x0010 (0x0010 - 0x0000)
struct Course_C_SetCourceMode final
{
public:
	class UPBGameInstance*                        Instance;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Course_C_SetCourceMode;

// Function Course.Course_C.GetCourceMode
// 0x0001 (0x0001 - 0x0000)
struct Course_C_GetCourceMode final
{
public:
	EPBExtraModeCourse                            Mode_0;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Course_C_GetCourceMode;

// Function Course.Course_C.IsUnlockCource
// 0x0004 (0x0004 - 0x0000)
struct Course_C_IsUnlockCource final
{
public:
	bool                                          is_true;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          is_unlock;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TRUE_0;                                            // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Course_C_IsUnlockCource;

}

