#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: craftTriangleAnm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass craftTriangleAnm.craftTriangleAnm_C
// 0x0028 (0x0280 - 0x0258)
class UcraftTriangleAnm_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow01;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow02;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow03;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_craftTriangleAnm(int32 EntryPoint);
	void Construct();
	void Initialize();
	void PlayLoop();
	void Setup();
	void StopLoop();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("craftTriangleAnm_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"craftTriangleAnm_C")
	}
	static class UcraftTriangleAnm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UcraftTriangleAnm_C>();
	}
};
DUMPER7_ASSERTS_UcraftTriangleAnm_C;

}

