#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CriWareRuntime_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class CriWareRuntime.AtomAsrRack
// 0x0018 (0x0040 - 0x0028)
class UAtomAsrRack final : public UObject
{
public:
	int32                                         RackId;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x14];                                      // 0x002C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAtomAsrRack* GetAsrRack(int32 AsrRackId);
	static class UAtomAsrRack* GetDefaultAsrRack();

	void ApplyDspBusSnapshot(const class FString& SnapshotName, int32 Milliseconds);
	void AttachDspBusSetting(const class FString& SettingName);
	void ConnectToPadSpeaker(int32 UserIndex);
	void DetachDspBusSetting();
	bool GetBusAnalyzerInfo(const class FString& DspBusName, int32* num_channels, TArray<float>* rms_levels, TArray<float>* peak_levels, TArray<float>* peak_hold_levels);
	void SetBusSendLevelByName(const class FString& SourceBusName, const class FString& DestBusName, float Level);
	void SetBusVolumeByName(const class FString& BusName, float Volume);
	void SetEffectBypass(const class FString& BusName, const class FString& EffectName, bool Bypasses);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomAsrRack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomAsrRack")
	}
	static class UAtomAsrRack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAsrRack>();
	}
};
DUMPER7_ASSERTS_UAtomAsrRack;

// Class CriWareRuntime.AtomCategory
// 0x0000 (0x0028 - 0x0028)
class UAtomCategory final : public UBlueprintFunctionLibrary
{
public:
	static void GetAttachedAisacInfoById(int32 CategoryId, int32 AisacAttachedIndex, bool* IsSuccess, struct FAtomAisacInfo* AisacInfo);
	static void GetAttachedAisacInfoByName(const class FString& CategoryName, int32 AisacAttachedIndex, bool* IsSuccess, struct FAtomAisacInfo* AisacInfo);
	static float GetCurrentAisacControlValueById(int32 CategoryId, int32 AisacControlId);
	static float GetCurrentAisacControlValueByName(const class FString& CategoryName, const class FString& AisacControlName);
	static int32 GetNumAttachedAisacsById(int32 CategoryId);
	static int32 GetNumAttachedAisacsByName(const class FString& CategoryName);
	static float GetVolumeByName(const class FString& CategoryName);
	static bool IsPausedByName(const class FString& CategoryName);
	static void PauseByName(const class FString& CategoryName, bool bPause);
	static bool ResetAllAisacControlById(int32 CategoryId);
	static bool ResetAllAisacControlByName(const class FString& CategoryName);
	static void SetAisacControlByName(const class FString& CategoryName, const class FString& AisacName, float Value);
	static void SetVolumeByName(const class FString& CategoryName, float Volume);
	static void StopByName(const class FString& CategoryName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomCategory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomCategory")
	}
	static class UAtomCategory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomCategory>();
	}
};
DUMPER7_ASSERTS_UAtomCategory;

// Class CriWareRuntime.AtomComponent
// 0x0C98 (0x1030 - 0x0398)
class UAtomComponent final : public USceneComponent
{
public:
	class USoundAtomCue*                          Sound;                                             // 0x0398(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAutoDestroy : 1;                                  // 0x03A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bPersistAcrossLevelTransition;                     // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bStopWhenOwnerDestroyed : 1;                       // 0x03A8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsUISound : 1;                                    // 0x03A8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultVolume;                                     // 0x03B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMultipleSoundPlayback;                      // 0x03B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePlaylist;                                      // 0x03B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B6[0x2];                                      // 0x03B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomSoundObject*                       DefaultSoundObject;                                // 0x03B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultBlockIndex;                                 // 0x03C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAtomAisacControlParam>         DefaultAisacControl;                               // 0x03C8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomSelectorParam>             DefaultSelectorLabel;                              // 0x03D8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EAtomLoopSettingID                            LoopSetting;                                       // 0x03E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnly2DSound;                                      // 0x03E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3EA[0x6];                                      // 0x03EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnAudioFinished;                                   // 0x03F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UWorld*                                 PlayWorld;                                         // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameViewportClient*                    GameViewport;                                      // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_410[0x18];                                     // 0x0410(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bOverrideAttenuation : 1;                          // 0x0428(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAttenuation*                      AttenuationSettings;                               // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoundAttenuationSettings              AttenuationOverrides;                              // 0x0438(0x02E8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_720[0x8D8];                                    // 0x0720(0x08D8)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCueSheet*                     CueSheet;                                          // 0x0FF8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1000[0x10];                                    // 0x1000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomSoundObject*                       AppliedSoundObject;                                // 0x1010(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1018[0x18];                                    // 0x1018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void DestroyComponentByID(int32 TargetID);
	static class UAtomComponent* GetAtomComponentFromID(int32 TargetID);
	static bool GetDefaultAttenuationEnable();
	static void SetDefaultAttenuationEnable(bool bEnable);

	void EnqueueSound(class USoundAtomCue* NewSound);
	void FadeIn(float FadeInDuration, float FadeVolumeLevel, float StartTime);
	void FadeOut(float FadeOutDuration, float FadeVolumeLevel);
	float GetVolume();
	void Pause(bool bPause);
	void Play(float StartTime);
	void SetAisacByName(const class FString& ControlName, float ControlValue);
	void SetAsrRackID(int32 asr_rack_id);
	void SetAsrRackIdArray(const TArray<int32>& AsrRackIDs);
	void SetBusSendLevel(int32 BusId, float Level);
	void SetBusSendLevelByName(const class FString& BusName, float Level);
	void SetBusSendLevelOffset(int32 BusId, float LevelOffset);
	void SetBusSendLevelOffsetByName(const class FString& BusName, float LevelOffset);
	void SetNextBlockIndex(int32 BlockIndex);
	void SetPitch(float Pitch);
	void SetPitchMultiplier(float NewPitchMultiplier);
	void SetSelectorLabel(const class FString& Selector, const class FString& Label);
	void SetSound(class USoundAtomCue* NewSound);
	void SetSoundObject(class UAtomSoundObject* SoundObject);
	void SetVolume(float Volume);
	void Stop();
	void StopWithoutReleaseTime();

	int32 GetAtomComponentID() const;
	class FString GetCueName() const;
	float GetCurrentCullingBoundaryDistance() const;
	float GetCurrentCullingMarginDistance() const;
	float GetCurrentEconomicTickBoundaryDistance() const;
	float GetCurrentEconomicTickFrequency() const;
	float GetCurrentEconomicTickMarginDistance() const;
	float GetCurrentMaxAttenuationDistance() const;
	int32 GetNumQueuedSounds() const;
	float GetSequencePosition() const;
	EAtomComponentStatus GetStatus() const;
	float GetTime() const;
	bool HasBeenEconomicTick() const;
	bool IsLoop() const;
	bool IsPaused() const;
	bool IsPlaying() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomComponent")
	}
	static class UAtomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomComponent>();
	}
};
DUMPER7_ASSERTS_UAtomComponent;

// Class CriWareRuntime.AtomComponentPool
// 0x0040 (0x0068 - 0x0028)
class UAtomComponentPool final : public UObject
{
public:
	TArray<class UAtomComponent*>                 Pool;                                              // 0x0028(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x30];                                      // 0x0038(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomComponentPool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomComponentPool")
	}
	static class UAtomComponentPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomComponentPool>();
	}
};
DUMPER7_ASSERTS_UAtomComponentPool;

// Class CriWareRuntime.AtomCueSheetLoaderComponent
// 0x0098 (0x0430 - 0x0398)
class UAtomCueSheetLoaderComponent final : public USceneComponent
{
public:
	struct FSoftObjectPath                        CueSheetReference;                                 // 0x0398(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCriFsBinderComponent*                  BinderComponent;                                   // 0x03B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLoadCompleted;                                   // 0x03B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLoadError;                                       // 0x03C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D8[0x30];                                     // 0x03D8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCueSheet*                     CueSheet;                                          // 0x0408(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_410[0x20];                                     // 0x0410(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void LoadAtomCueSheet(class UObject* WorldContextObject, TSoftObjectPtr<class USoundAtomCueSheet> Asset, TDelegate<void(class USoundAtomCueSheet* Loaded)> OnLoaded, const struct FLatentActionInfo& LatentInfo);

	class USoundAtomCueSheet* GetAtomCueSheet();
	EAtomCueSheetLoaderComponentStatus GetStatus();
	void Load();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomCueSheetLoaderComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomCueSheetLoaderComponent")
	}
	static class UAtomCueSheetLoaderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomCueSheetLoaderComponent>();
	}
};
DUMPER7_ASSERTS_UAtomCueSheetLoaderComponent;

// Class CriWareRuntime.AtomDeviceWatcher
// 0x0028 (0x0050 - 0x0028)
class UAtomDeviceWatcher final : public UObject
{
public:
	UMulticastDelegateProperty_                   OnDeviceUpdated;                                   // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetDeviceChannelCount();
	class FString GetDeviceName();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomDeviceWatcher")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomDeviceWatcher")
	}
	static class UAtomDeviceWatcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomDeviceWatcher>();
	}
};
DUMPER7_ASSERTS_UAtomDeviceWatcher;

// Class CriWareRuntime.AtomDisposer
// 0x0010 (0x0498 - 0x0488)
class AAtomDisposer final : public AActor
{
public:
	uint8                                         Pad_488[0x10];                                     // 0x0488(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomDisposer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomDisposer")
	}
	static class AAtomDisposer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomDisposer>();
	}
};
DUMPER7_ASSERTS_AAtomDisposer;

// Class CriWareRuntime.AtomListenerFocusPoint
// 0x0018 (0x03B0 - 0x0398)
class UAtomListenerFocusPoint final : public USceneComponent
{
public:
	float                                         DistanceFocusLevel;                                // 0x0398(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirectionFocusLevel;                               // 0x039C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A0[0x10];                                     // 0x03A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomListenerFocusPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomListenerFocusPoint")
	}
	static class UAtomListenerFocusPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomListenerFocusPoint>();
	}
};
DUMPER7_ASSERTS_UAtomListenerFocusPoint;

// Class CriWareRuntime.AtomParameterComponent
// 0x0008 (0x0238 - 0x0230)
class UAtomParameterComponent final : public UActorComponent
{
public:
	class UAtomSoundObject*                       SoundObject;                                       // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomParameterComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomParameterComponent")
	}
	static class UAtomParameterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomParameterComponent>();
	}
};
DUMPER7_ASSERTS_UAtomParameterComponent;

// Class CriWareRuntime.AtomProfileData
// 0x0000 (0x0028 - 0x0028)
class UAtomProfileData final : public UBlueprintFunctionLibrary
{
public:
	static void CriWareAdx2ProfileDataSort(const TArray<struct FAtomProfileItem>& original_item, EAtomProfileSortType sort_type, EAtomSortOrderType order_type, TArray<struct FAtomProfileItem>* sorted_item);
	static TArray<struct FAtomProfileItem> CriWareAdx2ProfileDataUpdate(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomProfileData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomProfileData")
	}
	static class UAtomProfileData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomProfileData>();
	}
};
DUMPER7_ASSERTS_UAtomProfileData;

// Class CriWareRuntime.AtomSound
// 0x0008 (0x0490 - 0x0488)
class AAtomSound final : public AActor
{
public:
	class UAtomComponent*                         AtomComponent;                                     // 0x0488(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomSound")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomSound")
	}
	static class AAtomSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomSound>();
	}
};
DUMPER7_ASSERTS_AAtomSound;

// Class CriWareRuntime.AtomSoundData
// 0x0010 (0x0498 - 0x0488)
class AAtomSoundData final : public AActor
{
public:
	class USoundAtomCueSheet*                     CueSheet;                                          // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_490[0x8];                                      // 0x0490(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomSoundData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomSoundData")
	}
	static class AAtomSoundData* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAtomSoundData>();
	}
};
DUMPER7_ASSERTS_AAtomSoundData;

// Class CriWareRuntime.AtomSoundObject
// 0x0018 (0x0048 - 0x0030)
class UAtomSoundObject final : public UDataAsset
{
public:
	bool                                          EnableVoiceLimitScope;                             // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableCategoryCueLimitScope;                       // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x16];                                      // 0x0032(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomSoundObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomSoundObject")
	}
	static class UAtomSoundObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomSoundObject>();
	}
};
DUMPER7_ASSERTS_UAtomSoundObject;

// Class CriWareRuntime.AtomSpectrumAnalyzer
// 0x0000 (0x0028 - 0x0028)
class UAtomSpectrumAnalyzer final : public UBlueprintFunctionLibrary
{
public:
	static void CreateDspSpectra(class UAtomAsrRack* asr_rack, const class FString& bus_name, int32 num_bands);
	static void GetLevels(TArray<float>* spectra);
	static void GetLevelsDB(float display_range, TArray<float>* spectra);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomSpectrumAnalyzer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomSpectrumAnalyzer")
	}
	static class UAtomSpectrumAnalyzer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomSpectrumAnalyzer>();
	}
};
DUMPER7_ASSERTS_UAtomSpectrumAnalyzer;

// Class CriWareRuntime.AtomStatics
// 0x0000 (0x0028 - 0x0028)
class UAtomStatics final : public UBlueprintFunctionLibrary
{
public:
	static void AddToAtomComponentIds(class UObject* AtomPlayGateRef, class UObject* SkeltalMeshComponentRef, int32 AtomComponentID);
	static class UAtomComponent* CreateRootedAtomComponent(const class UObject* WorldContextObject, bool bAutoDestroy);
	static bool LoadAtomConfig(class USoundAtomConfig* AcfObject);
	static void PauseAudioOutput(bool bPause);
	static void PlaySoundAtLocation(class UObject* WorldContextObject, class USoundAtomCue* Sound, const struct FVector& Location, const struct FRotator& Rotation, float VolumeMultiplier, float PitchMultiplier, float StartTime, class USoundAttenuation* AttenuationSettings, class USoundConcurrency* ConcurrencySettings);
	static class UAtomComponent* PlaySoundAttached(class USoundAtomCue* Sound, class USceneComponent* AttachToComponent, class FName AttachPointName, const struct FVector& Location, bool bStopWhenAttachedToDestroyed, float VolumeMultiplier, float PitchMultiplier, float StartTime, class USoundAttenuation* AttenuationSettings);
	static class UAtomComponent* PlaySoundForAnimNotify(class USoundAtomCue* Sound, class USceneComponent* AttachToComponent, class FName AttachPointName, const struct FVector& Location, bool bStopWhenAttachedToDestroyed, float VolumeMultiplier, float PitchMultiplier, float StartTime, class USoundAttenuation* AttenuationSettings, bool bFollow);
	static class UAtomComponent* SpawnSound2D(const class UObject* WorldContextObject, class USoundAtomCue* Sound, float PitchMultiplier, float StartTime, bool bPersistAcrossLevelTransition, bool bAutoDestroy);
	static class UAtomComponent* SpawnSoundAtLocation(const class UObject* WorldContextObject, class USoundAtomCue* Sound, const struct FVector& Location, const struct FRotator& Rotation, float VolumeMultiplier, float PitchMultiplier, float StartTime, class USoundAttenuation* AttenuationSettings, class USoundConcurrency* ConcurrencySettings, bool bAutoDestroy);
	static class UAtomComponent* SpawnSoundAttached(class USoundAtomCue* Sound, class USceneComponent* AttachToComponent, class FName AttachPointName, const struct FVector& Location, const struct FRotator& Rotation, EAttachLocation LocationType, bool bStopWhenAttachedToDestroyed, float VolumeMultiplier, float PitchMultiplier, float StartTime, class USoundAttenuation* AttenuationSettings, class USoundConcurrency* ConcurrencySettings, bool bAutoDestroy);
	static void StopAllSounds();
	static void StopAllSoundsForKeyFromAtomComponentIds(class UObject* AtomPlayGateRef, class UObject* SkeltalMeshComponentRef);
	static void UpdateDistanceFactorForAllSounds(float ArgDistanceFactor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomStatics")
	}
	static class UAtomStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomStatics>();
	}
};
DUMPER7_ASSERTS_UAtomStatics;

// Class CriWareRuntime.AtomTriggerTableFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAtomTriggerTableFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool GetDataTableRowFromName(class UDataTable* Table, class FName RowName, struct FAtomTriggerRow* OutRow);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomTriggerTableFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomTriggerTableFunctionLibrary")
	}
	static class UAtomTriggerTableFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomTriggerTableFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UAtomTriggerTableFunctionLibrary;

// Class CriWareRuntime.AtomUnrealSoundRenderer
// 0x8050 (0x8340 - 0x02F0)
class UAtomUnrealSoundRenderer final : public USoundWaveProcedural
{
public:
	uint8                                         Pad_2F0[0x8050];                                   // 0x02F0(0x8050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AtomUnrealSoundRenderer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomUnrealSoundRenderer")
	}
	static class UAtomUnrealSoundRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomUnrealSoundRenderer>();
	}
};
DUMPER7_ASSERTS_UAtomUnrealSoundRenderer;

// Class CriWareRuntime.CriFsBinderComponent
// 0x0058 (0x03F0 - 0x0398)
class UCriFsBinderComponent final : public USceneComponent
{
public:
	class FString                                 FilePath;                                          // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnBindCompleted;                                   // 0x03A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnBindError;                                       // 0x03B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C8[0x28];                                     // 0x03C8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Bind();
	ECriFsBinderStatus GetStatus();
	void Stop();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CriFsBinderComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CriFsBinderComponent")
	}
	static class UCriFsBinderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriFsBinderComponent>();
	}
};
DUMPER7_ASSERTS_UCriFsBinderComponent;

// Class CriWareRuntime.CriFsLoader
// 0x0008 (0x0490 - 0x0488)
class ACriFsLoader final : public AActor
{
public:
	class UCriFsLoaderComponent*                  LoaderComponent;                                   // 0x0488(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CriFsLoader")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CriFsLoader")
	}
	static class ACriFsLoader* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACriFsLoader>();
	}
};
DUMPER7_ASSERTS_ACriFsLoader;

// Class CriWareRuntime.CriFsLoaderComponent
// 0x0078 (0x0410 - 0x0398)
class UCriFsLoaderComponent final : public USceneComponent
{
public:
	class FString                                 FilePath;                                          // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLoadCompleted;                                   // 0x03A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLoadError;                                       // 0x03B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C8[0x48];                                     // 0x03C8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const TArray<uint8> GetDataArray();
	ECriFsLoaderStatus GetStatus();
	void Load();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CriFsLoaderComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CriFsLoaderComponent")
	}
	static class UCriFsLoaderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriFsLoaderComponent>();
	}
};
DUMPER7_ASSERTS_UCriFsLoaderComponent;

// Class CriWareRuntime.CriWareFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UCriWareFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void SetGameVariableByName(const class FString& GameVariableName, float Value);
	static void SetGlobalLabelToSelectorByName(const class FString& SelectorName, const class FString& LabelName);
	static void SetSpeakerAngleArray(ECriWareSpeakerSystem SpeakerSystem, const TArray<float>& Angles);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CriWareFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CriWareFunctionLibrary")
	}
	static class UCriWareFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriWareFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UCriWareFunctionLibrary;

// Class CriWareRuntime.CriWareInitializer
// 0x0000 (0x0028 - 0x0028)
class UCriWareInitializer final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CriWareInitializer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CriWareInitializer")
	}
	static class UCriWareInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriWareInitializer>();
	}
};
DUMPER7_ASSERTS_UCriWareInitializer;

// Class CriWareRuntime.CriWarePluginSettings
// 0x02B8 (0x02E0 - 0x0028)
class UCriWarePluginSettings final : public UObject
{
public:
	bool                                          bNoExistCriWareIni;                                // 0x0028(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEditableCriWareAdxLipSyncSetting;                 // 0x0029(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDirectoryPath                         NonAssetContentDir;                                // 0x0030(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FString                                 ContentDir;                                        // 0x0040(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumBinders;                                        // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxBinds;                                          // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumLoaders;                                        // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxPath;                                           // 0x0078(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          OutputsLogFileSystem;                              // 0x0080(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_FileAccessThreadAffinityMask;                  // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x4];                                       // 0x0088(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_DataDecompressionThreadAffinityMask;           // 0x008C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x4];                                       // 0x0090(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_MemoryFileSystemThreadAffinityMask;            // 0x0094(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x4];                                       // 0x0098(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_FileAccessThreadPriority;                      // 0x009C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x4];                                       // 0x00A0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_DataDecompressionThreadPriority;               // 0x00A4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x4];                                       // 0x00A8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_MemoryFileSystemThreadPriority;                // 0x00AC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x4];                                       // 0x00B0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          AutomaticallyCreateCueAsset;                       // 0x00B4(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsesInGamePreview;                                 // 0x00B5(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B6[0x1];                                       // 0x00B6(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          OutputsLogAtom;                                    // 0x00B7(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x4];                                       // 0x00B8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxVirtualVoices;                                  // 0x00BC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x4];                                       // 0x00C0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumStandardMemoryVoices;                           // 0x00C4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x4];                                       // 0x00C8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StandardMemoryVoiceNumChannels;                    // 0x00CC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x4];                                       // 0x00D0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StandardMemoryVoiceSamplingRate;                   // 0x00D4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x4];                                       // 0x00D8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumStandardStreamingVoices;                        // 0x00DC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x4];                                       // 0x00E0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StandardStreamingVoiceNumChannels;                 // 0x00E4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x4];                                       // 0x00E8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StandardStreamingVoiceSamplingRate;                // 0x00EC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x4];                                       // 0x00F0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          PoolAtomComponent;                                 // 0x00F4(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        AtomConfig;                                        // 0x00F8(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x18];                                     // 0x0110(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AcfFileName;                                       // 0x0128(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        AtomConfigDataTable;                               // 0x0138(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_150[0x18];                                     // 0x0150(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceFactor;                                    // 0x0168(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	EAtomSoundRendererType                        SoundRendererTypeUI;                               // 0x0170(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SoundRendererType;                                 // 0x0174(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAtomAsrRackConfigUI>           AsrRackConfigUI;                                   // 0x0180(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomAsrRackConfig>             AsrRackConfig;                                     // 0x0190(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A0[0x10];                                     // 0x01A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Hardware1;                                         // 0x01B0(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hardware2;                                         // 0x01C0(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hardware3;                                         // 0x01D0(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hardware4;                                         // 0x01E0(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EconomicTickMarginDistance;                        // 0x01F0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EconomicTickFrequency;                             // 0x01F8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CullingMarginDistance;                             // 0x0200(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HcaMxVoiceSamplingRate;                            // 0x0208(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumHcaMxMemoryVoices;                              // 0x0210(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HcaMxMemoryVoiceNumChannels;                       // 0x0218(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumHcaMxStreamingVoices;                           // 0x0220(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HcaMxStreamingVoiceNumChannels;                    // 0x0228(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          WASAPI_IsExclusive;                                // 0x0230(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WASAPI_BitsPerSample;                              // 0x0234(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_238[0x4];                                      // 0x0238(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WASAPI_SamplingRate;                               // 0x023C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_240[0x4];                                      // 0x0240(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WASAPI_NumChannels;                                // 0x0244(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_248[0x4];                                      // 0x0248(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_ServerThreadAffinityMask;                      // 0x024C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_250[0x4];                                      // 0x0250(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_OutputThreadAffinityMask;                      // 0x0254(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_258[0x4];                                      // 0x0258(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_ServerThreadPriority;                          // 0x025C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_260[0x4];                                      // 0x0260(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_OutputThreadPriority;                          // 0x0264(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_268[0x4];                                      // 0x0268(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          PS4_UseAudio3d;                                    // 0x026C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_NumberOfAudio3dMemoryVoices;                   // 0x0270(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_SamplingRateOfAudio3dMemoryVoices;             // 0x0278(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_NumberOfAudio3dStreamingVoices;                // 0x0280(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PS4_SamplingRateOfAudio3dStreamingVoices;          // 0x0288(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          UseUnrealSoundRenderer;                            // 0x0290(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_291[0x1];                                      // 0x0291(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          InitializeMana;                                    // 0x0292(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_293[0x1];                                      // 0x0293(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          EnableDecodeSkip;                                  // 0x0294(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxDecoderHandles;                                 // 0x0298(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxManaBPS;                                        // 0x02A0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxManaStreams;                                    // 0x02A8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          UseH264Decoder;                                    // 0x02B0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x1];                                      // 0x02B1(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          InitializeAdxLipSync;                              // 0x02B2(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B3[0x1];                                      // 0x02B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxNumAnalyzerHandles;                             // 0x02B4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B8[0x4];                                      // 0x02B8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseManaStartupMovies;                             // 0x02BC(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWaitForMoviesToComplete;                          // 0x02BD(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMoviesAreSkippable;                               // 0x02BE(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BF[0x1];                                      // 0x02BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         StartupMovies;                                     // 0x02C0(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D0[0x10];                                     // 0x02D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CriWarePluginSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CriWarePluginSettings")
	}
	static class UCriWarePluginSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriWarePluginSettings>();
	}
};
DUMPER7_ASSERTS_UCriWarePluginSettings;

// Class CriWareRuntime.ManaComponent
// 0x0190 (0x03C0 - 0x0230)
class UManaComponent final : public UActorComponent
{
public:
	class UManaTexture*                           Movie;                                             // 0x0230(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnEventPoint;                                      // 0x0238(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSubtitleChanged;                                 // 0x0248(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
