#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataSaveList

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function DataSaveList.DataSaveList_C.ExecuteUbergraph_DataSaveList
// 0x0004 (0x0004 - 0x0000)
struct DataSaveList_C_ExecuteUbergraph_DataSaveList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DataSaveList_C_ExecuteUbergraph_DataSaveList;

// Function DataSaveList.DataSaveList_C.Refresh
// 0x0198 (0x0198 - 0x0000)
struct DataSaveList_C_Refresh final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FPBSaveGameDataInfo                    Data;                                              // 0x0010(0x00A8)(Edit, BlueprintVisible)
	class USaveSlotItem_C*                        new_slot;                                          // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBSaveGameDataInfo                    CallFunc_GetSaveDataInfo_ReturnValue;              // 0x00C8(0x00A8)()
	class USaveSlotItem_C*                        CallFunc_GetSelectList_Output;                     // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlotItem_C*                        CallFunc_Create_ReturnValue;                       // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DataSaveList_C_Refresh;

// Function DataSaveList.DataSaveList_C.GetListIndex
// 0x0008 (0x0008 - 0x0000)
struct DataSaveList_C_GetListIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetListIndex_index;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DataSaveList_C_GetListIndex;

// Function DataSaveList.DataSaveList_C.GetSelectList
// 0x0010 (0x0010 - 0x0000)
struct DataSaveList_C_GetSelectList final
{
public:
	class USaveSlotItem_C*                        Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveSlotItem_C*                        CallFunc_GetSelectList_Output;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DataSaveList_C_GetSelectList;

// Function DataSaveList.DataSaveList_C.MoveCursor
// 0x0008 (0x0008 - 0x0000)
struct DataSaveList_C_MoveCursor final
{
public:
	int32                                         move_val;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Move;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DataSaveList_C_MoveCursor;

}

