#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataLoadList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIScroll_classes.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DataLoadList.DataLoadList_C
// 0x0048 (0x02F0 - 0x02A8)
class UDataLoadList_C final : public UUIScroll_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_DataLoadList_C;                     // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonListWindow_C*                    ListWindow;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class USaveSlotItem_C*>                ListSlots;                                         // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Index_0;                                           // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   EventEditNameDecide;                               // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventEditNameCancel;                               // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_DataLoadList(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void EditNAmeDecide();
	void EditNameCancel();
	void UpdateLast();
	void GetSaveslotName(class FString* STR);
	void UpdateHeaderText(class UCommonMenuHeader_C* ref_header);
	void Initialize();
	void Setup();
	void AddList(const class USaveSlotItem_C*& Input);
	void GetList(int32 Param_Index_0, class USaveSlotItem_C** Output);
	void GetSelectList(class USaveSlotItem_C** Output);
	void Clean();
	void Refresh();
	void MoveCursor(int32 MoveVal);
	void IsEmptyList(bool is_true, bool* is_enable);
	void IsEnableSlot(bool* isEnable);
	void SetSelectSlotControlGuide(class UCommonControllGuide_C*& ref_UIGuide);
	void SetSubModeControlGuide(class UCommonControllGuide_C* ref_UIGuide);
	void SetNewerData();
	void SetupSaveDataSlot(int32 Param_Index_0);
	void GetIndex(int32* OutIndex);
	void InitializeScrollAtIndex(int32 targetIndex);
	void SetIndex(int32 newIndex);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DataLoadList_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataLoadList_C")
	}
	static class UDataLoadList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataLoadList_C>();
	}
};
DUMPER7_ASSERTS_UDataLoadList_C;

}

