#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DialogueChr_Bathin

#include "Basic.hpp"

#include "DialogueCaptureCharacter_BP_classes.hpp"


namespace SDK
{

// DynamicClass DialogueChr_Bathin.DialogueChr_Bathin_C
// 0x0040 (0x34B0 - 0x3470)
class ADialogueChr_Bathin_C final : public ADialogueCaptureCharacter_BP_C
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh1;                                     // 0x3468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x3470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_GetEventFlag_IsDone;                      // 0x3478(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3479[0x3];                                     // 0x3479(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds_DialogueChr_Bathin_C;    // 0x347C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBEventListenerManager*                K2Node_Event_eventManager;                         // 0x3480(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   K2Node_Event_eventKey;                             // 0x3488(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   K2Node_Event_eventSubKey;                          // 0x3490(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                K2Node_Event_eventSender;                          // 0x3498(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x34A0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34A1[0xF];                                     // 0x34A1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnReceiveEvent(class APBEventListenerManager* bpp__eventManager__pf, class FName bpp__eventKey__pf, class FName bpp__eventSubKey__pf, class UObject* bpp__eventSender__pf);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DialogueChr_Bathin_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DialogueChr_Bathin_C")
	}
	static class ADialogueChr_Bathin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADialogueChr_Bathin_C>();
	}
};
DUMPER7_ASSERTS_ADialogueChr_Bathin_C;

}

