#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DummyStep

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "Step_Root_classes.hpp"


namespace SDK
{

// DynamicClass DummyStep.DummyStep_C
// 0x0028 (0x0BA0 - 0x0B78)
class UDummyStep_C final : public UStep_Root_C
{
public:
	bool                                          IsBodyHidingBoots;                                 // 0x0B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B79[0x3];                                      // 0x0B79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_NewEquipId;                           // 0x0B7C(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBEquipModelType                             K2Node_Event_Type;                                 // 0x0B84(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0B85(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B86[0x2];                                      // 0x0B86(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IIBodyEquipment_C>     K2Node_DynamicCast_AsIBody_Equipment;              // 0x0B88(0x0010)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0B98(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_GetCostumeInfo_IsHideBoots;               // 0x0B99(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9A[0x6];                                      // 0x0B9A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnShowEquip(class FName bpp__NewEquipId__pf, EPBEquipModelType bpp__Type__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DummyStep_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DummyStep_C")
	}
	static class UDummyStep_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDummyStep_C>();
	}
};
DUMPER7_ASSERTS_UDummyStep_C;

}

