#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EffChoiceBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function EffChoiceBP.EffChoiceBP_C.ExecuteUbergraph_EffChoiceBP
// 0x0004 (0x0004 - 0x0000)
struct EffChoiceBP_C_ExecuteUbergraph_EffChoiceBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffChoiceBP_C_ExecuteUbergraph_EffChoiceBP;

// Function EffChoiceBP.EffChoiceBP_C.PlayBlink
// 0x0010 (0x0010 - 0x0000)
struct EffChoiceBP_C_PlayBlink final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffChoiceBP_C_PlayBlink;

// Function EffChoiceBP.EffChoiceBP_C.StopBlink
// 0x0020 (0x0020 - 0x0000)
struct EffChoiceBP_C_StopBlink final
{
public:
	float                                         Start_0;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EffChoiceBP_C_StopBlink;

}

