#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntryNameSetter

#include "Basic.hpp"

#include "PopupParam_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function EntryNameSetter.EntryNameSetter_C.ExecuteUbergraph_EntryNameSetter
// 0x0100 (0x0100 - 0x0000)
struct EntryNameSetter_C_ExecuteUbergraph_EntryNameSetter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonYesNoPopup_C*                    CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UPBGameInstance*                        CallFunc_GetPBGameInstancePure_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCheatCodeBase*                       CallFunc_GetCheatCodeBase_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue1;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> K2Node_Event_OnStepChanged; // 0x0098(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_ZOrder;                               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00B0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
};
DUMPER7_ASSERTS_EntryNameSetter_C_ExecuteUbergraph_EntryNameSetter;

// Function EntryNameSetter.EntryNameSetter_C.Tick
// 0x003C (0x003C - 0x0000)
struct EntryNameSetter_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EntryNameSetter_C_Tick;

// Function EntryNameSetter.EntryNameSetter_C.Start
// 0x0014 (0x0014 - 0x0000)
struct EntryNameSetter_C_Start final
{
public:
	TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)> OnStepChanged; // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	int32                                         ZOrder;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EntryNameSetter_C_Start;

// Function EntryNameSetter.EntryNameSetter_C.UpdateNameText
// 0x0030 (0x0030 - 0x0000)
struct EntryNameSetter_C_UpdateNameText final
{
public:
	class FText                                   text;                                              // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetInputText_Text;                        // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_EntryNameSetter_C_UpdateNameText;

// Function EntryNameSetter.EntryNameSetter_C.StartMenu
// 0x0008 (0x0008 - 0x0000)
struct EntryNameSetter_C_StartMenu final
{
public:
	class UCommonControllGuide_C*                 ref_guide;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EntryNameSetter_C_StartMenu;

// Function EntryNameSetter.EntryNameSetter_C.SetPlayerName
// 0x0060 (0x0060 - 0x0000)
struct EntryNameSetter_C_SetPlayerName final
{
public:
	class FText                                   text;                                              // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FString                                 Name_0;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetInputText_Text;                        // 0x0040(0x0018)()
	bool                                          CallFunc_SetPlayerName_ReturnValue;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_EntryNameSetter_C_SetPlayerName;

// Function EntryNameSetter.EntryNameSetter_C.ResetPlayerName
// 0x0030 (0x0030 - 0x0000)
struct EntryNameSetter_C_ResetPlayerName final
{
public:
	class UCommonTextBox_C*                       NewLocalVar_0;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   text;                                              // 0x0008(0x0018)(Edit, BlueprintVisible)
	class FString                                 Name_0;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_EntryNameSetter_C_ResetPlayerName;

// Function EntryNameSetter.EntryNameSetter_C.OnInvalid
// 0x0002 (0x0002 - 0x0000)
struct EntryNameSetter_C_OnInvalid final
{
public:
	bool                                          CallFunc_IsSelectDecide_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectCancel_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_EntryNameSetter_C_OnInvalid;

// Function EntryNameSetter.EntryNameSetter_C.OnActive
// 0x0002 (0x0002 - 0x0000)
struct EntryNameSetter_C_OnActive final
{
public:
	bool                                          CallFunc_IsSelectDecide_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectCancel_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_EntryNameSetter_C_OnActive;

// Function EntryNameSetter.EntryNameSetter_C.OnConfirm
// 0x0008 (0x0008 - 0x0000)
struct EntryNameSetter_C_OnConfirm final
{
public:
	int32                                         CallFunc_GetPopupReturn_Return;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_EntryNameSetter_C_OnConfirm;

// Function EntryNameSetter.EntryNameSetter_C.Activate
// 0x0030 (0x0030 - 0x0000)
struct EntryNameSetter_C_Activate final
{
public:
	class FText                                   txt;                                               // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetCommitedText_output;                   // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_EntryNameSetter_C_Activate;

// Function EntryNameSetter.EntryNameSetter_C.OpenEntryNameConfirm
// 0x00F8 (0x00F8 - 0x0000)
struct EntryNameSetter_C_OpenEntryNameConfirm final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   txt;                                               // 0x0018(0x0018)(Edit, BlueprintVisible)
	struct FPopupParam                            K2Node_MakeStruct_PopupParam;                      // 0x0030(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_GetInputText_Text;                        // 0x00C8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
};
DUMPER7_ASSERTS_EntryNameSetter_C_OpenEntryNameConfirm;

// Function EntryNameSetter.EntryNameSetter_C.IsInputtingName
// 0x0002 (0x0002 - 0x0000)
struct EntryNameSetter_C_IsInputtingName final
{
public:
	bool                                          IsInputtingName_0;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_EntryNameSetter_C_IsInputtingName;

}

