#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQBP_Root

#include "Basic.hpp"

#include "EPB_WaterStaus_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// DynamicClass EQBP_Root.EQBP_Root_C
// 0x0110 (0x05E8 - 0x04D8)
class AEQBP_Root_C final : public APBEquipModelActor
{
public:
	uint8                                         Pad_4D8[0x8];                                      // 0x04D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UComp_SpawnAsset_C*                     Com_SpawnAsset;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*               Trail;                                             // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBEffectControlComponent*              PBEffectControl;                                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBEffectControlComponent*              EffectCon;                                         // 0x04F8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APB_Chr_Root_C*                         PlayerIns;                                         // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDisp;                                            // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBParticle*                            EffectIns;                                         // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APBParticle*>                    Effects;                                           // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UStep_Root_C*                           StepIns;                                           // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalTime;                                         // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalFrame;                                        // 0x0534(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstanceDynamic*>       Materials;                                         // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class APBParticle*>                    EffectInnerBuffer;                                 // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          IsLoopAttack;                                      // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBulletActor*                         AdditionalDamageIns;                               // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_Event_EquipmentOwner;                       // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0570(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APB_Chr_Root_C*                         K2Node_DynamicCast_AsPB_Chr_Root;                  // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0580(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_581[0x3];                                      // 0x0581(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0584(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStep_Root_C*                           K2Node_DynamicCast_AsStep_Root;                    // 0x0588(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0590(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_591[0x3];                                      // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0594(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0598(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x059C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x05A0(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_UpdateProcess_Return;                     // 0x05A4(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A5[0x3];                                      // 0x05A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetComponentsByClass_ReturnValue;         // 0x05A8(0x0010)(ExportObject, ZeroConstructor, Transient, DuplicateTransient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x05B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x05C0(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     CallFunc_Array_Get_Item1;                          // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x05D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x05E0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_InitializeProcess_Return;                 // 0x05E1(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x05E2(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_DeleteAllEffect_Return;                   // 0x05E3(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_IsCurrentWeapon_Yes;                      // 0x05E4(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_IsCurrentWeapon_Yes1;                     // 0x05E5(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E6[0x2];                                      // 0x05E6(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateTrail(bool bpp__Active__pf, class FName bpp__Sock1__pf, class FName bpp__Sock2__pf, const struct FVector& bpp__ColorVector__pf, float bpp__OpacityScale__pf, bool* bpp__return__pf);
	void AddEffect(class APBParticle* bpp__Effect__pf, bool* bpp__return__pf);
	void Callback_AttackTiming(bool bpp__IsStart__pf, bool bpp__IsFinish__pf, bool* bpp__return__pf);
	void ChangeActive(bool bpp__IsActive__pf);
	void DeleteAllEffect(bool* bpp__return__pf);
	void DeleteEffect(class APBParticle* bpp__EffectIns__pf);
	void DispOFF();
	void DispON();
	void EquipInfo_AttackTiming(bool bpp__IsStart__pf, bool bpp__IsFinish__pf, bool* bpp__return__pf);
	void EquipInfo_ChangeWeaponTiming(bool* bpp__return__pf);
	void EquipInfo_DealDamageEvent(class FName bpp__DamageID__pf, bool bpp__IsHit__pf, EPBBloodColor bpp__BloodColor__pf, float bpp__DamageValue__pf, class APBBaseCharacter* bpp__ChrIns__pf, const struct FVector& bpp__HitWorldLocation__pf, bool bpp__IsCritical__pf, bool bpp__IsBullet__pf, class FName bpp__DealDamageBone__pf, EAttackAttribute bpp__EffectiveAttribute__pf, class UPBCollisionObject* bpp__AttackCollision__pf, bool* bpp__return__pf);
	void EquipInfo_EnterAttackProcess(EPBStep bpp__Step__pf, bool* bpp__return__pf);
	void EquipInfo_ExecCommand(class FName bpp__Command__pf, float bpp__FloatValue__pf, bool* bpp__return__pf);
	void EquipInfo_ExitAttackProcess(EPBStep bpp__Step__pf, bool* bpp__return__pf);
	void EquipInfo_SetVectorParameter(class FName bpp__Command__pf, const struct FVector& bpp__Value__pf, bool* bpp__return__pf);
	void EquipInfo_SpawnBullet(class FName bpp__BulletID__pf, class FName bpp__SocketName__pf, EBulletDirection bpp__BulletDirection__pf, ECarriedCatalog bpp__SpawnType__pf, bool* bpp__return__pf);
	void EquipInfo_WaterProcess(EPB_WaterStaus bpp__Type__pf, bool* bpp__return__pf);
	void EquipInfo_WeaponDisp(bool bpp__IsDisp__pf, bool* bpp__return__pf);
	void GetMesh(class USkeletalMeshComponent** bpp__SkeletalMeshComponent__pf);
	void GetStepIns(class UStep_Root_C** bpp__StepIns__pf);
	void InitializeProcess(bool* bpp__return__pf);
	void IsCurrentWeapon(bool* bpp__Yes__pf);
	void OnEquipped(class APBBaseCharacter* bpp__EquipmentOwner__pf);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason bpp__EndPlayReason__pf);
	void ReceiveTick(float bpp__DeltaSeconds__pf);
	void SetDissolveMaterial(const struct FVector& bpp__StartWorldLocation__pf, const struct FVector& bpp__EndWorldLocation__pf, const struct FVector& bpp__ColorParameter__pf, float bpp__LightRange__pf, float bpp__TriggerValue__pf, bool* bpp__return__pf);
	void SetEmissiveMaterial(const struct FVector& bpp__Color__pf, float bpp__Contrast__pf, float bpp__Min__pf, float bpp__Max__pf, bool* bpp__return__pf);
	void SetScalarMaterial(class FName bpp__Parameter__pf, float bpp__Value__pf, bool* bpp__return__pf);
	void SetVectorMaterial(class FName bpp__Parameter__pf, const struct FVector& bpp__Value__pf, bool* bpp__return__pf);
	void Spawner_Effect(class FName bpp__EffectID__pf, const struct FVector& bpp__WorldLocation__pf, float bpp__Scale__pf, float bpp__TimeDilation__pf, const struct FVector& bpp__RotationWorldVector__pf, bool* bpp__IsSpawn__pf, class APBParticle** bpp__EffectInstance__pf);
	void Spawner_Initialize(class APB_Chr_Root_C* bpp__ChrRootInstance__pf, bool* bpp__return__pf);
	void Spawner_SpawnBullet(class FName bpp__BulletID__pf, const struct FVector& bpp__SpawnWorldLocation__pf, EBulletDirection bpp__DirectionType__pf, bool bpp__IsOverRoom__pf, bool* bpp__IsSpawn__pf, class APBBulletActor** bpp__BulletInstance__pf);
	void Spawner_SpawnBulletEx(class FName bpp__BulletID__pf, const struct FPBBulletParameter& bpp__BulletParameter__pf, const struct FPBBallisticParameter& bpp__BallisticParameter__pf, const struct FVector& bpp__SpawnWorldLocation__pf, EBulletDirection bpp__DirectionType__pf, bool bpp__IsOverRoom__pf, bool* bpp__IsSpawn__pf, class APBBulletActor** bpp__BulletInstance__pf);
	void SpwanEffect(class FName bpp__EffectMasterId__pf, class FName bpp__Socket__pf, float bpp__Scale__pf, int32 bpp__ManId__pf, bool bpp__IsAttach__pf, class APBParticle** bpp__EffectIns__pf);
	void UpdateProcess(bool* bpp__return__pf);
	void UserConstructionScript();
	void WeaponCommand(class FName bpp__Command__pf);
	void WeaponEquip(bool bpp__IsActive__pf);
	void WeaponUnequip(bool bpp__IsActive__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EQBP_Root_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EQBP_Root_C")
	}
	static class AEQBP_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEQBP_Root_C>();
	}
};
DUMPER7_ASSERTS_AEQBP_Root_C;

}

