#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipMenuWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EquipMenuWindow.EquipMenuWindow_C
// 0x0020 (0x0298 - 0x0278)
class UEquipMenuWindow_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEquipArmsTab_C*                        EquipArmsTab;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonMenuListWindow_C*                ListWindow;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         tabIndex;                                          // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEmptyList;                                       // 0x0294(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_EquipMenuWindow(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void Initialize();
	void Setup();
	void Refresh();
	void MoveScroll(int32 MoveVal);
	void SwitchTab(int32 Index_0);
	void GetSelectEquip(class UItemListItem_C** ret);
	struct FPBItemCatalogData ChangeEquipment();
	void PlayTabSelectButton(int32 MoveVal);
	void SetSelectSortKey(const struct FPBInventorySortData& Input);
	void GetSelectSortKey(struct FPBInventorySortData* Output);
	void SetSelectSortList(TArray<EInventorySort>* SortList);
	void IsCursorUp(bool* isEnable);
	void IsCursorDown(bool* isEnable);
	void IsPageUp(bool* isEnable);
	void IsPageDown(bool* isEnable);
	void IsSelectSort(bool* isEnable);
	void IsEmpty(bool IsTrue, bool* isEnable);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EquipMenuWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EquipMenuWindow_C")
	}
	static class UEquipMenuWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquipMenuWindow_C>();
	}
};
DUMPER7_ASSERTS_UEquipMenuWindow_C;

}

