#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipSetWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EquipSetWindow.EquipSetWindow_C
// 0x0068 (0x02C0 - 0x0258)
class UEquipSetWindow_C : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEquipSet_C*                            SetAccessory01;                                    // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipSet_C*                            SetAccessory02;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipSet_C*                            SetBack;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipSet_C*                            SetBody;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipSet_C*                            SetBullet;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipSet_C*                            SetHead;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipSet_C*                            SetWeapon;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UEquipSet_C*>                    Equipments;                                        // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Top;                                               // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LAST;                                              // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewVar_0;                                          // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EquipSetWindow(int32 EntryPoint);
	void Construct();
	void UpdateEquipment(int32 Param_Index_0, const struct FPBItemCatalogData& Item);
	bool IsOverlapAccessory();
	void GetOverlappedAccessory(class FName In, class FName* Out);
	void GetEquipSlot(int32 Param_Index_0, class UEquipSet_C** Output);
	void GetSelectEquipSlot(class UEquipSet_C** Output);
	void SwitchEquipSlot(int32 Param_Index_0);
	void SetEquipmentCursor(int32 Param_Index_0, ESlateVisibility InVisibility);
	void Initialize();
	void Setup();
	void Refresh();
	void 新規関数_0(const struct FPBItemCatalogData& Input);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EquipSetWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EquipSetWindow_C")
	}
	static class UEquipSetWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquipSetWindow_C>();
	}
};
DUMPER7_ASSERTS_UEquipSetWindow_C;

}

