#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameOver

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GameOver.GameOver_C
// 0x0038 (0x0290 - 0x0258)
class UGameOver_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 GameOverBG;                                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameOverText;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBMIDFader_C*                          BGFader;                                           // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBMIDFader_C*                          TextFader;                                         // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnAnyKeyDownDelegate;                              // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_GameOver(int32 EntryPoint);
	void Destruct();
	void OnKeyDownEvent();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void OnDispGameOver();
	void OnBlack();
	void SetPanelAlpha(float alpha, class UCanvasPanel* Panel);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GameOver_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameOver_C")
	}
	static class UGameOver_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameOver_C>();
	}
};
DUMPER7_ASSERTS_UGameOver_C;

}

