#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamePadsMenu

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function GamePadsMenu.GamePadsMenu_C.ExecuteUbergraph_GamePadsMenu
// 0x0004 (0x0004 - 0x0000)
struct GamePadsMenu_C_ExecuteUbergraph_GamePadsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamePadsMenu_C_ExecuteUbergraph_GamePadsMenu;

// Function GamePadsMenu.GamePadsMenu_C.Initialize
// 0x0001 (0x0001 - 0x0000)
struct GamePadsMenu_C_Initialize final
{
public:
	EPBHardwareType                               CallFunc_GetHardwareType_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamePadsMenu_C_Initialize;

// Function GamePadsMenu.GamePadsMenu_C.Setup
// 0x0001 (0x0001 - 0x0000)
struct GamePadsMenu_C_Setup final
{
public:
	EPBGamePadKey                                 NewLocalVar_0;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamePadsMenu_C_Setup;

// Function GamePadsMenu.GamePadsMenu_C.UpdateMenu
// 0x0028 (0x0028 - 0x0000)
struct GamePadsMenu_C_UpdateMenu final
{
public:
	TArray<EPBGamePadKey>                         NewLocalVar_1;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<EPBGamePadKey>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetControlerIndex_Value;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GamePadsMenu_C_UpdateMenu;

// Function GamePadsMenu.GamePadsMenu_C.SetupControler
// 0x000C (0x000C - 0x0000)
struct GamePadsMenu_C_SetupControler final
{
public:
	EPBHardwareType                               Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         idx;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetControlerIndex_Value;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamePadsMenu_C_SetupControler;

// Function GamePadsMenu.GamePadsMenu_C.GetControlerIndex
// 0x0048 (0x0048 - 0x0000)
struct GamePadsMenu_C_GetControlerIndex final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable5;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable6;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable7;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable8;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetPlatformAttachedDevice_ReturnValue;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GamePadsMenu_C_GetControlerIndex;

// Function GamePadsMenu.GamePadsMenu_C.SetupPlatformDisclaimer
// 0x0028 (0x0028 - 0x0000)
struct GamePadsMenu_C_SetupPlatformDisclaimer final
{
public:
	bool                                          CallFunc_IsHardwarePresent_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FindTextInLocalizationTable_OutText;      // 0x0008(0x0018)()
	bool                                          CallFunc_FindTextInLocalizationTable_ReturnValue;  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GamePadsMenu_C_SetupPlatformDisclaimer;

// Function GamePadsMenu.GamePadsMenu_C.GetSubMenuIndex
// 0x0008 (0x0008 - 0x0000)
struct GamePadsMenu_C_GetSubMenuIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBGameModeType                               CallFunc_GetGameModeType_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GamePadsMenu_C_GetSubMenuIndex;

// Function GamePadsMenu.GamePadsMenu_C.SetupSubMenu
// 0x0004 (0x0004 - 0x0000)
struct GamePadsMenu_C_SetupSubMenu final
{
public:
	int32                                         CallFunc_GetSubMenuIndex_Index;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamePadsMenu_C_SetupSubMenu;

}

