#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadSet

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function GamepadSet.GamepadSet_C.ExecuteUbergraph_GamepadSet
// 0x0008 (0x0008 - 0x0000)
struct GamepadSet_C_ExecuteUbergraph_GamepadSet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GamepadSet_C_ExecuteUbergraph_GamepadSet;

// Function GamepadSet.GamepadSet_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct GamepadSet_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GamepadSet_C_PreConstruct;

// Function GamepadSet.GamepadSet_C.SetContentText
// 0x0018 (0x0018 - 0x0000)
struct GamepadSet_C_SetContentText final
{
public:
	class FText                                   Input;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_GamepadSet_C_SetContentText;

// Function GamepadSet.GamepadSet_C.SetContentColor
// 0x00A8 (0x00A8 - 0x0000)
struct GamepadSet_C_SetContentColor final
{
public:
	struct FSlateColor                            ChangeColor;                                       // 0x0000(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            DefColor;                                          // 0x0028(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            SetColor;                                          // 0x0050(0x0028)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0080(0x0028)()
};
DUMPER7_ASSERTS_GamepadSet_C_SetContentColor;

// Function GamepadSet.GamepadSet_C.SetKeyIcon
// 0x00C8 (0x00C8 - 0x0000)
struct GamepadSet_C_SetKeyIcon final
{
public:
	TMap<EPBGameKey, class FString>               Key_0;                                             // 0x0000(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	EPBGamePadKey                                 Key;                                               // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPBGameKey, class FString>               K2Node_MakeVariable_MakeVariableOutput;            // 0x0058(0x0050)(ZeroConstructor)
	EPBGamePadKey                                 CallFunc_GetBinded_BindedButton;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetBinded_Bindedkey;                      // 0x00B0(0x0018)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamepadSet_C_SetKeyIcon;

// Function GamepadSet.GamepadSet_C.SetChanged
// 0x0040 (0x0040 - 0x0000)
struct GamepadSet_C_SetChanged final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	EPBGamePadKey                                 Pad;                                               // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Input;                                             // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBGamePadKey                                 CallFunc_GetBinded_BindedButton;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetBinded_Bindedkey;                      // 0x0020(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GamepadSet_C_SetChanged;

// Function GamepadSet.GamepadSet_C.SetListCursor
// 0x0064 (0x0064 - 0x0000)
struct GamepadSet_C_SetListCursor final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Visible;                                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable1;                             // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable2;                             // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable3;                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable4;                             // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamepadSet_C_SetListCursor;

// Function GamepadSet.GamepadSet_C.SwitchMode
// 0x0001 (0x0001 - 0x0000)
struct GamepadSet_C_SwitchMode final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GamepadSet_C_SwitchMode;

// Function GamepadSet.GamepadSet_C.IsActivated
// 0x0001 (0x0001 - 0x0000)
struct GamepadSet_C_IsActivated final
{
public:
	bool                                          IsActivate_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GamepadSet_C_IsActivated;

// Function GamepadSet.GamepadSet_C.SetBindedPad
// 0x0004 (0x0004 - 0x0000)
struct GamepadSet_C_SetBindedPad final
{
public:
	EPBGamePadKey                                 Input;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          didSucceed;                                        // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBGamePadKey                                 gamepadButton;                                     // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BindToGamepad_ReturnValue;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GamepadSet_C_SetBindedPad;

// Function GamepadSet.GamepadSet_C.GetBinded
// 0x0040 (0x0040 - 0x0000)
struct GamepadSet_C_GetBinded final
{
public:
	EPBGamePadKey                                 BindedButton;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Bindedkey;                                         // 0x0008(0x0018)(Parm, OutParm, HasGetValueTypeHash)
	EPBGameKey                                    CallFunc_GetActionMappingFromMenuKeybindType_BindedAction; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBGamePadKey                                 CallFunc_GetActionMappingFromMenuKeybindType_BindedButton; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetActionMappingFromMenuKeybindType_BindedKey; // 0x0028(0x0018)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamepadSet_C_GetBinded;

// Function GamepadSet.GamepadSet_C.Setup
// 0x0001 (0x0001 - 0x0000)
struct GamepadSet_C_Setup final
{
public:
	EPBGameKey                                    CallFunc_GetGameKeyFromMenuKeybindType_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamepadSet_C_Setup;

// Function GamepadSet.GamepadSet_C.RevertBindingsToInitialValues
// 0x0030 (0x0030 - 0x0000)
struct GamepadSet_C_RevertBindingsToInitialValues final
{
public:
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamepadSet_C_RevertBindingsToInitialValues;

// Function GamepadSet.GamepadSet_C.SetInitialKeys
// 0x0020 (0x0020 - 0x0000)
struct GamepadSet_C_SetInitialKeys final
{
public:
	EPBGamePadKey                                 CallFunc_GetBinded_BindedButton;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetBinded_Bindedkey;                      // 0x0008(0x0018)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamepadSet_C_SetInitialKeys;

// Function GamepadSet.GamepadSet_C.IsChanged
// 0x0001 (0x0001 - 0x0000)
struct GamepadSet_C_IsChanged final
{
public:
	bool                                          IsChanged_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GamepadSet_C_IsChanged;

// Function GamepadSet.GamepadSet_C.SetBindedKey
// 0x0050 (0x0050 - 0x0000)
struct GamepadSet_C_SetBindedKey final
{
public:
	struct FKey                                   Input;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          didSucceed;                                        // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   KeyboardKey;                                       // 0x0020(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FKey>                           NewLocalVar_1;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          CallFunc_BindToKeyboard_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GamepadSet_C_SetBindedKey;

// Function GamepadSet.GamepadSet_C.GetHelpText
// 0x0018 (0x0018 - 0x0000)
struct GamepadSet_C_GetHelpText final
{
public:
	class FText                                   helpText_0;                                        // 0x0000(0x0018)(Parm, OutParm)
};
DUMPER7_ASSERTS_GamepadSet_C_GetHelpText;

}

