#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: gauge_HPMAX_ANM

#include "Basic.hpp"


namespace SDK::Params
{

// Function gauge_HPMAX_ANM.gauge_HPMAX_Anm_C.ExecuteUbergraph_gauge_HPMAX_Anm
// 0x0018 (0x0018 - 0x0000)
struct gauge_HPMAX_Anm_C_ExecuteUbergraph_gauge_HPMAX_Anm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_gauge_HPMAX_Anm_C_ExecuteUbergraph_gauge_HPMAX_Anm;

// Function gauge_HPMAX_ANM.gauge_HPMAX_Anm_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct gauge_HPMAX_Anm_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_gauge_HPMAX_Anm_C_PreConstruct;

// Function gauge_HPMAX_ANM.gauge_HPMAX_Anm_C.PlayAnime
// 0x0008 (0x0008 - 0x0000)
struct gauge_HPMAX_Anm_C_PlayAnime final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_gauge_HPMAX_Anm_C_PlayAnime;

}

