#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GaugeShadow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GaugeShadow.GaugeShadow_C
// 0x0028 (0x0280 - 0x0258)
class UGaugeShadow_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ShadowFrame;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ShadowHP;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             ShadowTexture;                                     // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBGameModePlayer                             PlayerChara;                                       // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GaugeShadow(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void SetFrameShadow(class UTexture2D* input_texture);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GaugeShadow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GaugeShadow_C")
	}
	static class UGaugeShadow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGaugeShadow_C>();
	}
};
DUMPER7_ASSERTS_UGaugeShadow_C;

}

