#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IAcceptableAnimationBluePrint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function IAcceptableAnimationBluePrint.IAcceptableAnimationBluePrint_C.AnimIns_ExecCommand
// 0x0014 (0x0014 - 0x0000)
struct IAcceptableAnimationBluePrint_C_AnimIns_ExecCommand final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Value__pf;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableAnimationBluePrint_C_AnimIns_ExecCommand;

// Function IAcceptableAnimationBluePrint.IAcceptableAnimationBluePrint_C.AnimIns_SetBoolValue
// 0x0008 (0x0008 - 0x0000)
struct IAcceptableAnimationBluePrint_C_AnimIns_SetBoolValue final
{
public:
	int32                                         bpp__Index__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__BoolValue__pf;                                // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableAnimationBluePrint_C_AnimIns_SetBoolValue;

// Function IAcceptableAnimationBluePrint.IAcceptableAnimationBluePrint_C.AnimIns_SetFloatArrayValue
// 0x000C (0x000C - 0x0000)
struct IAcceptableAnimationBluePrint_C_AnimIns_SetFloatArrayValue final
{
public:
	int32                                         bpp__Target__pf;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Value__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableAnimationBluePrint_C_AnimIns_SetFloatArrayValue;

// Function IAcceptableAnimationBluePrint.IAcceptableAnimationBluePrint_C.AnimIns_SetVectorValue
// 0x0014 (0x0014 - 0x0000)
struct IAcceptableAnimationBluePrint_C_AnimIns_SetVectorValue final
{
public:
	int32                                         bpp__Index__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Vectorvalue__pf;                              // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableAnimationBluePrint_C_AnimIns_SetVectorValue;

}

