#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IAcceptableEquipControler

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EPB_WaterStaus_structs.hpp"


namespace SDK::Params
{

// Function IAcceptableEquipControler.IAcceptableEquipControler_C.EquipInfo_AttackTiming
// 0x0003 (0x0003 - 0x0000)
struct IAcceptableEquipControler_C_EquipInfo_AttackTiming final
{
public:
	bool                                          bpp__IsStart__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFinish__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAcceptableEquipControler_C_EquipInfo_AttackTiming;

// Function IAcceptableEquipControler.IAcceptableEquipControler_C.EquipInfo_ChangeWeaponTiming
// 0x0001 (0x0001 - 0x0000)
struct IAcceptableEquipControler_C_EquipInfo_ChangeWeaponTiming final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAcceptableEquipControler_C_EquipInfo_ChangeWeaponTiming;

// Function IAcceptableEquipControler.IAcceptableEquipControler_C.EquipInfo_DealDamageEvent
// 0x0048 (0x0048 - 0x0000)
struct IAcceptableEquipControler_C_EquipInfo_DealDamageEvent final
{
public:
	class FName                                   bpp__DamageID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsHit__pf;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBBloodColor                                 bpp__BloodColor__pf;                               // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__DamageValue__pf;                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       bpp__ChrIns__pf;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__HitWorldLocation__pf;                         // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsCritical__pf;                               // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsBullet__pf;                                 // 0x0025(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__DealDamageBone__pf;                           // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttackAttribute                              bpp__EffectiveAttribute__pf;                       // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCollisionObject*                     bpp__AttackCollision__pf;                          // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableEquipControler_C_EquipInfo_DealDamageEvent;

// Function IAcceptableEquipControler.IAcceptableEquipControler_C.EquipInfo_EnterAttackProcess
// 0x0002 (0x0002 - 0x0000)
struct IAcceptableEquipControler_C_EquipInfo_EnterAttackProcess final
{
public:
	EPBStep                                       bpp__Step__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAcceptableEquipControler_C_EquipInfo_EnterAttackProcess;

// Function IAcceptableEquipControler.IAcceptableEquipControler_C.EquipInfo_ExecCommand
// 0x0010 (0x0010 - 0x0000)
struct IAcceptableEquipControler_C_EquipInfo_ExecCommand final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__FloatValue__pf;                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableEquipControler_C_EquipInfo_ExecCommand;

// Function IAcceptableEquipControler.IAcceptableEquipControler_C.EquipInfo_ExitAttackProcess
// 0x0002 (0x0002 - 0x0000)
struct IAcceptableEquipControler_C_EquipInfo_ExitAttackProcess final
{
public:
	EPBStep                                       bpp__Step__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAcceptableEquipControler_C_EquipInfo_ExitAttackProcess;

// Function IAcceptableEquipControler.IAcceptableEquipControler_C.EquipInfo_SetVectorParameter
// 0x0018 (0x0018 - 0x0000)
struct IAcceptableEquipControler_C_EquipInfo_SetVectorParameter final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Value__pf;                                    // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableEquipControler_C_EquipInfo_SetVectorParameter;

// Function IAcceptableEquipControler.IAcceptableEquipControler_C.EquipInfo_SpawnBullet
// 0x0014 (0x0014 - 0x0000)
struct IAcceptableEquipControler_C_EquipInfo_SpawnBullet final
{
public:
	class FName                                   bpp__BulletID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__SocketName__pf;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBulletDirection                              bpp__BulletDirection__pf;                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               bpp__SpawnType__pf;                                // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0012(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableEquipControler_C_EquipInfo_SpawnBullet;

// Function IAcceptableEquipControler.IAcceptableEquipControler_C.EquipInfo_WaterProcess
// 0x0002 (0x0002 - 0x0000)
struct IAcceptableEquipControler_C_EquipInfo_WaterProcess final
{
public:
	EPB_WaterStaus                                bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAcceptableEquipControler_C_EquipInfo_WaterProcess;

// Function IAcceptableEquipControler.IAcceptableEquipControler_C.EquipInfo_WeaponDisp
// 0x0002 (0x0002 - 0x0000)
struct IAcceptableEquipControler_C_EquipInfo_WeaponDisp final
{
public:
	bool                                          bpp__IsDisp__pf;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAcceptableEquipControler_C_EquipInfo_WeaponDisp;

// Function IAcceptableEquipControler.IAcceptableEquipControler_C.Spawner_Effect
// 0x0038 (0x0038 - 0x0000)
struct IAcceptableEquipControler_C_Spawner_Effect final
{
public:
	class FName                                   bpp__EffectID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Scale__pf;                                    // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__TimeDilation__pf;                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__RotationWorldVector__pf;                      // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSpawn__pf;                                  // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBParticle*                            bpp__EffectInstance__pf;                           // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAcceptableEquipControler_C_Spawner_Effect;

// Function IAcceptableEquipControler.IAcceptableEquipControler_C.Spawner_Initialize
// 0x0010 (0x0010 - 0x0000)
struct IAcceptableEquipControler_C_Spawner_Initialize final
{
public:
	class APB_Chr_Root_C*                         bpp__ChrRootInstance__pf;                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IAcceptableEquipControler_C_Spawner_Initialize;

// Function IAcceptableEquipControler.IAcceptableEquipControler_C.Spawner_SpawnBullet
// 0x0020 (0x0020 - 0x0000)
struct IAcceptableEquipControler_C_Spawner_SpawnBullet final
{
public:
	class FName                                   bpp__BulletID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SpawnWorldLocation__pf;                       // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBulletDirection                              bpp__DirectionType__pf;                            // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsOverRoom__pf;                               // 0x0015(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSpawn__pf;                                  // 0x0016(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBulletActor*                         bpp__BulletInstance__pf;                           // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAcceptableEquipControler_C_Spawner_SpawnBullet;

// Function IAcceptableEquipControler.IAcceptableEquipControler_C.Spawner_SpawnBulletEx
// 0x0340 (0x0340 - 0x0000)
struct IAcceptableEquipControler_C_Spawner_SpawnBulletEx final
{
public:
	class FName                                   bpp__BulletID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBBulletParameter                     bpp__BulletParameter__pf;                          // 0x0008(0x01E0)(Parm, NativeAccessSpecifierPublic)
	struct FPBBallisticParameter                  bpp__BallisticParameter__pf;                       // 0x01E8(0x0140)(Parm, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SpawnWorldLocation__pf;                       // 0x0328(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBulletDirection                              bpp__DirectionType__pf;                            // 0x0334(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsOverRoom__pf;                               // 0x0335(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSpawn__pf;                                  // 0x0336(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_337[0x1];                                      // 0x0337(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBulletActor*                         bpp__BulletInstance__pf;                           // 0x0338(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IAcceptableEquipControler_C_Spawner_SpawnBulletEx;

}

