#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IEnableItemManage

#include "Basic.hpp"


namespace SDK::Params
{

// Function IEnableItemManage.IEnableItemManage_C.HasItem
// 0x000C (0x000C - 0x0000)
struct IEnableItemManage_C_HasItem final
{
public:
	class FName                                   bpp__ItemId__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Has__pf;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_IEnableItemManage_C_HasItem;

// Function IEnableItemManage.IEnableItemManage_C.SetTarilVisible
// 0x0002 (0x0002 - 0x0000)
struct IEnableItemManage_C_SetTarilVisible final
{
public:
	bool                                          bpp__Visible__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IEnableItemManage_C_SetTarilVisible;

// Function IEnableItemManage.IEnableItemManage_C.TransToIdle
// 0x0001 (0x0001 - 0x0000)
struct IEnableItemManage_C_TransToIdle final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_IEnableItemManage_C_TransToIdle;

}

