#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InfomationStatus

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InfomationStatus.InfomationStatus_C
// 0x00A0 (0x02F8 - 0x0258)
class UInfomationStatus_C final : public UPBUserWidget
{
public:
	class UWrapBox*                               Attrivute;                                         // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextPanel_C*                     Param;                                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Slash;                                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPBItemCatalogData                     itemData;                                          // 0x0270(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<int32>                                 Status;                                            // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void SetItemData(const struct FPBItemCatalogData& input_data);
	void UpdateParam();
	void UpdateAttrivute();
	void GetStatusValue(EAttackAttribute Attrivute_0, int32* Output);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("InfomationStatus_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InfomationStatus_C")
	}
	static class UInfomationStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInfomationStatus_C>();
	}
};
DUMPER7_ASSERTS_UInfomationStatus_C;

}

