#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Int_AnimationNotifyCommon

#include "Basic.hpp"

#include "EPB_StartLoopEnd_structs.hpp"


namespace SDK::Params
{

// Function Int_AnimationNotifyCommon.Int_AnimationNotifyCommon_C.ExecAnimationCommand
// 0x0018 (0x0018 - 0x0000)
struct Int_AnimationNotifyCommon_C_ExecAnimationCommand final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Value__pf;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__FloatValue__pf;                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Ret__pf;                                      // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Int_AnimationNotifyCommon_C_ExecAnimationCommand;

// Function Int_AnimationNotifyCommon.Int_AnimationNotifyCommon_C.ExecAnimationCommandEx
// 0x000C (0x000C - 0x0000)
struct Int_AnimationNotifyCommon_C_ExecAnimationCommandEx final
{
public:
	class FName                                   bpp__Command__pf;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_StartLoopEnd                              bpp__Type__pf;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Int_AnimationNotifyCommon_C_ExecAnimationCommandEx;

}

