#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractableBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function InteractableBase.InteractableBase_C.BndEvt__PBET_OnInteractBox_K2Node_ComponentBoundEvent_0_PBETDelegate_OnBeginOverlapPC__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct InteractableBase_C_BndEvt__PBET_OnInteractBox_K2Node_ComponentBoundEvent_0_PBETDelegate_OnBeginOverlapPC__DelegateSignature final
{
public:
	class APBBaseCharacter*                       bpp__PC__pf;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractableBase_C_BndEvt__PBET_OnInteractBox_K2Node_ComponentBoundEvent_0_PBETDelegate_OnBeginOverlapPC__DelegateSignature;

// Function InteractableBase.InteractableBase_C.BndEvt__PBET_OnInteractBox_K2Node_ComponentBoundEvent_1_PBETDelegate_OnEndOverlapPC__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct InteractableBase_C_BndEvt__PBET_OnInteractBox_K2Node_ComponentBoundEvent_1_PBETDelegate_OnEndOverlapPC__DelegateSignature final
{
public:
	class APBBaseCharacter*                       bpp__PC__pf;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractableBase_C_BndEvt__PBET_OnInteractBox_K2Node_ComponentBoundEvent_1_PBETDelegate_OnEndOverlapPC__DelegateSignature;

// Function InteractableBase.InteractableBase_C.BndEvt__PBET_OnInteractBox_K2Node_ComponentBoundEvent_4_PBETDelegate_OnInteract__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct InteractableBase_C_BndEvt__PBET_OnInteractBox_K2Node_ComponentBoundEvent_4_PBETDelegate_OnInteract__DelegateSignature final
{
public:
	struct FPBET_InteractInfo                     bpp__InteractInfo__pf__const;                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractableBase_C_BndEvt__PBET_OnInteractBox_K2Node_ComponentBoundEvent_4_PBETDelegate_OnInteract__DelegateSignature;

// Function InteractableBase.InteractableBase_C.CanInteractBP
// 0x0010 (0x0010 - 0x0000)
struct InteractableBase_C_CanInteractBP final
{
public:
	class APBBaseCharacter*                       bpp__CharacterToTest__pf;                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__CanInteract__pf;                              // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InteractableBase_C_CanInteractBP;

// Function InteractableBase.InteractableBase_C.CreateInteractWidget
// 0x0010 (0x0010 - 0x0000)
struct InteractableBase_C_CreateInteractWidget final
{
public:
	class APBBaseCharacter*                       bpp__character__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBUserWidgetUpDownBase*                bpp__Widget__pf;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractableBase_C_CreateInteractWidget;

// Function InteractableBase.InteractableBase_C.OnInteract
// 0x0010 (0x0010 - 0x0000)
struct InteractableBase_C_OnInteract final
{
public:
	struct FPBET_InteractInfo                     bpp__InteractCharacter__pf;                        // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractableBase_C_OnInteract;

// Function InteractableBase.InteractableBase_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct InteractableBase_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                bpp__EndPlayReason__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractableBase_C_ReceiveEndPlay;

// Function InteractableBase.InteractableBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct InteractableBase_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractableBase_C_ReceiveTick;

// Function InteractableBase.InteractableBase_C.SetInteractionWidgetVisible
// 0x0010 (0x0010 - 0x0000)
struct InteractableBase_C_SetInteractionWidgetVisible final
{
public:
	bool                                          bpp__IsVisible__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       bpp__InteractingCharacter__pf;                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractableBase_C_SetInteractionWidgetVisible;

}

