#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractableBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// DynamicClass InteractableBase.InteractableBase_C
// 0x00E0 (0x06B0 - 0x05D0)
class AInteractableBase_C : public APBEventObject
{
public:
	class UPBET_OnInteractBox*                    PBET_OnInteractBox;                                // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        UpWidgetBasePoint;                                 // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowUsage;                                        // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOverlapping;                                     // 0x05E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanInteractOnlyWhileSameUpDir;                     // 0x05E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsForceNotVisible;                                 // 0x05E3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanNotInteractWhilePossessed;                      // 0x05E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E5[0x3];                                      // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class APBBaseCharacter*, class UPBUserWidgetUpDownBase*> InteractingCharacterToWidget;      // 0x05E8(0x0050)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Variable;                                 // 0x0638(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x063C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0640(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       K2Node_ComponentBoundEvent_PC1;                    // 0x0648(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_ComponentBoundEvent_PC;                     // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_CanInteractBP_CanInteract;                // 0x0658(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0659(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65A[0x6];                                      // 0x065A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBET_InteractInfo                     K2Node_ComponentBoundEvent_InteractInfo;           // 0x0660(0x0010)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0670(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_CanInteractBP_CanInteract1;               // 0x0674(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_675[0x3];                                      // 0x0675(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPBUserWidgetUpDownBase*>        CallFunc_Map_Values_Values;                        // 0x0678(0x0010)(ExportObject, ZeroConstructor, Transient, DuplicateTransient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UPBUserWidgetUpDownBase*                CallFunc_Array_Get_Item;                           // 0x0688(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APBBaseCharacter*>               CallFunc_GetInteractableCharacters_ReturnValue;    // 0x0690(0x0010)(ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       CallFunc_Array_Get_Item1;                          // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_CanInteractBP_CanInteract2;               // 0x06A8(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A9[0x7];                                      // 0x06A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BndEvt__PBET_OnInteractBox_K2Node_ComponentBoundEvent_0_PBETDelegate_OnBeginOverlapPC__DelegateSignature(class APBBaseCharacter* bpp__PC__pf);
	void BndEvt__PBET_OnInteractBox_K2Node_ComponentBoundEvent_1_PBETDelegate_OnEndOverlapPC__DelegateSignature(class APBBaseCharacter* bpp__PC__pf);
	void BndEvt__PBET_OnInteractBox_K2Node_ComponentBoundEvent_4_PBETDelegate_OnInteract__DelegateSignature(const struct FPBET_InteractInfo& bpp__InteractInfo__pf__const);
	void CanInteractBP(class APBBaseCharacter* bpp__CharacterToTest__pf, bool* bpp__CanInteract__pf);
	void CreateInteractWidget(class APBBaseCharacter* bpp__character__pf, class UPBUserWidgetUpDownBase** bpp__Widget__pf);
	void OnInteract(const struct FPBET_InteractInfo& bpp__InteractCharacter__pf);
	void OnUpdateOverlap();
	void ReceiveEndPlay(EEndPlayReason bpp__EndPlayReason__pf);
	void ReceiveTick(float bpp__DeltaSeconds__pf);
	void SetInteractionWidgetVisible(bool bpp__IsVisible__pf, class APBBaseCharacter* bpp__InteractingCharacter__pf);
	void Update();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractableBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractableBase_C")
	}
	static class AInteractableBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInteractableBase_C>();
	}
};
DUMPER7_ASSERTS_AInteractableBase_C;

}

