#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemMenuWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemMenuWindow.ItemMenuWindow_C
// 0x0028 (0x02A0 - 0x0278)
class UItemMenuWindow_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       R1Anime;                                           // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       L1Anime;                                           // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UItemListTab_C*                         ItemListTab;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonMenuListWindow_C*                ListWindow;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemMenuWindow(int32 EntryPoint);
	void Construct();
	void ScrollDown(int32 MoveVal, bool* isEnable);
	void SwitchTab(int32 Move);
	void Initialize();
	void Setup();
	void GetSelectList(class UItemListItem_C** ret);
	void Refresh(bool is_reset_scroll);
	void GetSortType(TArray<EInventorySort>* SortList);
	void GetSelectSortKey(struct FPBInventorySortData* Output);
	void SetSelectSortKey(const struct FPBInventorySortData& Input);
	void IsSelectSort(bool* isEnable);
	void IsEmpty(bool IsTrue, bool* isEnable);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ItemMenuWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemMenuWindow_C")
	}
	static class UItemMenuWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemMenuWindow_C>();
	}
};
DUMPER7_ASSERTS_UItemMenuWindow_C;

}

