#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaderBoard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeaderBoard.LeaderBoard_C
// 0x00A0 (0x0318 - 0x0278)
class ULeaderBoard_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Close;                                             // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOneButtonPopup_C*                      OneButtonPopup;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bg;                                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonControllGuide_C*                 ControllGuide;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MenuBox;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonMenuHeader_C*                    MenuHeader;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URankingModeSelecter_C*                 ModeSelecter;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shade;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventClosedMenu;                                   // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class URankingBossRush_C*                     BossRush;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URankingSpeedRun_C*                     Chaos;                                             // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URankingSpeedRun_C*                     SpeedRun;                                          // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Top;                                               // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LAST;                                              // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           steps;                                             // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          updateBlinkDirtyFlag;                              // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DEBUG_enableLeaderboardsOffline;                   // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_LeaderBoard(int32 EntryPoint);
	void OnNetworkDialogPopup();
	void BndEvt__1ButtonPopup_K2Node_ComponentBoundEvent_0_EventPopupOpend__DelegateSignature();
	void UnregisterPrivDelegate();
	void RegisterPrivDelegate();
	void BndEvt__1ButtonPopup_K2Node_ComponentBoundEvent_0_EventPopupClosed__DelegateSignature();
	void ShowProfile(const struct FPBLeaderboardRow& LeaderboardItem);
	void OnPressedButton();
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void Construct();
	void SetupBossRushMenu();
	void SetupSpeedRunMenu();
	void OnClosed_0A804D594F38993E701C909AA7E56239();
	void OnError_0A804D594F38993E701C909AA7E56239();
	void Initialize();
	void Setup();
	void OnStart();
	void OnBossRush();
	void OnChaos();
	void OnBossRevenge();
	void OnSpeedRun();
	void UpdateControlGuide(bool bShowOnlyBack);
	void SwitchMenu(int32 move_val);
	void AddMenuBox(class UWidget* add_menu);
	void SetMenu(int32 Param_Index_0);
	void AddMenuStep(class FName add_step);
	void Clear();
	void SetupMenu();
	void AddMenu(class FName Key);
	void SwitchStep(int32 Param_Index_0);
	void RemoveAll();
	void UpdateHeaderText();
	void UpdateRankContents();
	void OnPrivilegeCheckComplete(class FName FailureReason, const class FString& DisplayString);
	void OnCannotUseLeaderboard();
	void ChangeToCannotUseLeaderboards();
	void OnJustAllowBack();
	void DoCloseMenu();
	bool ShouldHandleNetworkError();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LeaderBoard_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LeaderBoard_C")
	}
	static class ULeaderBoard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderBoard_C>();
	}
};
DUMPER7_ASSERTS_ULeaderBoard_C;

}

