#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lib_Dialogue

#include "Basic.hpp"

#include "DialogueSpeakerAttribute_TableItem_structs.hpp"
#include "Dialogue_TableItem_structs.hpp"


namespace SDK::Params
{

// Function Lib_Dialogue.Lib_Dialogue_C.DialogueBranchMeetsConditions
// 0x00B8 (0x00B8 - 0x0000)
struct Lib_Dialogue_C_DialogueBranchMeetsConditions final
{
public:
	class FName                                   bpp__Branch__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__BranchHost__pf;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDialogue_TableItem                    bpp__DialogueItem__pf;                             // 0x0010(0x0090)(Parm, NativeAccessSpecifierPublic)
	class ABP_ScriptInterpreter_C*                bpp__ScriptInterpreter__pf;                        // 0x00A0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x00A8(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ConditionsMet__pf;                            // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Lib_Dialogue_C_DialogueBranchMeetsConditions;

// Function Lib_Dialogue.Lib_Dialogue_C.ExtractDialogueBranchHost
// 0x0030 (0x0030 - 0x0000)
struct Lib_Dialogue_C_ExtractDialogueBranchHost final
{
public:
	class FString                                 bpp__RawBranch__pf__const;                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__DialoguexResponsexHandler__pfTT;              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__Host__pf;                                     // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Branch__pf;                                   // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Lib_Dialogue_C_ExtractDialogueBranchHost;

// Function Lib_Dialogue.Lib_Dialogue_C.ExtractDialogueTraits
// 0x00B0 (0x00B0 - 0x0000)
struct Lib_Dialogue_C_ExtractDialogueTraits final
{
public:
	struct FDialogue_TableItem                    bpp__Item__pf;                                     // 0x0000(0x0090)(Parm, NativeAccessSpecifierPublic)
	class ABP_ScriptInterpreter_C*                bpp__ScriptInterpreter__pf;                        // 0x0090(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0098(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         bpp__Traits__pf;                                   // 0x00A0(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Lib_Dialogue_C_ExtractDialogueTraits;

// Function Lib_Dialogue.Lib_Dialogue_C.GetDialogueItem
// 0x00A8 (0x00A8 - 0x0000)
struct Lib_Dialogue_C_GetDialogueItem final
{
public:
	class UObject*                                bpp__DatatableHost__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__RowName__pf;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDialogue_TableItem                    bpp__Item__pf;                                     // 0x0018(0x0090)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Lib_Dialogue_C_GetDialogueItem;

// Function Lib_Dialogue.Lib_Dialogue_C.GetDialogueItem_Func
// 0x00A8 (0x00A8 - 0x0000)
struct Lib_Dialogue_C_GetDialogueItem_Func final
{
public:
	class UObject*                                bpp__DatatableHost__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__RowName__pf;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDialogue_TableItem                    bpp__Item__pf;                                     // 0x0018(0x0090)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Lib_Dialogue_C_GetDialogueItem_Func;

// Function Lib_Dialogue.Lib_Dialogue_C.GetSpeakerAttributes
// 0x0048 (0x0048 - 0x0000)
struct Lib_Dialogue_C_GetSpeakerAttributes final
{
public:
	class UObject*                                bpp__DatatableHost__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__SpeakerID__pf;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDialogueSpeakerAttribute_TableItem    bpp__Attributes__pf;                               // 0x0018(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bpp__Success__pf;                                  // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Lib_Dialogue_C_GetSpeakerAttributes;

// Function Lib_Dialogue.Lib_Dialogue_C.GetSpeakerAttributes_Func
// 0x0048 (0x0048 - 0x0000)
struct Lib_Dialogue_C_GetSpeakerAttributes_Func final
{
public:
	class UObject*                                bpp__DatatableHost__pf;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__SpeakerID__pf;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp____WorldContext__pf;                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDialogueSpeakerAttribute_TableItem    bpp__Attributes__pf;                               // 0x0018(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bpp__Success__pf;                                  // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Lib_Dialogue_C_GetSpeakerAttributes_Func;

}

