#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenuLevel

#include "Basic.hpp"


namespace SDK::Params
{

// Function MainMenuLevel.MainMenuLevel_C.ExecuteUbergraph_MainMenuLevel
// 0x0004 (0x0004 - 0x0000)
struct MainMenuLevel_C_ExecuteUbergraph_MainMenuLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MainMenuLevel_C_ExecuteUbergraph_MainMenuLevel;

// Function MainMenuLevel.MainMenuLevel_C.Setup
// 0x0028 (0x0028 - 0x0000)
struct MainMenuLevel_C_Setup final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewLocalVar_0;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Next;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreLevel;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Exp;                                               // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBBaseCharacter*                       PBChara;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBCharacterStatusComponent*            Status;                                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MainMenuLevel_C_Setup;

// Function MainMenuLevel.MainMenuLevel_C.UpdateExp
// 0x0030 (0x0030 - 0x0000)
struct MainMenuLevel_C_UpdateExp final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetPlayerExpText_ReturnValue;             // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_MainMenuLevel_C_UpdateExp;

// Function MainMenuLevel.MainMenuLevel_C.UpdateNextExp
// 0x0030 (0x0030 - 0x0000)
struct MainMenuLevel_C_UpdateNextExp final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetPlayerNextExpText_ReturnValue;         // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_MainMenuLevel_C_UpdateNextExp;

// Function MainMenuLevel.MainMenuLevel_C.UpdateLevel
// 0x0030 (0x0030 - 0x0000)
struct MainMenuLevel_C_UpdateLevel final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetPlayerLevelText_ReturnValue;           // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_MainMenuLevel_C_UpdateLevel;

// Function MainMenuLevel.MainMenuLevel_C.UpdateExpGauge
// 0x0028 (0x0028 - 0x0000)
struct MainMenuLevel_C_UpdateExpGauge final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APBBaseCharacter*                       CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNextExpGauge_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MainMenuLevel_C_UpdateExpGauge;

}

