#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenuEffChoice

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenuEffChoice.MainMenuEffChoice_C
// 0x0030 (0x0288 - 0x0258)
class UMainMenuEffChoice_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       flash;                                             // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Blink;                                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Eff;                                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   FlashEnd;                                          // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_MainMenuEffChoice(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void Construct();
	void Initialize();
	void Setup();
	void PlayBlink();
	void StopBlink();
	void SetSelect(bool IsSelect);
	void PlayFlash();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MainMenuEffChoice_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MainMenuEffChoice_C")
	}
	static class UMainMenuEffChoice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenuEffChoice_C>();
	}
};
DUMPER7_ASSERTS_UMainMenuEffChoice_C;

}

