#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenuLevel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenuLevel.MainMenuLevel_C
// 0x0030 (0x0288 - 0x0258)
class UMainMenuLevel_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 GaugeEXP;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextEXP;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextLevel;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextNext;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenuLevel(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void UpdateExp();
	void UpdateNextExp();
	void UpdateLevel();
	void UpdateExpGauge();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MainMenuLevel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MainMenuLevel_C")
	}
	static class UMainMenuLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenuLevel_C>();
	}
};
DUMPER7_ASSERTS_UMainMenuLevel_C;

}

