#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapTraverseRate

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MapTraverseRate.MapTraverseRate_C.ExecuteUbergraph_MapTraverseRate
// 0x0004 (0x0004 - 0x0000)
struct MapTraverseRate_C_ExecuteUbergraph_MapTraverseRate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MapTraverseRate_C_ExecuteUbergraph_MapTraverseRate;

// Function MapTraverseRate.MapTraverseRate_C.SetTraverseRate
// 0x00A0 (0x00A0 - 0x0000)
struct MapTraverseRate_C_SetTraverseRate final
{
public:
	class FText                                   txt;                                               // 0x0000(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_GetRoomTraverseRate_Completed;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRoomTraverseRate_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
};
DUMPER7_ASSERTS_MapTraverseRate_C_SetTraverseRate;

}

