#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultilineMsgPopup

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MultilineMsgPopup.MultilineMsgPopup_C.ExecuteUbergraph_MultilineMsgPopup
// 0x0040 (0x0040 - 0x0000)
struct MultilineMsgPopup_C_ExecuteUbergraph_MultilineMsgPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MultilineMsgPopup_C_ExecuteUbergraph_MultilineMsgPopup;

// Function MultilineMsgPopup.MultilineMsgPopup_C.Tick
// 0x003C (0x003C - 0x0000)
struct MultilineMsgPopup_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MultilineMsgPopup_C_Tick;

// Function MultilineMsgPopup.MultilineMsgPopup_C.Setup
// 0x0008 (0x0008 - 0x0000)
struct MultilineMsgPopup_C_Setup final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MultilineMsgPopup_C_Setup;

// Function MultilineMsgPopup.MultilineMsgPopup_C.OnActive
// 0x0018 (0x0018 - 0x0000)
struct MultilineMsgPopup_C_OnActive final
{
public:
	int32                                         ret;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelectCancel_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectDecide_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSoundControlComponent*               CallFunc_GetSoundControlComponent_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MultilineMsgPopup_C_OnActive;

// Function MultilineMsgPopup.MultilineMsgPopup_C.OpenPopup
// 0x0028 (0x0028 - 0x0000)
struct MultilineMsgPopup_C_OpenPopup final
{
public:
	class FText                                   txt;                                               // 0x0000(0x0018)(Edit, BlueprintVisible)
	int32                                         order;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MultilineMsgPopup_C_OpenPopup;

// Function MultilineMsgPopup.MultilineMsgPopup_C.ClosePopup
// 0x0008 (0x0008 - 0x0000)
struct MultilineMsgPopup_C_ClosePopup final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_MultilineMsgPopup_C_ClosePopup;

// Function MultilineMsgPopup.MultilineMsgPopup_C.SetPopupText
// 0x0030 (0x0030 - 0x0000)
struct MultilineMsgPopup_C_SetPopupText final
{
public:
	class FText                                   input_text;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   txt;                                               // 0x0018(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_MultilineMsgPopup_C_SetPopupText;

// Function MultilineMsgPopup.MultilineMsgPopup_C.GetPopupReturn
// 0x000C (0x000C - 0x0000)
struct MultilineMsgPopup_C_GetPopupReturn final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_OnActive_ret;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_MultilineMsgPopup_C_GetPopupReturn;

// Function MultilineMsgPopup.MultilineMsgPopup_C.IsPopupActive
// 0x0002 (0x0002 - 0x0000)
struct MultilineMsgPopup_C_IsPopupActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_MultilineMsgPopup_C_IsPopupActive;

// Function MultilineMsgPopup.MultilineMsgPopup_C.IsPopupOpening
// 0x0003 (0x0003 - 0x0000)
struct MultilineMsgPopup_C_IsPopupOpening final
{
public:
	bool                                          IsOpening;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_MultilineMsgPopup_C_IsPopupOpening;

}

