#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_Utility

#include "Basic.hpp"

#include "EPB_AdjustTypeX_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EPB_OnceFlag_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "EPB_DamageIgnoreType_structs.hpp"
#include "EPB_ExclusiveTimer_structs.hpp"
#include "EPB_AdjustTypeZ_structs.hpp"
#include "EPB_OffsetType_structs.hpp"
#include "EPB_ExecFrameList_structs.hpp"


namespace SDK::Params
{

// Function OBJ_Utility.OBJ_Utility_C.AddAttackObjectOverride
// 0x0110 (0x0110 - 0x0000)
struct OBJ_Utility_C_AddAttackObjectOverride final
{
public:
	class FName                                   bpp__DamageID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__CollisionID__pf;                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBDamageParameter                     bpp__DamageParameter__pf;                          // 0x0010(0x00F8)(Parm, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0108(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_Utility_C_AddAttackObjectOverride;

// Function OBJ_Utility.OBJ_Utility_C.AddExtraDamage
// 0x002C (0x002C - 0x0000)
struct OBJ_Utility_C_AddExtraDamage final
{
public:
	class FName                                   bpp__DamageID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__StartWorldLocation__pf;                       // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__EndWorldLocation__pf;                         // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Radius__pf;                                   // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsOverRoom__pf;                               // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__ManageID__pf;                                 // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_AddExtraDamage;

// Function OBJ_Utility.OBJ_Utility_C.AddExtraDamageEx
// 0x0028 (0x0028 - 0x0000)
struct OBJ_Utility_C_AddExtraDamageEx final
{
public:
	class FName                                   bpp__DamageID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__StartWorldLocation__pf;                       // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__EndWorldLocation__pf;                         // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Radius__pf;                                   // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__ManageID__pf;                                 // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_AddExtraDamageEx;

// Function OBJ_Utility.OBJ_Utility_C.AddExtraDamageOverride
// 0x0120 (0x0120 - 0x0000)
struct OBJ_Utility_C_AddExtraDamageOverride final
{
public:
	class FName                                   bpp__DamageID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBDamageParameter                     bpp__DamageParameter__pf;                          // 0x0008(0x00F8)(Parm, NativeAccessSpecifierPublic)
	struct FVector                                bpp__StartWorldLocation__pf;                       // 0x0100(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__EndWorldLocation__pf;                         // 0x010C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Radius__pf;                                   // 0x0118(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__ManageID__pf;                                 // 0x011C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_AddExtraDamageOverride;

// Function OBJ_Utility.OBJ_Utility_C.ApplySign
// 0x000C (0x000C - 0x0000)
struct OBJ_Utility_C_ApplySign final
{
public:
	float                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsPlus__pf;                                   // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__UValue__pf;                                   // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_ApplySign;

// Function OBJ_Utility.OBJ_Utility_C.bLock
// 0x0008 (0x0008 - 0x0000)
struct OBJ_Utility_C_bLock final
{
public:
	float                                         bpp__BlockNum__pf;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__CM__pf;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_bLock;

// Function OBJ_Utility.OBJ_Utility_C.CameraShake
// 0x0048 (0x0048 - 0x0000)
struct OBJ_Utility_C_CameraShake final
{
public:
	float                                         bpp__Duration__pf;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__PitchAmp__pf;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__PitchFreq__pf;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__YawAmp__pf;                                   // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__YawFreq__pf;                                  // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__RollAmp__pf;                                  // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__RollFreq__pf;                                 // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackEffect*                   bpp__FFE__pf;                                      // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Tag__pf;                                      // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__hdUse__pf;                                    // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   bpp__hdTag__pf;                                    // 0x0034(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      bpp__OptionalController__pf;                       // 0x0040(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_CameraShake;

// Function OBJ_Utility.OBJ_Utility_C.CharacterSlomoStart
// 0x0020 (0x0020 - 0x0000)
struct OBJ_Utility_C_CharacterSlomoStart final
{
public:
	class APBBaseCharacter*                       bpp__ChrIns__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__SlomoRate__pf;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__ReachDestinationTime__pf;                     // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__RateWaitTime__pf;                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__SlomoTime__pf;                                // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__ReachDefaultTime__pf;                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_Utility_C_CharacterSlomoStart;

// Function OBJ_Utility.OBJ_Utility_C.CharacterSlomoStop
// 0x0008 (0x0008 - 0x0000)
struct OBJ_Utility_C_CharacterSlomoStop final
{
public:
	class APBBaseCharacter*                       bpp__ChrIns__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_CharacterSlomoStop;

// Function OBJ_Utility.OBJ_Utility_C.Check_Template
// 0x0001 (0x0001 - 0x0000)
struct OBJ_Utility_C_Check_Template final
{
public:
	bool                                          bpp__IsCheck__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_Check_Template;

// Function OBJ_Utility.OBJ_Utility_C.CheckDamageObject
// 0x00F0 (0x00F0 - 0x0000)
struct OBJ_Utility_C_CheckDamageObject final
{
public:
	int32                                         bpp__ID__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStepDamageInfo                        bpp__Value__pf;                                    // 0x0008(0x00E0)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSamae__pf;                                  // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_Utility_C_CheckDamageObject;

// Function OBJ_Utility.OBJ_Utility_C.CheckFrameCount
// 0x0002 (0x0002 - 0x0000)
struct OBJ_Utility_C_CheckFrameCount final
{
public:
	EPB_ExecFrameList                             bpp__ExecType__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_CheckFrameCount;

// Function OBJ_Utility.OBJ_Utility_C.CheckMoveDirectionScreen
// 0x0002 (0x0002 - 0x0000)
struct OBJ_Utility_C_CheckMoveDirectionScreen final
{
public:
	bool                                          bpp__IsForward__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsValidDirection__pf;                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_CheckMoveDirectionScreen;

// Function OBJ_Utility.OBJ_Utility_C.CheckTurn
// 0x0001 (0x0001 - 0x0000)
struct OBJ_Utility_C_CheckTurn final
{
public:
	bool                                          bpp__IsCheck__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_CheckTurn;

// Function OBJ_Utility.OBJ_Utility_C.ConsumeShardMP
// 0x0008 (0x0008 - 0x0000)
struct OBJ_Utility_C_ConsumeShardMP final
{
public:
	class FName                                   bpp__ShardName__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_ConsumeShardMP;

// Function OBJ_Utility.OBJ_Utility_C.ConvertLocationSplineToWorld
// 0x0018 (0x0018 - 0x0000)
struct OBJ_Utility_C_ConvertLocationSplineToWorld final
{
public:
	struct FVector                                bpp__SplineLocation__pf;                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__WorldLocation__pf;                            // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_ConvertLocationSplineToWorld;

// Function OBJ_Utility.OBJ_Utility_C.ConvertLocationWorldToSpline
// 0x0018 (0x0018 - 0x0000)
struct OBJ_Utility_C_ConvertLocationWorldToSpline final
{
public:
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SplineLocation__pf;                           // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_ConvertLocationWorldToSpline;

// Function OBJ_Utility.OBJ_Utility_C.DeleteEffect
// 0x0008 (0x0008 - 0x0000)
struct OBJ_Utility_C_DeleteEffect final
{
public:
	int32                                         bpp__ManId__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsGlobal__pf;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_Utility_C_DeleteEffect;

// Function OBJ_Utility.OBJ_Utility_C.DeleteEffectSafety
// 0x0008 (0x0008 - 0x0000)
struct OBJ_Utility_C_DeleteEffectSafety final
{
public:
	class APBParticle*                            bpp__Effect__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_DeleteEffectSafety;

// Function OBJ_Utility.OBJ_Utility_C.DeltaValue
// 0x0008 (0x0008 - 0x0000)
struct OBJ_Utility_C_DeltaValue final
{
public:
	float                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__return__pf;                                   // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_DeltaValue;

// Function OBJ_Utility.OBJ_Utility_C.ExecuteShardEx
// 0x0028 (0x0028 - 0x0000)
struct OBJ_Utility_C_ExecuteShardEx final
{
public:
	class FName                                   bpp__ShardName__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BulletID__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBulletDirection                              bpp__Direction__pf;                                // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBulletActor*                         bpp__BulletInstance__pf;                           // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_ExecuteShardEx;

// Function OBJ_Utility.OBJ_Utility_C.FindCharacterGroundWorldLocation
// 0x0020 (0x0020 - 0x0000)
struct OBJ_Utility_C_FindCharacterGroundWorldLocation final
{
public:
	bool                                          bpp__IsIgnorePlatform__pf;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__FindHeight__pf;                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__FindRangeDegree__pf;                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__FindRangeInterval__pf;                        // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFind__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__GroundWorldLocation__pf;                      // 0x0014(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_FindCharacterGroundWorldLocation;

// Function OBJ_Utility.OBJ_Utility_C.FindGroundWorldLocation
// 0x002C (0x002C - 0x0000)
struct OBJ_Utility_C_FindGroundWorldLocation final
{
public:
	struct FVector                                bpp__BaseWorldLocation__pf;                        // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsIgnorePlatform__pf;                         // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__FindHeight__pf;                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__FindRangeDegree__pf;                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__FindRangeInterval__pf;                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFind__pf;                                   // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__GroundWorldLocation__pf;                      // 0x0020(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_FindGroundWorldLocation;

// Function OBJ_Utility.OBJ_Utility_C.FindWallCliff
// 0x001C (0x001C - 0x0000)
struct OBJ_Utility_C_FindWallCliff final
{
public:
	int32                                         bpp__Block__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFindWall__pf;                               // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFindCliff__pf;                              // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__WallDist__pf;                                 // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__CliffDist__pf;                                // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__HitPosition__pf;                              // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_FindWallCliff;

// Function OBJ_Utility.OBJ_Utility_C.FlipIfBack
// 0x0010 (0x0010 - 0x0000)
struct OBJ_Utility_C_FlipIfBack final
{
public:
	struct FVector                                bpp__Position__pf;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFront__pf;                                  // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_Utility_C_FlipIfBack;

// Function OBJ_Utility.OBJ_Utility_C.GetBulletDataTable
// 0x0330 (0x0330 - 0x0000)
struct OBJ_Utility_C_GetBulletDataTable final
{
public:
	class FName                                   bpp__BulletID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBBulletParameter                     bpp__PB_Bullet__pf;                                // 0x0010(0x01E0)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FPBBallisticParameter                  bpp__PB_Bullistic__pf;                             // 0x01F0(0x0140)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetBulletDataTable;

// Function OBJ_Utility.OBJ_Utility_C.GetCeillPosition
// 0x001C (0x001C - 0x0000)
struct OBJ_Utility_C_GetCeillPosition final
{
public:
	struct FVector                                bpp__BasePosition__pf;                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFind__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__FindPosition__pf;                             // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetCeillPosition;

// Function OBJ_Utility.OBJ_Utility_C.GetCharacterWorldTime
// 0x0004 (0x0004 - 0x0000)
struct OBJ_Utility_C_GetCharacterWorldTime final
{
public:
	float                                         bpp__WorldTime__pf;                                // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetCharacterWorldTime;

// Function OBJ_Utility.OBJ_Utility_C.GetDirectionalGroundLocation
// 0x0018 (0x0018 - 0x0000)
struct OBJ_Utility_C_GetDirectionalGroundLocation final
{
public:
	int32                                         bpp__Blok__pf;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Interval__pf;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        bpp__WorldLocations__pf;                           // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetDirectionalGroundLocation;

// Function OBJ_Utility.OBJ_Utility_C.GetDistance2D
// 0x001C (0x001C - 0x0000)
struct OBJ_Utility_C_GetDistance2D final
{
public:
	struct FVector                                bpp__Position1__pf;                                // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Position2__pf;                                // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Distance__pf;                                 // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetDistance2D;

// Function OBJ_Utility.OBJ_Utility_C.GetDistance3D
// 0x001C (0x001C - 0x0000)
struct OBJ_Utility_C_GetDistance3D final
{
public:
	struct FVector                                bpp__Position1__pf;                                // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Position2__pf;                                // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Distance__pf;                                 // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetDistance3D;

// Function OBJ_Utility.OBJ_Utility_C.GetDistance3DNotSqrt
// 0x001C (0x001C - 0x0000)
struct OBJ_Utility_C_GetDistance3DNotSqrt final
{
public:
	struct FVector                                bpp__Position1__pf;                                // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Position2__pf;                                // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__SqrtDistance__pf;                             // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetDistance3DNotSqrt;

// Function OBJ_Utility.OBJ_Utility_C.GetDistanceSpline3D
// 0x001C (0x001C - 0x0000)
struct OBJ_Utility_C_GetDistanceSpline3D final
{
public:
	struct FVector                                bpp__SplineLocation1__pf;                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SplineLocation2__pf;                          // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Distance__pf;                                 // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetDistanceSpline3D;

// Function OBJ_Utility.OBJ_Utility_C.GetGroundPosition
// 0x001C (0x001C - 0x0000)
struct OBJ_Utility_C_GetGroundPosition final
{
public:
	struct FVector                                bpp__BasePosition__pf;                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFind__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__FindPosition__pf;                             // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetGroundPosition;

// Function OBJ_Utility.OBJ_Utility_C.GetGroundTagByWorldLocation
// 0x0014 (0x0014 - 0x0000)
struct OBJ_Utility_C_GetGroundTagByWorldLocation final
{
public:
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__SplineTag__pf;                                // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetGroundTagByWorldLocation;

// Function OBJ_Utility.OBJ_Utility_C.GetGroundWorldLocation
// 0x0010 (0x0010 - 0x0000)
struct OBJ_Utility_C_GetGroundWorldLocation final
{
public:
	bool                                          bpp__IsGround__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetGroundWorldLocation;

// Function OBJ_Utility.OBJ_Utility_C.GetGroundWorldLocationBase
// 0x0034 (0x0034 - 0x0000)
struct OBJ_Utility_C_GetGroundWorldLocationBase final
{
public:
	struct FVector                                bpp__BaseWorldLocation__pf;                        // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsInvert__pf;                                 // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsIgnorePlatform__pf;                         // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__CapsuleRadius__pf;                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__CapsuleHalfHeight__pf;                        // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__FindHeight__pf;                               // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__FindRangeDegree__pf;                          // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__FindRangeInterval__pf;                        // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFindGround__pf;                             // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__GroundWorldLocation__pf;                      // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetGroundWorldLocationBase;

// Function OBJ_Utility.OBJ_Utility_C.GetGroundWorldLocationForward
// 0x0030 (0x0030 - 0x0000)
struct OBJ_Utility_C_GetGroundWorldLocationForward final
{
public:
	struct FVector                                bpp__CheckTargetWorldLocation__pf;                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__CheckBaseWorldLocation__pf;                   // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__CheckDivisionNum__pf;                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__CheckRayDistance__pf;                         // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsGround__pf;                                 // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0024(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetGroundWorldLocationForward;

// Function OBJ_Utility.OBJ_Utility_C.GetGroundWorldLocationFromBaseLocation
// 0x0020 (0x0020 - 0x0000)
struct OBJ_Utility_C_GetGroundWorldLocationFromBaseLocation final
{
public:
	struct FVector                                bpp__BaseWorldLocation__pf;                        // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__CheckDistance__pf;                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsGround__pf;                                 // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0014(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetGroundWorldLocationFromBaseLocation;

// Function OBJ_Utility.OBJ_Utility_C.GetGroundWorldLocationUpForwardOffset
// 0x0018 (0x0018 - 0x0000)
struct OBJ_Utility_C_GetGroundWorldLocationUpForwardOffset final
{
public:
	float                                         bpp__UpValue__pf;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__ForwardValue__pf;                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsGround__pf;                                 // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__WorldLocation__pf;                            // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetGroundWorldLocationUpForwardOffset;

// Function OBJ_Utility.OBJ_Utility_C.GetMirroringSocket
// 0x0018 (0x0018 - 0x0000)
struct OBJ_Utility_C_GetMirroringSocket final
{
public:
	class FString                                 bpp__BaseSocket__pf__const;                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Socket__pf;                                   // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetMirroringSocket;

// Function OBJ_Utility.OBJ_Utility_C.GetMirroringSocketLocation
// 0x0020 (0x0020 - 0x0000)
struct OBJ_Utility_C_GetMirroringSocketLocation final
{
public:
	class FString                                 bpp__BaseSocket__pf__const;                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetMirroringSocketLocation;

// Function OBJ_Utility.OBJ_Utility_C.GetMirrorVector
// 0x0024 (0x0024 - 0x0000)
struct OBJ_Utility_C_GetMirrorVector final
{
public:
	struct FVector                                bpp__FVector__pf;                                  // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__NVector__pf;                                  // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__RVector__pf;                                  // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetMirrorVector;

// Function OBJ_Utility.OBJ_Utility_C.GetNearyCharacter
// 0x0028 (0x0028 - 0x0000)
struct OBJ_Utility_C_GetNearyCharacter final
{
public:
	struct FVector                                bpp__BaseWorldLocation__pf;                        // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__BaseUnitVector__pf;                           // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFind__pf;                                   // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       bpp__ChrIns__pf;                                   // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetNearyCharacter;

// Function OBJ_Utility.OBJ_Utility_C.GetOffsetPosition
// 0x0028 (0x0028 - 0x0000)
struct OBJ_Utility_C_GetOffsetPosition final
{
public:
	struct FVector                                bpp__TargetPosition__pf;                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Offset__pf;                                   // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_OffsetType                                bpp__OffsetType__pf;                               // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_AdjustTypeX                               bpp__AdjustTypeX__pf;                              // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_AdjustTypeZ                               bpp__AdjustTypeZ__pf;                              // 0x001A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__Position__pf;                                 // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetOffsetPosition;

// Function OBJ_Utility.OBJ_Utility_C.GetOuterCircumference
// 0x0010 (0x0010 - 0x0000)
struct OBJ_Utility_C_GetOuterCircumference final
{
public:
	float                                         bpp__Radius__pf;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Speed__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Rate__pf;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__OuterSpeed__pf;                               // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetOuterCircumference;

// Function OBJ_Utility.OBJ_Utility_C.GetScreenPosition
// 0x0018 (0x0018 - 0x0000)
struct OBJ_Utility_C_GetScreenPosition final
{
public:
	struct FVector                                bpp__Position__pf;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Player__pf;                                   // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__X__pf;                                        // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Y__pf;                                        // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetScreenPosition;

// Function OBJ_Utility.OBJ_Utility_C.GetWallDistByRay
// 0x0010 (0x0010 - 0x0000)
struct OBJ_Utility_C_GetWallDistByRay final
{
public:
	struct FVector                                bpp__Location__pf;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Length__pf;                                   // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetWallDistByRay;

// Function OBJ_Utility.OBJ_Utility_C.GetWorldDepthVector
// 0x0010 (0x0010 - 0x0000)
struct OBJ_Utility_C_GetWorldDepthVector final
{
public:
	float                                         bpp__Length__pf;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Vector__pf;                                   // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetWorldDepthVector;

// Function OBJ_Utility.OBJ_Utility_C.GetWorldLocationFromSplineOffset
// 0x0024 (0x0024 - 0x0000)
struct OBJ_Utility_C_GetWorldLocationFromSplineOffset final
{
public:
	struct FVector                                bpp__SplineLocation__pf;                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SplineOffsetVector__pf;                       // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__WorldLocation__pf;                            // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetWorldLocationFromSplineOffset;

// Function OBJ_Utility.OBJ_Utility_C.GetWorldRightVectorFromSpline
// 0x0018 (0x0018 - 0x0000)
struct OBJ_Utility_C_GetWorldRightVectorFromSpline final
{
public:
	struct FVector                                bpp__SplineLocation__pf;                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__WorldVector__pf;                              // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_GetWorldRightVectorFromSpline;

// Function OBJ_Utility.OBJ_Utility_C.IsAttach
// 0x0001 (0x0001 - 0x0000)
struct OBJ_Utility_C_IsAttach final
{
public:
	bool                                          bpp__IsAttach__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_IsAttach;

// Function OBJ_Utility.OBJ_Utility_C.IsAttached
// 0x0001 (0x0001 - 0x0000)
struct OBJ_Utility_C_IsAttached final
{
public:
	bool                                          bpp__IsAttach__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_IsAttached;

// Function OBJ_Utility.OBJ_Utility_C.IsBack
// 0x0010 (0x0010 - 0x0000)
struct OBJ_Utility_C_IsBack final
{
public:
	struct FVector                                bpp__Position__pf;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFront__pf;                                  // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_Utility_C_IsBack;

// Function OBJ_Utility.OBJ_Utility_C.IsExclusiveInterval
// 0x000C (0x000C - 0x0000)
struct OBJ_Utility_C_IsExclusiveInterval final
{
public:
	EPB_ExclusiveTimer                            bpp__ID__pf;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Interval__pf;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsInterval__pf;                               // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_Utility_C_IsExclusiveInterval;

// Function OBJ_Utility.OBJ_Utility_C.IsExtraBossMode
// 0x0001 (0x0001 - 0x0000)
struct OBJ_Utility_C_IsExtraBossMode final
{
public:
	bool                                          bpp__IsExtraBossMode__pf;                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_IsExtraBossMode;

// Function OBJ_Utility.OBJ_Utility_C.IsFront
// 0x0010 (0x0010 - 0x0000)
struct OBJ_Utility_C_IsFront final
{
public:
	struct FVector                                bpp__Position__pf;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFront__pf;                                  // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_Utility_C_IsFront;

// Function OBJ_Utility.OBJ_Utility_C.IsFrontMove
// 0x0001 (0x0001 - 0x0000)
struct OBJ_Utility_C_IsFrontMove final
{
public:
	bool                                          bpp__IsFrontMove__pf;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_Utility_C_IsFrontMove;

// Function OBJ_Utility.OBJ_Utility_C.IsFrontTarget
// 0x001C (0x001C - 0x0000)
struct OBJ_Utility_C_IsFrontTarget final
{
public:
	struct FVector                                bpp__Base__pf;                                     // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Target__pf;                                   // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsFront__pf;                                  // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_Utility_C_IsFrontTarget;

// Function OBJ_Utility.OBJ_Utility_C.IsInner2DX
// 0x0020 (0x0020 - 0x0000)
struct OBJ_Utility_C_IsInner2DX final
{
