#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_SystemSpeedContoroler

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function OBJ_SystemSpeedContoroler.OBJ_SystemSpeedContoroler_C.SetCurrentSpeed
// 0x000C (0x000C - 0x0000)
struct OBJ_SystemSpeedContoroler_C_SetCurrentSpeed final
{
public:
	struct FVector                                bpp__CurrentSPeed__pf;                             // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_SystemSpeedContoroler_C_SetCurrentSpeed;

// Function OBJ_SystemSpeedContoroler.OBJ_SystemSpeedContoroler_C.StartGlobalMove
// 0x000C (0x000C - 0x0000)
struct OBJ_SystemSpeedContoroler_C_StartGlobalMove final
{
public:
	struct FVector                                bpp__MoveSpeed__pf;                                // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_SystemSpeedContoroler_C_StartGlobalMove;

// Function OBJ_SystemSpeedContoroler.OBJ_SystemSpeedContoroler_C.UpdateMoveInfo
// 0x0094 (0x0094 - 0x0000)
struct OBJ_SystemSpeedContoroler_C_UpdateMoveInfo final
{
public:
	struct FStepUpdateMoveInfo                    bpp__MoveInfo__pf;                                 // 0x0000(0x0094)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_SystemSpeedContoroler_C_UpdateMoveInfo;

// Function OBJ_SystemSpeedContoroler.OBJ_SystemSpeedContoroler_C.UpdateMoveInput
// 0x0048 (0x0048 - 0x0000)
struct OBJ_SystemSpeedContoroler_C_UpdateMoveInput final
{
public:
	struct FStepUpdateInputMovement               bpp__MoveInput__pf;                                // 0x0000(0x0048)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_SystemSpeedContoroler_C_UpdateMoveInput;

// Function OBJ_SystemSpeedContoroler.OBJ_SystemSpeedContoroler_C.UpdateMoveOutput
// 0x001C (0x001C - 0x0000)
struct OBJ_SystemSpeedContoroler_C_UpdateMoveOutput final
{
public:
	struct FStepUpdateOutput                      bpp__MoveOutput__pf;                               // 0x0000(0x001C)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_SystemSpeedContoroler_C_UpdateMoveOutput;

}

