#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_ActiveSensorControler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Obj_Root_classes.hpp"


namespace SDK
{

// DynamicClass OBJ_ActiveSensorControler.OBJ_ActiveSensorControler_C
// 0x0138 (0x01D8 - 0x00A0)
class UOBJ_ActiveSensorControler_C final : public UOBJ_Root_C
{
public:
	bool                                          IsActive;                                          // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, int32>                            ActiveSensorID_List;                               // 0x00A8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<int32, int32>                            NoActiveSensorID_List;                             // 0x00F8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          ConditionActiveSensor;                             // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ConditionNoActiveSensor;                           // 0x0149(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ConditionDamage;                                   // 0x014A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ConditionDiaDealDamage;                            // 0x014B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LocalCheckDiaDealDamage;                           // 0x014C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ConditionScreenOut;                                // 0x014D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ActiveDebug;                                       // 0x014E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14F[0x1];                                      // 0x014F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                StartPoint;                                        // 0x0150(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocalScreenOutTimer;                               // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScreenOutMaxTimer;                                 // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ActiveRequest;                                     // 0x0164(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NotActiveRequest;                                  // 0x0165(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_166[0x2];                                      // 0x0166(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, bool>                             AllSensorID_List;                                  // 0x0168(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_Event_ChrIns_OBJ_ActiveSensorControler_C;   // 0x01B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBStepBase*                            K2Node_Event_StepIns_OBJ_ActiveSensorControler_C;  // 0x01C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_OBJ_ActiveSensorControler_C; // 0x01C8(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)

public:
	void BindDidDealDamage();
	void ChangeIsActive();
	void CheckActiveSensor(bool* bpp__IsSuccess__pf);
	void CheckDamage(bool* bpp__IsSuccess__pf);
	void CheckDidDealDamage(bool* bpp__IsSuccess__pf);
	void CheckNoActiveSensor(bool* bpp__IsSuccess__pf);
	void CheckScreenOut(bool* bpp__IsSuccess__pf);
	void DeleteActiveSensor(const int32& bpp__ID__pf__const);
	void DeleteNoActiveSensor(const int32& bpp__ID__pf__const);
	void GetIsActive(bool* bpp__Is__pf);
	void GetStartPoint(struct FVector* bpp__Pos__pf);
	void ResetActiveParameter();
	void ResetNoActiveParameter();
	void SetActiveSensor(int32 bpp__ID__pf, float bpp__Width__pf, float bpp__Height__pf, const struct FVector& bpp__Offset__pf);
	void SetConditions(bool bpp__ActiveSensor__pf, bool bpp__NoActiveSensor__pf, bool bpp__Damage__pf, bool bpp__DiaDealDamage__pf, bool bpp__ScreenOut__pf);
	void SetNoActiveSensor(int32 bpp__ID__pf, float bpp__Width__pf, float bpp__Height__pf, const struct FVector& bpp__Offset__pf);
	void Update();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OBJ_ActiveSensorControler_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OBJ_ActiveSensorControler_C")
	}
	static class UOBJ_ActiveSensorControler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOBJ_ActiveSensorControler_C>();
	}
};
DUMPER7_ASSERTS_UOBJ_ActiveSensorControler_C;

}

