#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_EnemyInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EPB_EnemyInfoType_structs.hpp"


namespace SDK::Params
{

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.CheckIsCalc
// 0x0002 (0x0002 - 0x0000)
struct OBJ_EnemyInfo_C_CheckIsCalc final
{
public:
	EPB_EnemyInfoType                             bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsShouldCalc__pf;                             // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_CheckIsCalc;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.EnemyAimOffset
// 0x0018 (0x0018 - 0x0000)
struct OBJ_EnemyInfo_C_EnemyAimOffset final
{
public:
	struct FVector                                bpp__OffsetPosition__pf;                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Position__pf;                                 // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_EnemyAimOffset;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.EnemyDist3D
// 0x0004 (0x0004 - 0x0000)
struct OBJ_EnemyInfo_C_EnemyDist3D final
{
public:
	float                                         bpp__Dist__pf;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_EnemyDist3D;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.EnemyDistX
// 0x0004 (0x0004 - 0x0000)
struct OBJ_EnemyInfo_C_EnemyDistX final
{
public:
	float                                         bpp__Dist__pf;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_EnemyDistX;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.EnemyDistZ
// 0x0004 (0x0004 - 0x0000)
struct OBJ_EnemyInfo_C_EnemyDistZ final
{
public:
	float                                         bpp__Dist__pf;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_EnemyDistZ;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.EnemyVector
// 0x000C (0x000C - 0x0000)
struct OBJ_EnemyInfo_C_EnemyVector final
{
public:
	struct FVector                                bpp__Vector__pf;                                   // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_EnemyVector;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.GetBool
// 0x0002 (0x0002 - 0x0000)
struct OBJ_EnemyInfo_C_GetBool final
{
public:
	EPB_EnemyInfoType                             bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_GetBool;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.GetFloat
// 0x0008 (0x0008 - 0x0000)
struct OBJ_EnemyInfo_C_GetFloat final
{
public:
	EPB_EnemyInfoType                             bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Value__pf;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_GetFloat;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.GetInt
// 0x0008 (0x0008 - 0x0000)
struct OBJ_EnemyInfo_C_GetInt final
{
public:
	EPB_EnemyInfoType                             bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__Value__pf;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_GetInt;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.GetVector
// 0x0010 (0x0010 - 0x0000)
struct OBJ_EnemyInfo_C_GetVector final
{
public:
	EPB_EnemyInfoType                             bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__Value__pf;                                    // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_GetVector;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.IsEnemyFront
// 0x0001 (0x0001 - 0x0000)
struct OBJ_EnemyInfo_C_IsEnemyFront final
{
public:
	bool                                          bpp__Vector__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_IsEnemyFront;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.setBool
// 0x0003 (0x0003 - 0x0000)
struct OBJ_EnemyInfo_C_setBool final
{
public:
	EPB_EnemyInfoType                             bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_setBool;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.SetFloat
// 0x000C (0x000C - 0x0000)
struct OBJ_EnemyInfo_C_SetFloat final
{
public:
	EPB_EnemyInfoType                             bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Value__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__return__pf;                                   // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_SetFloat;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.SetInt
// 0x0008 (0x0008 - 0x0000)
struct OBJ_EnemyInfo_C_SetInt final
{
public:
	EPB_EnemyInfoType                             bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bpp__Value__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_SetInt;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.SetVector
// 0x001C (0x001C - 0x0000)
struct OBJ_EnemyInfo_C_SetVector final
{
public:
	EPB_EnemyInfoType                             bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                bpp__Value__pf;                                    // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__return__pf;                                   // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_SetVector;

// Function OBJ_EnemyInfo.OBJ_EnemyInfo_C.Template
// 0x000C (0x000C - 0x0000)
struct OBJ_EnemyInfo_C_Template final
{
public:
	struct FVector                                bpp__Vector__pf;                                   // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_EnemyInfo_C_Template;

}

