#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_CharacterSpeedControler

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Obj_Root_classes.hpp"
#include "EPB_JumpState_structs.hpp"


namespace SDK
{

// DynamicClass OBJ_CharacterSpeedControler.OBJ_CharacterSpeedControler_C
// 0x0098 (0x0138 - 0x00A0)
class UOBJ_CharacterSpeedControler_C : public UOBJ_Root_C
{
public:
	class UCurveFloat*                            MaxSpeedCurve;                                     // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isReverse;                                         // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PrevDir;                                           // 0x00AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsChangeDir;                                       // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                currentDir;                                        // 0x00BC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsRootMotion;                                      // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsReset;                                           // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUp;                                              // 0x00CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GravityTime;                                       // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StepChangeCounter;                                 // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StepChangeCounterForAccel;                         // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StepChangeCounterForToTarget;                      // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default_MinSpeed;                                  // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default_MinSpeedRate;                              // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default_Brake;                                     // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default_BrakeRate;                                 // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default_BrakeRateMinTime;                          // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default_BrakeRateMaxTime;                          // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default_BrakeRateMinValue;                         // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Default_BrakeRateMaxValue;                         // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InitPosition;                                      // 0x00FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFrontSystem;                                     // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsIgnoreChrDirection;                              // 0x0109(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsJumpDown;                                        // 0x010A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10B[0x1];                                      // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PrevPosition;                                      // 0x010C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsReach;                                           // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDisabledChrDirection;                            // 0x0119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Default_BrakePlayerRate;                           // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCeilIgnore;                                      // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       K2Node_Event_ChrIns_OBJ_CharacterSpeedControler_C; // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBStepBase*                            K2Node_Event_StepIns_OBJ_CharacterSpeedControler_C; // 0x0130(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void AccelBase(float bpp__InitSpeed__pf, float bpp__MaxSpeed__pf, float bpp__MaxSpeedRate__pf, float bpp__Accel__pf, float bpp__AccelRate__pf, bool bpp__IsInit__pf, float* bpp__Speed__pf);
	void AccelBaseContinue(float bpp__MaxSpeed__pf, float bpp__MaxSpeedRate__pf, float bpp__Accel__pf, float bpp__AccelRate__pf, float* bpp__Speed__pf);
	void AccelByDistance(float bpp__InitSpeed__pf, float bpp__Accel__pf, float bpp__AccelRate__pf, float bpp__Brake__pf, float bpp__BrakeRate__pf, const struct FVector& bpp__TargetPosition__pf, class UCurveFloat* bpp__MaxSpeedCurve__pf, bool bpp__IsInit__pf, float* bpp__Speed__pf);
	void AccelByDistanceContinue(float bpp__Accel__pf, float bpp__AccelRate__pf, float bpp__Brake__pf, float bpp__BrakeRate__pf, const struct FVector& bpp__TargetPosition__pf, float* bpp__Speed__pf);
	void AccelIida(float bpp__Coefficient__pf, const struct FVector& bpp__BasePosition__pf, const struct FVector& bpp__TargetPosition__pf, float bpp__AccelRate__pf, float bpp__MinSpeed__pf, float bpp__MaxSpeed__pf, float* bpp__Speed__pf);
	void AccelToTargetAbsoluteReach(float bpp__InitSpeed__pf, float bpp__MaxSpeed__pf, float bpp__MaxSpeedRate__pf, float bpp__Accel__pf, float bpp__AccelRate__pf, bool bpp__IsInit__pf, const struct FVector& bpp__TargetPosition__pf, float bpp__BrakeStartDist__pf, float bpp__MinSpeed__pf, float* bpp__Speed__pf, bool* bpp__IsReach__pf);
	void AccelToTargetBase(float bpp__InitSpeed__pf, float bpp__MaxSpeed__pf, float bpp__MaxSpeedRate__pf, float bpp__Accel__pf, float bpp__AccelRate__pf, bool bpp__IsInit__pf, const struct FVector& bpp__TargetPosition__pf, float* bpp__Speed__pf);
	void AccelToTargetBaseEx(float bpp__InitSpeed__pf, float bpp__MaxSpeed__pf, float bpp__MaxSpeedRate__pf, float bpp__Accel__pf, float bpp__AccelRate__pf, float bpp__BrakeBase__pf, float bpp__BrakeRate__pf, bool bpp__IsInit__pf, const struct FVector& bpp__TargetPosition__pf, float* bpp__Speed__pf);
	void AccelToTargetEx3D(float bpp__InitSpeed__pf, class UCurveFloat* bpp__MaxSpeedCurve__pf, float bpp__Accel__pf, float bpp__Brake__pf, const struct FVector& bpp__TargetPosition__pf, float bpp__CheckDist__pf, bool bpp__IsReachSeedZero__pf, float* bpp__Speed__pf, bool* bpp__IsReach__pf);
	void AccelToTargetEx(float bpp__InitSpeed__pf, class UCurveFloat* bpp__MaxSpeedCurve__pf, float bpp__Accel__pf, float bpp__Brake__pf, const struct FVector& bpp__TargetPosition__pf, float bpp__CheckDist__pf, bool bpp__IsReachSeedZero__pf, float* bpp__Speed__pf, bool* bpp__IsReach__pf);
	void AccelToTargetExFromY(float bpp__InitSpeed__pf, class UCurveFloat* bpp__MaxSpeedCurve__pf, float bpp__Accel__pf, float bpp__Brake__pf, const struct FVector& bpp__TargetPosition__pf, float bpp__CheckDist__pf, bool bpp__IsReachSeedZero__pf, float* bpp__Speed__pf, bool* bpp__IsReach__pf);
	void AccelToTargetExOrigin(float bpp__InitSpeed__pf, class UCurveFloat* bpp__MaxSpeedCurve__pf, float bpp__Accel__pf, float bpp__Brake__pf, const struct FVector& bpp__TargetPosition__pf, float bpp__CheckDist__pf, bool bpp__IsReachSeedZero__pf, bool bpp__AxisX__pf, float* bpp__Speed__pf, bool* bpp__IsReach__pf);
	void BrakeBase(float bpp__MinSpeed__pf, float bpp__MinSpeedRate__pf, float bpp__Brake__pf, float bpp__BrakeRate__pf, float* bpp__Speed__pf);
	void CalcSpeed(float bpp__InitSpeed__pf, bool bpp__IsInit__pf, float bpp__DestSpeed__pf, float bpp__DestSpeedRate__pf, float bpp__Accel__pf, float bpp__AccelRate__pf, float bpp__Brake__pf, float bpp__BrakeRate__pf, bool bpp__IsAccelOrBrake__pf, bool* bpp__IsAccel__pf);
	void DefaultBrake();
	void GetAccelByWorld(float bpp__Speed__pf, const struct FVector& bpp__DestPosition__pf, float* bpp__ReturnSpeed__pf);
	void GetCurrentVector(struct FVector* bpp__Direction__pf);
	void GetGravityTime(float* bpp__GravityTime__pf);
	void GetMaxSpeed(const struct FVector& bpp__TargetPosition__pf, float* bpp__return__pf);
	void GetMaxSpeedByXDistance(const struct FVector& bpp__TargetPosition__pf, float* bpp__return__pf);
	void GetSpeed(float* bpp__Speed__pf);
	void GetSpeedDirection(const struct FVector& bpp__TargetPosition__pf, bool* bpp__IsFront__pf);
	void GetTargetDistance(const struct FVector& bpp__BasePosition__pf, const struct FVector& bpp__TargetPosition__pf, float* bpp__Distance__pf);
	void GetTargetDistanceFromSelf(const struct FVector& bpp__TargetPosition__pf, float* bpp__Distance__pf);
	void IsSameDirection(const struct FVector& bpp__DestPosition__pf, bool* bpp__IsSameDirection__pf);
	void ResetJump();
	void SetDefaultBrake(float bpp__MinSpeed__pf, float bpp__MinSpeedRate__pf, float bpp__Brake__pf, float bpp__BrakeRate__pf, float bpp__MinTime__pf, float bpp__MaxTime__pf, float bpp__MinValue__pf, float bpp__MaxValue__pf);
	void SetDefaultBrakePlayerRate(float bpp__BrakeRate__pf, bool* bpp__return__pf);
	void SetGravityTime(float bpp__GravityTime__pf);
	void SetSpeed(float bpp__Speed__pf);
	void SetSpeedSafety(float bpp__Speed__pf, bool bpp__IsIgnoreChrDirection__pf, float* bpp__return__pf);
	void SetSpeedWorld(float bpp__Speed__pf);
	void StartJump();
	void SubSpline(const struct FVector& bpp__Target__pf, const struct FVector& bpp__Base__pf, struct FVector* bpp__Sub__pf);
	void SwapDefaultBrakePlayerRate(class UOBJ_CharacterSpeedControler_C** bpp__Other__pf);
	void System_ConvertSpeedOnDir(bool* bpp__IsChange__pf);
	void System_UpdateDir(bool* bpp__IsChangeDir__pf, struct FVector* bpp__Dir__pf);
	void UpdateJump(float bpp__InitialSpeed__pf, float bpp__MaxSpeed__pf, float bpp__MinSpeed__pf, float bpp__AccelZ__pf, float bpp__AccelZRate__pf, bool bpp__IsTopResetSpeed__pf, bool bpp__IsNotReset__pf, float* bpp__Speed__pf, EPB_JumpState* bpp__Status__pf);
	void UpdateJumpBase(float bpp__InitialSpeed__pf, float bpp__MaxSpeed__pf, float bpp__MinSpeed__pf, float bpp__AccelZ__pf, float bpp__AccelZRate__pf, bool bpp__IsInit__pf, bool bpp__IsTopResetSpeed__pf, float* bpp__Speed__pf, EPB_JumpState* bpp__Status__pf);
	void UpdateJumpContinue(float bpp__MaxSpeed__pf, float bpp__MinSpeed__pf, float bpp__AccelZ__pf, float bpp__AccelZRate__pf, float* bpp__Speed__pf, EPB_JumpState* bpp__Status__pf);
	void UpdateSpeedBase(float bpp__InitSpeed__pf, bool bpp__IsInit__pf, float bpp__DestSpeed__pf, float bpp__DestSpeedRate__pf, float bpp__Accel__pf, float bpp__AccelRate__pf, float bpp__Brake__pf, float bpp__BrakeRate__pf, bool* bpp__IsAccel__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OBJ_CharacterSpeedControler_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OBJ_CharacterSpeedControler_C")
	}
	static class UOBJ_CharacterSpeedControler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOBJ_CharacterSpeedControler_C>();
	}
};
DUMPER7_ASSERTS_UOBJ_CharacterSpeedControler_C;

}

