#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_ExtraParameter

#include "Basic.hpp"


namespace SDK::Params
{

// Function OBJ_ExtraParameter.OBJ_ExtraParameter_C.GetBoolValue
// 0x000C (0x000C - 0x0000)
struct OBJ_ExtraParameter_C_GetBoolValue final
{
public:
	class FName                                   bpp__Key__pf;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Value__pf;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_ExtraParameter_C_GetBoolValue;

// Function OBJ_ExtraParameter.OBJ_ExtraParameter_C.GetFloatValue
// 0x000C (0x000C - 0x0000)
struct OBJ_ExtraParameter_C_GetFloatValue final
{
public:
	class FName                                   bpp__Key__pf;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Value__pf;                                    // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExtraParameter_C_GetFloatValue;

// Function OBJ_ExtraParameter.OBJ_ExtraParameter_C.GetIntValue
// 0x000C (0x000C - 0x0000)
struct OBJ_ExtraParameter_C_GetIntValue final
{
public:
	class FName                                   bpp__Key__pf;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Value__pf;                                    // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExtraParameter_C_GetIntValue;

// Function OBJ_ExtraParameter.OBJ_ExtraParameter_C.GetNameValue
// 0x0010 (0x0010 - 0x0000)
struct OBJ_ExtraParameter_C_GetNameValue final
{
public:
	class FName                                   bpp__Key__pf;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__Value__pf;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ExtraParameter_C_GetNameValue;

}

