#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_KeyInfo

#include "Basic.hpp"

#include "Obj_Root_classes.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK
{

// DynamicClass OBJ_KeyInfo.OBJ_KeyInfo_C
// 0x0030 (0x00D0 - 0x00A0)
class UOBJ_KeyInfo_C final : public UOBJ_Root_C
{
public:
	class APBConfigManager*                       KeyIns;                                            // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 OnTime;                                            // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          IsEffectiveKey;                                    // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BackMove_IsRight;                                  // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       K2Node_Event_ChrIns_OBJ_KeyInfo_C;                 // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBStepBase*                            K2Node_Event_StepIns_OBJ_KeyInfo_C;                // 0x00C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void GetLetGoTime(EPBGameKey bpp__KeyType__pf, float* bpp__Time__pf);
	void IsKey(EPBGameKey bpp__KeyType__pf, bool* bpp__return__pf);
	void ObserveKeyInput();
	void UpdateEffectiveShardKey(bool* bpp__IsKey__pf);
	void UpdateKeyInfo(EPBGameKey bpp__KeyEnum__pf, bool* bpp__IsKey__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OBJ_KeyInfo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OBJ_KeyInfo_C")
	}
	static class UOBJ_KeyInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOBJ_KeyInfo_C>();
	}
};
DUMPER7_ASSERTS_UOBJ_KeyInfo_C;

}

