#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_ActionCheck

#include "Basic.hpp"

#include "ESubSubStep_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ESubStep_structs.hpp"
#include "EPB_AttackNo_structs.hpp"


namespace SDK::Params
{

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Check_Active
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionCheck_C_Check_Active final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Check_Active;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Check_Attack
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionCheck_C_Check_Attack final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Check_Attack;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.CHECK_DAMAGE
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionCheck_C_CHECK_DAMAGE final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_CHECK_DAMAGE;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Check_Dash
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionCheck_C_Check_Dash final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Check_Dash;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Check_Dead
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionCheck_C_Check_Dead final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Check_Dead;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Check_Evasion
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionCheck_C_Check_Evasion final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Check_Evasion;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Check_Fall
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionCheck_C_Check_Fall final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Check_Fall;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Check_Land
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionCheck_C_Check_Land final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Check_Land;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Check_Move
// 0x001C (0x001C - 0x0000)
struct OBJ_ActionCheck_C_Check_Move final
{
public:
	float                                         bpp__MustInitrate__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MustBestRate__pf;                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__DisEnableInitrate__pf;                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__DisEnableBestRate__pf;                        // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsInit__pf;                                   // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsBest__pf;                                   // 0x0012(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Initrate__pf;                                 // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__BestRate__pf;                                 // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Check_Move;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Check_NotActive
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionCheck_C_Check_NotActive final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Check_NotActive;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Check_Template
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionCheck_C_Check_Template final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Check_Template;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Check_Turn
// 0x0010 (0x0010 - 0x0000)
struct OBJ_ActionCheck_C_Check_Turn final
{
public:
	struct FVector                                bpp__Position__pf;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Check_Turn;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Exec_Active
// 0x0005 (0x0005 - 0x0000)
struct OBJ_ActionCheck_C_Exec_Active final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Exec_Active;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Exec_Attack
// 0x0006 (0x0006 - 0x0000)
struct OBJ_ActionCheck_C_Exec_Attack final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_AttackNo                                  bpp__AttackNo__pf;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Exec_Attack;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Exec_Common
// 0x0007 (0x0007 - 0x0000)
struct OBJ_ActionCheck_C_Exec_Common final
{
public:
	bool                                          bpp__IsNotUseDead__pf;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsNotUseDamage__pf;                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsNotUseFall__pf;                             // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsNotUseLand__pf;                             // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsNotUseTurn__pf;                             // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsNotUseNotActive__pf;                        // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Exec_Common;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Exec_Idle
// 0x0009 (0x0009 - 0x0000)
struct OBJ_ActionCheck_C_Exec_Idle final
{
public:
	EStepEntry                                    bpp__ActiveWildCard__pf;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__ActiveMainStep__pf;                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__ActiveSubStep__pf;                            // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__ActiveSubSubStep__pf;                         // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStepEntry                                    bpp__NotActiveWildCard__pf;                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__NotActiveMainStep__pf;                        // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__NotActiveSubStep__pf;                         // 0x0006(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__NotActiveSubSubStep__pf;                      // 0x0007(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Exec_Idle;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Exec_Move
// 0x0018 (0x0018 - 0x0000)
struct OBJ_ActionCheck_C_Exec_Move final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MustInitrate__pf;                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MustBestRate__pf;                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__DisEnableInitrate__pf;                        // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__DisEnableBestRate__pf;                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsInit__pf;                                   // 0x0015(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsBest__pf;                                   // 0x0016(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Exec_Move;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Exec_MoveStop
// 0x0020 (0x0020 - 0x0000)
struct OBJ_ActionCheck_C_Exec_MoveStop final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Duration__pf;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__ReachDist__pf;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MinimumTime__pf;                              // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__DestPosition__pf;                             // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsStopNearEnemy__pf;                          // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x001D(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Exec_MoveStop;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Exec_NotActive
// 0x0005 (0x0005 - 0x0000)
struct OBJ_ActionCheck_C_Exec_NotActive final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Exec_NotActive;

// Function OBJ_ActionCheck.OBJ_ActionCheck_C.Exec_Template
// 0x0005 (0x0005 - 0x0000)
struct OBJ_ActionCheck_C_Exec_Template final
{
public:
	EStepEntry                                    bpp__WildCard__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBStep                                       bpp__MainStep__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubStep                                      bpp__SubStep__pf;                                  // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubSubStep                                   bpp__SubSubStep__pf;                               // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionCheck_C_Exec_Template;

}

