#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJ_ActionRequest

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "EPB_ActionRequestCategory_structs.hpp"


namespace SDK::Params
{

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.ClearActionRequest
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionRequest_C_ClearActionRequest final
{
public:
	EActionRequestEntry                           bpp__ActionRequest__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_ClearActionRequest;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.ClearActionRequests
// 0x000A (0x000A - 0x0000)
struct OBJ_ActionRequest_C_ClearActionRequests final
{
public:
	bool                                          bpp__MoveRequest__pf;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__AttackReuqest__pf;                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__CrouchRequest__pf;                            // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__StepRequest__pf;                              // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__JumpRequest__pf;                              // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__SlidingRequest__pf;                           // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__JumpKickRequest__pf;                          // 0x0006(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__SpecialArts__pf;                              // 0x0007(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ShardRequest__pf;                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Common__pf;                                   // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_ClearActionRequests;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.GetConditionFlag
// 0x0002 (0x0002 - 0x0000)
struct OBJ_ActionRequest_C_GetConditionFlag final
{
public:
	ECharacterMoveFlagID                          bpp__Flag__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_GetConditionFlag;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.GetPastActionRequestTime
// 0x0008 (0x0008 - 0x0000)
struct OBJ_ActionRequest_C_GetPastActionRequestTime final
{
public:
	EActionRequestEntry                           bpp__ActionRequest__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         bpp__Time__pf;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_GetPastActionRequestTime;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.IsActionFlag
// 0x0002 (0x0002 - 0x0000)
struct OBJ_ActionRequest_C_IsActionFlag final
{
public:
	ECharacterActionFlagID                        bpp__ActionFlag__pf;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsRequest__pf;                                // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_IsActionFlag;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.IsActionRequest
// 0x0002 (0x0002 - 0x0000)
struct OBJ_ActionRequest_C_IsActionRequest final
{
public:
	EActionRequestEntry                           bpp__ActionRequest__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsRequest__pf;                                // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_IsActionRequest;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.IsActionRequestAccept
// 0x0002 (0x0002 - 0x0000)
struct OBJ_ActionRequest_C_IsActionRequestAccept final
{
public:
	EActionRequestEntry                           bpp__ActionAccept__pf;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsAccept__pf;                                 // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_IsActionRequestAccept;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.SetActionFlag
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionRequest_C_SetActionFlag final
{
public:
	ECharacterActionFlagID                        bpp__Flag__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_SetActionFlag;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.SetActionFlags
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionRequest_C_SetActionFlags final
{
public:
	bool                                          bpp__Directional__pf;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_SetActionFlags;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.SetActionRequest
// 0x0004 (0x0004 - 0x0000)
struct OBJ_ActionRequest_C_SetActionRequest final
{
public:
	int32                                         bpp__ActionRequestID__pf;                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_SetActionRequest;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.SetActionRequestArray
// 0x0002 (0x0002 - 0x0000)
struct OBJ_ActionRequest_C_SetActionRequestArray final
{
public:
	EActionRequestEntry                           bpp__ActionRequest__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsActive__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_SetActionRequestArray;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.SetCategory
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionRequest_C_SetCategory final
{
public:
	EPB_ActionRequestCategory                     bpp__Category__pf;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_SetCategory;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.SetCategoryEx
// 0x0007 (0x0007 - 0x0000)
struct OBJ_ActionRequest_C_SetCategoryEx final
{
public:
	bool                                          bpp__IsForce__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsAttack__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsMove__pf;                                   // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsStep__pf;                                   // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__isCommon__pf;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsJump__pf;                                   // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsArts__pf;                                   // 0x0006(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_SetCategoryEx;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.SetConditionFlag
// 0x0001 (0x0001 - 0x0000)
struct OBJ_ActionRequest_C_SetConditionFlag final
{
public:
	ECharacterMoveFlagID                          bpp__Flag__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_SetConditionFlag;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.SetConditionFlags
// 0x0003 (0x0003 - 0x0000)
struct OBJ_ActionRequest_C_SetConditionFlags final
{
public:
	bool                                          bpp__Move__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Crouch__pf;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Jump__pf;                                     // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_SetConditionFlags;

// Function OBJ_ActionRequest.OBJ_ActionRequest_C.SetRequestConditions
// 0x001A (0x001A - 0x0000)
struct OBJ_ActionRequest_C_SetRequestConditions final
{
public:
	bool                                          bpp__MoveStart__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__MoveStop__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Attack__pf;                                   // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__CrouchStart__pf;                              // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__CrouchStartTrigger__pf;                       // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__CrouchStop__pf;                               // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ForceCrouch__pf;                              // 0x0006(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Step__pf;                                     // 0x0007(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__JumpStart__pf;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__JumpStop__pf;                                 // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__SlidingJump__pf;                              // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__DiveKick__pf;                                 // 0x000B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__TriggerShard__pf;                             // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__EffectiveShard__pf;                           // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__DirectiveShard__pf;                           // 0x000E(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__DirectiveShardStop__pf;                       // 0x000F(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ReversalShard__pf;                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ReflectionShard__pf;                          // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__SpecialPose__pf;                              // 0x0012(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__SpecialPoseStop__pf;                          // 0x0013(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__SitDown__pf;                                  // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ReadABook__pf;                                // 0x0015(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ForceReverse__pf;                             // 0x0016(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__SpecialArts__pf;                              // 0x0017(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__DebugPause__pf;                               // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__StandUp__pf;                                  // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OBJ_ActionRequest_C_SetRequestConditions;

}

