#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJEX_MagicCircleManager

#include "Basic.hpp"

#include "Obj_Root_classes.hpp"
#include "EPB_MagicCircleType_structs.hpp"


namespace SDK
{

// DynamicClass OBJEX_MagicCircleManager.OBJEX_MagicCircleManager_C
// 0x0088 (0x0128 - 0x00A0)
class UOBJEX_MagicCircleManager_C final : public UOBJ_Root_C
{
public:
	TMap<class FName, int32>                      ManageId;                                          // 0x00A0(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class APBBP_MagicCircle_C*>            MagicCircleBuffer;                                 // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class APBBulletActor*>                 BulletBuffer;                                      // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       K2Node_Event_ChrIns_OBJEX_MagicCircleManager_C;    // 0x0118(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBStepBase*                            K2Node_Event_StepIns_OBJEX_MagicCircleManager_C;   // 0x0120(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void EndMagicCircle(class FName bpp__RegisterID__pf, float bpp__Duration__pf, bool bpp__IsKillNow__pf, bool* bpp__Value__pf);
	void EndMagicCircleDuration(class FName bpp__RegisterID__pf, float bpp__Duration__pf, bool* bpp__Value__pf);
	void SpawnMagicCircle(class FName bpp__RegisterID__pf, bool* bpp__IsSpawn__pf, class APBBP_MagicCircle_C** bpp__MagicCircleInstance__pf);
	void StartMagicCircle(class FName bpp__RegisterID__pf, const struct FTransform& bpp__WorldTransform__pf, float bpp__TimeScale__pf, EPB_MagicCircleType bpp__MagicCircleType__pf, bool bpp__IsEnoch__pf, bool bpp__IsHigher__pf, bool bpp__IsDepth__pf, bool bpp__IsUseLight__pf, float bpp__Duration__pf, bool* bpp__IsSpawn__pf, class APBBP_MagicCircle_C** bpp__CircleIns__pf);
	void StartMagicCircleEx(const struct FVector& bpp__SpawnWorldLocation__pf, const struct FVector& bpp__WorldRotateVector__pf, const struct FVector& bpp__WorldScale__pf, float bpp__TimeScale__pf, EPB_MagicCircleType bpp__MagicCircleType__pf, bool bpp__IsEnoch__pf, bool bpp__IsHigher__pf, bool bpp__IsDepth__pf, float bpp__Duration__pf, class FName* bpp__RegisterKey__pf, class APBBP_MagicCircle_C** bpp__MagicCircleEffect__pf);
	void UpdateMagicCircleLocation(class FName bpp__RegisterID__pf, const struct FVector& bpp__WorldLocation__pf, bool* bpp__return__pf);
	void UpdateMagicCircleRotation(class FName bpp__RegisterID__pf, const struct FVector& bpp__DirectionVector__pf, bool* bpp__return__pf);
	void UpdateMagicCircleTransform(class FName bpp__RegisterID__pf, const struct FTransform& bpp__WorldTransform__pf, bool* bpp__return__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OBJEX_MagicCircleManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OBJEX_MagicCircleManager_C")
	}
	static class UOBJEX_MagicCircleManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOBJEX_MagicCircleManager_C>();
	}
};
DUMPER7_ASSERTS_UOBJEX_MagicCircleManager_C;

}

