#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OBJP_ReflectionControler

#include "Basic.hpp"

#include "EPB_ReflectionEndLocationType_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_ReflectionData_structs.hpp"
#include "Obj_Root_classes.hpp"


namespace SDK
{

// DynamicClass OBJP_ReflectionControler.OBJP_ReflectionControler_C
// 0x0098 (0x0138 - 0x00A0)
class UOBJP_ReflectionControler_C final : public UOBJ_Root_C
{
public:
	float                                         CupsleMinimumSize;                                 // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APBE_ReflectionLine_C*                  Reflectionray;                                     // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABP_ReflectionTrail_C*                  ReflectionTrail;                                   // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsRecasting;                                       // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RecastNeedTime;                                    // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RecastStartTime;                                   // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RecastLineLengthRate;                              // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            RecastAncorCurve;                                  // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            RecastLineCurve;                                   // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEnableReflection;                                // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPrevDraw;                                        // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DrawStartTime;                                     // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DrawLength;                                        // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DrawStartLength;                                   // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 DrawPrevMovementMode;                              // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            RecastRate;                                        // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPowerMantan;                                     // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsMantanHyougen;                                   // 0x00F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MantanTime;                                        // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            RecastFinishTime;                                  // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEnableFly;                                       // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DrawFrame;                                         // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_ReflectionEndLocationType                 AnimType;                                          // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDistance;                                       // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FST_ReflectionData>             ReflectionData;                                    // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class APBBaseCharacter*                       K2Node_Event_ChrIns_OBJP_ReflectionControler_C;    // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPBStepBase*                            K2Node_Event_StepIns_OBJP_ReflectionControler_C;   // 0x0130(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void AdjustHitLocation(const struct FVector& bpp__HitLocation__pf, const struct FVector& bpp__StartLocation__pf, const struct FVector& bpp__Direction__pf, float bpp__SafeLength__pf, struct FVector* bpp__AdjustedLocation__pf, struct FVector* bpp__AdjustedDiff__pf, struct FVector* bpp__AdjustedDirection__pf, float* bpp__AdjustedLength__pf);
	void CheckEnableReflectionRay(const struct FVector& bpp__StartWorldLocation__pf, bool* bpp__Enable__pf);
	void CheckOutRoom(const struct FVector& bpp__StartSplineLocation__pf, const struct FVector& bpp__TargetSplineLocation__pf, bool* bpp__IsFinish__pf, struct FVector* bpp__CorrectSplineLocation__pf);
	void CheckRecasting(const struct FVector& bpp__StartWorldLocation__pf, bool* bpp__IsEnable__pf);
	void CheckReflectionData(TArray<struct FST_ReflectionData>* bpp__RefReflectionData__pf, bool* bpp__IsValid__pf, TArray<struct FST_ReflectionData>* bpp__ReturnData__pf, EPB_ReflectionEndLocationType* bpp__AnimType__pf);
	void CheckReflectionEndLocationType(const struct FVector& bpp__TargetLocation__pf, EPB_ReflectionEndLocationType* bpp__EndType__pf, struct FVector* bpp__CorrectedLocation__pf);
	void DrawLine(const struct FVector& bpp__StartSplineLocation__pf, const struct FVector& bpp__DirectionVector__pf, int32 bpp__ReflectionCount__pf, bool bpp__IsForceMax__pf, bool bpp__IsForceNotUse__pf, TArray<struct FST_ReflectionData>* bpp__Datas__pf);
	void GetMirrorVector(const struct FVector& bpp__FVector__pf, const struct FVector& bpp__NVector__pf, struct FVector* bpp__RVector__pf);
	void GetReflectionPoint(const struct FVector& bpp__StartSplineLocation__pf, const struct FVector& bpp__DirectionUnitVector__pf, int32 bpp__ReflectCount__pf, float bpp__MaxDistance__pf, TArray<struct FST_ReflectionData>* bpp__ReflectionData__pf);
	void InitializeData(class APBE_ReflectionLine_C* bpp__ReflectionIns__pf);
	void SetAllLineReady();
	void SetAllLineVisibleOff();
	void SetExecuteReflectionRay(bool* bpp__return__pf);
	void SetLineEmissive(float bpp__EmissiveValue__pf);
	void SetMaxDistance(float bpp__MaxDistance__pf, bool* bpp__return__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OBJP_ReflectionControler_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OBJP_ReflectionControler_C")
	}
	static class UOBJP_ReflectionControler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOBJP_ReflectionControler_C>();
	}
};
DUMPER7_ASSERTS_UOBJP_ReflectionControler_C;

}

