#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OneButtonPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PopupParam_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass 1ButtonPopup.1ButtonPopup_C
// 0x00D0 (0x0348 - 0x0278)
class UOneButtonPopup_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Close;                                             // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 back;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonPopupButton_C*                   Button01;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PopupText;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPopupParam                            Param;                                             // 0x02A8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   text;                                              // 0x02E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 DecideSE;                                          // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventPopupOpend;                                   // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventPopupClosed;                                  // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Btn01Text;                                         // 0x0330(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_1ButtonPopup(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void WidgetAnimationEvt_close_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_open_K2Node_WidgetAnimationEvent_0();
	void Initialize();
	void OnActive(bool skipViewportCheck, int32* return_0);
	void GetButton(int32 Index_0, class UCommonPopupButton_C** Output);
	void GetPopupReturn(bool skipViewportCheck, int32* Value);
	void ClosePopup();
	void OpenPopup();
	void SetPopupParam(const class FText& input_text, const struct FPopupParam& input_param);
	void SetPopupText(const class FText& Input);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("1ButtonPopup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"1ButtonPopup_C")
	}
	static class UOneButtonPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOneButtonPopup_C>();
	}
};
DUMPER7_ASSERTS_UOneButtonPopup_C;

}

