#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OneButtonPopup

#include "Basic.hpp"

#include "PopupParam_structs.hpp"


namespace SDK::Params
{

// Function 1ButtonPopup.1ButtonPopup_C.ExecuteUbergraph_1ButtonPopup
// 0x0008 (0x0008 - 0x0000)
struct OneButtonPopup_C_ExecuteUbergraph_1ButtonPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OneButtonPopup_C_ExecuteUbergraph_1ButtonPopup;

// Function 1ButtonPopup.1ButtonPopup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct OneButtonPopup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OneButtonPopup_C_PreConstruct;

// Function 1ButtonPopup.1ButtonPopup_C.Initialize
// 0x0040 (0x0040 - 0x0000)
struct OneButtonPopup_C_Initialize final
{
public:
	class UCommonPopupButton_C*                   CallFunc_GetButton_Output;                         // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBStringManager*                       CallFunc_GetStringManager_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringFromKey_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OneButtonPopup_C_Initialize;

// Function 1ButtonPopup.1ButtonPopup_C.OnActive
// 0x000C (0x000C - 0x0000)
struct OneButtonPopup_C_OnActive final
{
public:
	bool                                          skipViewportCheck;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         return_0;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelectDecide_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OneButtonPopup_C_OnActive;

// Function 1ButtonPopup.1ButtonPopup_C.GetButton
// 0x0018 (0x0018 - 0x0000)
struct OneButtonPopup_C_GetButton final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonPopupButton_C*                   Output;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OneButtonPopup_C_GetButton;

// Function 1ButtonPopup.1ButtonPopup_C.GetPopupReturn
// 0x0010 (0x0010 - 0x0000)
struct OneButtonPopup_C_GetPopupReturn final
{
public:
	bool                                          skipViewportCheck;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_OnActive_Return;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OneButtonPopup_C_GetPopupReturn;

// Function 1ButtonPopup.1ButtonPopup_C.ClosePopup
// 0x0008 (0x0008 - 0x0000)
struct OneButtonPopup_C_ClosePopup final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OneButtonPopup_C_ClosePopup;

// Function 1ButtonPopup.1ButtonPopup_C.OpenPopup
// 0x0008 (0x0008 - 0x0000)
struct OneButtonPopup_C_OpenPopup final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OneButtonPopup_C_OpenPopup;

// Function 1ButtonPopup.1ButtonPopup_C.SetPopupParam
// 0x0070 (0x0070 - 0x0000)
struct OneButtonPopup_C_SetPopupParam final
{
public:
	class FText                                   input_text;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPopupParam                            input_param;                                       // 0x0018(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FText                                   txt;                                               // 0x0058(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_OneButtonPopup_C_SetPopupParam;

// Function 1ButtonPopup.1ButtonPopup_C.SetPopupText
// 0x0018 (0x0018 - 0x0000)
struct OneButtonPopup_C_SetPopupText final
{
public:
	class FText                                   Input;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_OneButtonPopup_C_SetPopupText;

}

