#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PB_MagicCircleInfo

#include "Basic.hpp"

#include "EPB_MagicCircleType_structs.hpp"


namespace SDK
{

// ScriptStruct PB_MagicCircleInfo.PB_MagicCircleInfo
// 0x0018 (0x0018 - 0x0000)
struct FPB_MagicCircleInfo final
{
public:
	EPB_MagicCircleType                           Type_41_77175FEA45836E29DA6157A56829987C;          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsHigher_42_6330B80C457F5A094D533EA99BFD619C;      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEnoch_43_8A9599A14B6F50BBFDAD8086DC5FD845;       // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDepth_44_F41E21CD4C9979496CB412AACF5C5D7E;       // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUseLight_45_44CF380440AF749E4B6021B7F5635966;    // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scale_46_9B93B09342FF81A54A39B0B872704D5A;         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeDilation_48_4E0FDA4848E5E29F0A982283A1FA3AB2;  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration_49_6546C8D74BAEA068279AF6879D5F995D;      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LaunchTime_51_C9D2EFC44A55826F6F296AAC41C515F8;    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPB_MagicCircleInfo;

}

