#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBBronzeTreasureBox_BP

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "FStruct_TreasureBox_structs.hpp"
#include "InteractableBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// DynamicClass PBBronzeTreasureBox_BP.PBBronzeTreasureBox_BP_C
// 0x00E8 (0x0798 - 0x06B0)
class APBBronzeTreasureBox_BP_C : public AInteractableBase_C
{
public:
	class UPBEffectSourceComponent*               DropItemPoint;                                     // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFStruct_TreasureBox                   TreasureBox;                                       // 0x06C0(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   DropItemID;                                        // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EffectOffsetZ;                                     // 0x06F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EffectOffsetY;                                     // 0x06FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EffectOffsetX;                                     // 0x0700(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_704[0x4];                                      // 0x0704(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnChestOpened;                                     // 0x0708(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	EPBEventIntArray                              WallBreaked;                                       // 0x0718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsVisible;                                         // 0x0719(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsEquipTutorial;                                   // 0x071A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71B[0x5];                                      // 0x071B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBDroppedItem>                 DroppedItems;                                      // 0x0720(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UPBEventAnimInstance*                   ABP;                                               // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsRegistered;                                      // 0x0738(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                K2Node_Event_EndPlayReason_PBBronzeTreasureBox_BP_C; // 0x0739(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_73A[0x2];                                      // 0x073A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds_PBBronzeTreasureBox_BP_C; // 0x073C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0740(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0741(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_742[0x6];                                      // 0x0742(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APBEventListenerManager*                K2Node_Event_eventManager;                         // 0x0748(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   K2Node_Event_eventKey;                             // 0x0750(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   K2Node_Event_eventSubKey;                          // 0x0758(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                K2Node_Event_eventSender;                          // 0x0760(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0768(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_769[0x7];                                      // 0x0769(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBET_InteractInfo                     K2Node_Event_InteractCharacter;                    // 0x0770(0x0010)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	class UPBEventAnimInstance*                   K2Node_DynamicCast_AsAPB_Treasure_Box;             // 0x0780(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0788(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_SetAnimStep_retrun;                       // 0x0789(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CallFunc_CheckDelete_IsDelete;                     // 0x078A(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78B[0x5];                                      // 0x078B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       K2Node_CustomEvent_Character;                      // 0x0790(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void CheckDelete(bool* bpp__IsDelete__pf);
	void GetDroppedItems(TArray<struct FPBDroppedItem>* bpp__DroppedItem__pf);
	void IsNoHidden(bool* bpp__Visible__pf);
	void NetworkReplicateOpenChest(class APBBaseCharacter* bpp__character__pf);
	void NotifyToMap();
	void OnReceiveEvent(class APBEventListenerManager* bpp__eventManager__pf, class FName bpp__eventKey__pf, class FName bpp__eventSubKey__pf, class UObject* bpp__eventSender__pf);
	void OpenTreasureBox(bool bpp__NetworkSimulated__pf);
	void ReceiveBeginPlay();
	void RevealEvent();
	void SetAnimStep(int32 bpp__Step__pf, bool* bpp__retrun__pf);
	void SetMaterial();
	void SetVisible(bool bpp__Visible__pf);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PBBronzeTreasureBox_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PBBronzeTreasureBox_BP_C")
	}
	static class APBBronzeTreasureBox_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBBronzeTreasureBox_BP_C>();
	}
};
DUMPER7_ASSERTS_APBBronzeTreasureBox_BP_C;

}

