#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBBronzeTreasureBox_BP

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function PBBronzeTreasureBox_BP.PBBronzeTreasureBox_BP_C.CheckDelete
// 0x0001 (0x0001 - 0x0000)
struct PBBronzeTreasureBox_BP_C_CheckDelete final
{
public:
	bool                                          bpp__IsDelete__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBBronzeTreasureBox_BP_C_CheckDelete;

// Function PBBronzeTreasureBox_BP.PBBronzeTreasureBox_BP_C.GetDroppedItems
// 0x0010 (0x0010 - 0x0000)
struct PBBronzeTreasureBox_BP_C_GetDroppedItems final
{
public:
	TArray<struct FPBDroppedItem>                 bpp__DroppedItem__pf;                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBBronzeTreasureBox_BP_C_GetDroppedItems;

// Function PBBronzeTreasureBox_BP.PBBronzeTreasureBox_BP_C.IsNoHidden
// 0x0001 (0x0001 - 0x0000)
struct PBBronzeTreasureBox_BP_C_IsNoHidden final
{
public:
	bool                                          bpp__Visible__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBBronzeTreasureBox_BP_C_IsNoHidden;

// Function PBBronzeTreasureBox_BP.PBBronzeTreasureBox_BP_C.NetworkReplicateOpenChest
// 0x0008 (0x0008 - 0x0000)
struct PBBronzeTreasureBox_BP_C_NetworkReplicateOpenChest final
{
public:
	class APBBaseCharacter*                       bpp__character__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBBronzeTreasureBox_BP_C_NetworkReplicateOpenChest;

// Function PBBronzeTreasureBox_BP.PBBronzeTreasureBox_BP_C.OnReceiveEvent
// 0x0020 (0x0020 - 0x0000)
struct PBBronzeTreasureBox_BP_C_OnReceiveEvent final
{
public:
	class APBEventListenerManager*                bpp__eventManager__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__eventKey__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__eventSubKey__pf;                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__eventSender__pf;                              // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBBronzeTreasureBox_BP_C_OnReceiveEvent;

// Function PBBronzeTreasureBox_BP.PBBronzeTreasureBox_BP_C.OpenTreasureBox
// 0x0001 (0x0001 - 0x0000)
struct PBBronzeTreasureBox_BP_C_OpenTreasureBox final
{
public:
	bool                                          bpp__NetworkSimulated__pf;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBBronzeTreasureBox_BP_C_OpenTreasureBox;

// Function PBBronzeTreasureBox_BP.PBBronzeTreasureBox_BP_C.SetAnimStep
// 0x0008 (0x0008 - 0x0000)
struct PBBronzeTreasureBox_BP_C_SetAnimStep final
{
public:
	int32                                         bpp__Step__pf;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__retrun__pf;                                   // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PBBronzeTreasureBox_BP_C_SetAnimStep;

// Function PBBronzeTreasureBox_BP.PBBronzeTreasureBox_BP_C.SetVisible
// 0x0001 (0x0001 - 0x0000)
struct PBBronzeTreasureBox_BP_C_SetVisible final
{
public:
	bool                                          bpp__Visible__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBBronzeTreasureBox_BP_C_SetVisible;

}

