#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBGameMode_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBGameMode_BP.PBGameMode_BP_C
// 0x0108 (0x0698 - 0x0590)
class APBGameMode_BP_C final : public APBGameMode
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPBExtraModeInfo_BP_C*                  PBExtraModeInfo_BP;                                // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AB_COM_FogControl_C*>            CurrentFogControll;                                // 0x05A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	class ABP_ScriptInterpreter_C*                DialogScriptInterpreter;                           // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class AActor*>              CaptureActors;                                     // 0x05C0(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FLinearColor                           DefaultCharaFresnelColor;                          // 0x0610(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultCharaLightVector;                           // 0x0620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultCharaFaceLightVector;                       // 0x0630(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultCharaEmissive;                              // 0x0640(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultFogColor;                                   // 0x0650(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            GameOverWidget;                                    // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CustomResultWidget;                                // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   BossRushWidget;                                    // 0x0670(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PBGameMode_BP(int32 EntryPoint);
	void ToRandomizerResults();
	void OnLoadGameCompletely();
	void OnGameOverStepChanged(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep);
	void ToTopMenu();
	void OnGameOver();
	void RegisterCaptureActor(class FName SpeakerId, class AActor* Actor);
	void ReceiveBeginPlay();
	void OnLoaded_E239AF0448F27090905210A76C781A73(class UClass* Loaded);
	void SetCurrentFogControll(class AB_COM_FogControl_C* FogControll, bool Push);
	void IsCurrentFogControll(class AB_COM_FogControl_C* FogControll, bool* IsCurrent);
	class UPBExtraModeInfo* GetExtraModeInfo();
	void RemoveFogControll(class AB_COM_FogControl_C* FogControl);
	void SetupRetryAfterGameOver();
	void IsBossRush(bool* Out);
	void IsRandomizerGebelOnly(bool* Out);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PBGameMode_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PBGameMode_BP_C")
	}
	static class APBGameMode_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBGameMode_BP_C>();
	}
};
DUMPER7_ASSERTS_APBGameMode_BP_C;

}

