#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBSaveBox_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function PBSaveBox_BP.PBSaveBox_BP_C.Activate
// 0x0008 (0x0008 - 0x0000)
struct PBSaveBox_BP_C_Activate final
{
public:
	class APBBaseCharacter*                       bpp__PlayerToSit__pf;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBSaveBox_BP_C_Activate;

// Function PBSaveBox_BP.PBSaveBox_BP_C.OnPopupClosedWithResult
// 0x0001 (0x0001 - 0x0000)
struct PBSaveBox_BP_C_OnPopupClosedWithResult final
{
public:
	bool                                          bpp__DidSaveGame__pf;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBSaveBox_BP_C_OnPopupClosedWithResult;

// Function PBSaveBox_BP.PBSaveBox_BP_C.OnReceiveEvent
// 0x0020 (0x0020 - 0x0000)
struct PBSaveBox_BP_C_OnReceiveEvent final
{
public:
	class APBEventListenerManager*                bpp__eventManager__pf;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__eventKey__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__eventSubKey__pf;                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__eventSender__pf;                              // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBSaveBox_BP_C_OnReceiveEvent;

// Function PBSaveBox_BP.PBSaveBox_BP_C.SetSavepopupExclusion
// 0x0001 (0x0001 - 0x0000)
struct PBSaveBox_BP_C_SetSavepopupExclusion final
{
public:
	bool                                          bpp__IsExclude__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBSaveBox_BP_C_SetSavepopupExclusion;

// Function PBSaveBox_BP.PBSaveBox_BP_C.SetYesNoWidgetVisible
// 0x0001 (0x0001 - 0x0000)
struct PBSaveBox_BP_C_SetYesNoWidgetVisible final
{
public:
	bool                                          bpp__IsVisible__pf;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PBSaveBox_BP_C_SetYesNoWidgetVisible;

}

