#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBST_CharacterBehavior

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct PBST_CharacterBehavior.PBST_CharacterBehavior
// 0x0014 (0x0014 - 0x0000)
struct FPBST_CharacterBehavior final
{
public:
	EPBStep                                       Step_9_10BAB2A8482D884C0B8B4B9A2F9363B4;           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovementMode                                 Movement_13_C9B856684594E2896F2F19A5A4510BDB;      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Timer_2_766A9C2D45925E1CF45F4381D632F642;          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location_5_0A34B65B43E7C310614C268CE1ECFB08;       // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPBST_CharacterBehavior;

}

