#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBST_ChrExtraParameter

#include "Basic.hpp"

#include "EPB_ParameterType_structs.hpp"


namespace SDK
{

// ScriptStruct PBST_ChrExtraParameter.PBST_ChrExtraParameter
// 0x0020 (0x0020 - 0x0000)
struct FPBST_ChrExtraParameter final
{
public:
	class FName                                   ChrID_15_5AA099574F13CCF8A72CDABE7157065B;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Key_23_6EE044F94E1E250685AAAA9391BC8CE0;           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_ParameterType                             Type_20_E4A8171441A346DFEB31DE81D51998C8;          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Parameter_9_0B39D81647F3494D2F2E929278DD9ABF;      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NameValue_24_7597D4214A07C3B7CDCC4CA756A6B15D;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPBST_ChrExtraParameter;

}

