#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBST_N1006_RayStartPosition

#include "Basic.hpp"

#include "EPB_N1006_BossArea_structs.hpp"


namespace SDK
{

// ScriptStruct PBST_N1006_RayStartPosition.PBST_N1006_RayStartPosition
// 0x0020 (0x0020 - 0x0000)
struct FPBST_N1006_RayStartPosition final
{
public:
	EPB_N1006_BOSSAREA                            Area_2_AD71F1744F5D4CE73B3A0CA859322EB1;           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_N1006_BOSSAREA                            DestArea_21_6D7D1A544353F82E08EA0084478E7761;      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartPositionX_7_15731BA147AC1D08CC65F5A43C507DCC; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartPositionY_9_7ACE9B2C4BF504B91663AFB83B331CB7; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartPositionZ_11_4268114F45E739F638EA2590429487BF; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length_15_45AA70A14C013017FAE6C48A5C33FAAD;        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAttack_18_F67BC7604742062372B8DC93B067E558;      // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DebugString_24_0A49E90C4F3403A71781A39FD84C0441;   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPBST_N1006_RayStartPosition;

}

