#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBST_PathFindPointData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EPB_PathFindActionType_structs.hpp"


namespace SDK
{

// ScriptStruct PBST_PathFindPointData.PBST_PathFindPointData
// 0x0028 (0x0028 - 0x0000)
struct FPBST_PathFindPointData final
{
public:
	int32                                         Index_6_4230BBCA458FACB2B96996B096298B19;          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position_7_6DC14F1044C77F3267CF998408BF24E0;       // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_PathFindActionType                        ActionType_8_CDBD91924394646D03E0EABEE739F278;     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ConnectList_13_3C7FDE5848E9CADBA823EFA243904788;   // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPBST_PathFindPointData;

}

