#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBST_N1005RequestQueue

#include "Basic.hpp"

#include "EPB_N1005_CoopActionList_structs.hpp"
#include "EPB_N1005_ActionList_structs.hpp"


namespace SDK
{

// ScriptStruct PBST_N1005RequestQueue.PBST_N1005RequestQueue
// 0x0048 (0x0048 - 0x0000)
struct FPBST_N1005RequestQueue final
{
public:
	bool                                          IsMatch_30_C4A73B4B41F9D3FCE244768B76CD8C22;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_N1005_CoopActionList                      CoopType_28_A72780E140BFFBD6908A40B67AFFAC23;      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_N1005_ActionList                          MaleRequest_11_F0D95C40443D1DF8EB93988F3B9281A9;   // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaleFloatInfo_14_59FA707B413EAC53A7EFD38DCF959B7A; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaleFireTime_33_04583A864EE298E786772FB75F723D27;  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaleMoveDist_40_9282821440371AF71AF30CA9E8977CAE;  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 MaleFireAngle_47_305B7F794B9451F35A5B2DBDE8515E36; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          MaleIsFireAim_50_F00A991C48F9FED59D633DB9ADDEBB3A; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPB_N1005_ActionList                          FemaleRequest_20_58B35B4B4CD5C6151688D697ADAD83D0; // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FemaleFloatInfo_21_D4ACB24447B20664A6236DB16B1D0656; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FemaleFireTime_35_1A1321264EAE910A7413CAA5C453EAA4; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FemaleMoveDist_42_3814F98444F83D0270D09088B9E1909E; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 FemaleFireAngle_48_EE10AA5248DF68B01914709A1615CC19; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          FemaleIsFireAim_52_EC40FBF247916968FF30ECAE7ACD7F42; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPBST_N1005RequestQueue;

}

