#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBSubCharacterMovementParameter

#include "Basic.hpp"

#include "PBSubCharacterMovementType_structs.hpp"


namespace SDK
{

// ScriptStruct PBSubCharacterMovementParameter.PBSubCharacterMovementParameter
// 0x0020 (0x0020 - 0x0000)
struct FPBSubCharacterMovementParameter final
{
public:
	EPBSubCharacterMovementType                   Motion_34_444A150448B71B9633143297A6C5C071;        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Lifetime_59_92DE22EC412C815CA0C6B1B7535A2068;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         float1_66_E179610F47FC56485B92F3B98AAF5753;        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         float2_67_A0ACAD2C455807B1ED6459BC1A79B186;        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         float3_68_25F19E3341029932D3DCCAA844F2F67C;        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         float4_69_6FAA88364409B50E5216BDA852AA5C97;        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag_72_AE4813A74DDD6FC1D7F0C79AF78526CA;           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPBSubCharacterMovementParameter;

}

