#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBTitleGameModeBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PBTitleGameModeBP.PBTitleGameModeBP_C
// 0x0040 (0x05B8 - 0x0578)
class APBTitleGameModeBP_C final : public APBTitleGameMode
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   PlayerLoggedIn;                                    // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UChaosMode_JoiningPlayer_C*             JoinWidget;                                        // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   PlayerLoggedOut;                                   // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bRemotePlayerOnlineInitializeCalled;               // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInOnlineHostedMap;                                // 0x05B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PBTitleGameModeBP(int32 EntryPoint);
	void HandleNetworkError();
	void K2_OnLogout(class AController* ExitingController);
	void K2_PostLogin(class APlayerController* NewPlayer);
	void PlayerJoinedIn(const struct FUniqueNetIdRepl& UniqueId, const class FString& Options);
	void PlayerOnlineInitialize(class AController* Controller);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PBTitleGameModeBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PBTitleGameModeBP_C")
	}
	static class APBTitleGameModeBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APBTitleGameModeBP_C>();
	}
};
DUMPER7_ASSERTS_APBTitleGameModeBP_C;

}

