#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PL_state

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function PL_state.PL_state_C.ExecuteUbergraph_PL_state_2
// 0x0004 (0x0004 - 0x0000)
struct PL_state_C_ExecuteUbergraph_PL_state_2 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_ExecuteUbergraph_PL_state_2;

// Function PL_state.PL_state_C.GaugeUpdateEvent_Event
// 0x0002 (0x0002 - 0x0000)
struct PL_state_C_GaugeUpdateEvent_Event final
{
public:
	EPBUIGaugeEvent                               bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__imm__pf;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_GaugeUpdateEvent_Event;

// Function PL_state.PL_state_C.GetHPGaugeMoveFlag
// 0x0001 (0x0001 - 0x0000)
struct PL_state_C_GetHPGaugeMoveFlag final
{
public:
	bool                                          bpp__Flag__pf;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_GetHPGaugeMoveFlag;

// Function PL_state.PL_state_C.GetHPPercentage
// 0x0004 (0x0004 - 0x0000)
struct PL_state_C_GetHPPercentage final
{
public:
	float                                         bpp__percent__pf;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_GetHPPercentage;

// Function PL_state.PL_state_C.GetMPGaugeMoveFlag
// 0x0001 (0x0001 - 0x0000)
struct PL_state_C_GetMPGaugeMoveFlag final
{
public:
	bool                                          bpp__Flag__pf;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_GetMPGaugeMoveFlag;

// Function PL_state.PL_state_C.GetMPPercentage
// 0x0004 (0x0004 - 0x0000)
struct PL_state_C_GetMPPercentage final
{
public:
	float                                         bpp__percent__pf;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_GetMPPercentage;

// Function PL_state.PL_state_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct PL_state_C_Initialize final
{
public:
	float                                         bpp__HP__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MaxHP__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MP__pf;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MaxMP__pf;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_Initialize;

// Function PL_state.PL_state_C.InitializeHP
// 0x0008 (0x0008 - 0x0000)
struct PL_state_C_InitializeHP final
{
public:
	float                                         bpp__Now__pf;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Max__pf;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_InitializeHP;

// Function PL_state.PL_state_C.InitializeMP
// 0x0008 (0x0008 - 0x0000)
struct PL_state_C_InitializeMP final
{
public:
	float                                         bpp__Now__pf;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Max__pf;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_InitializeMP;

// Function PL_state.PL_state_C.IsBuffAtk
// 0x0001 (0x0001 - 0x0000)
struct PL_state_C_IsBuffAtk final
{
public:
	bool                                          bpp__bReturnBuffAtk__pf;                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_IsBuffAtk;

// Function PL_state.PL_state_C.IsBuffCON
// 0x0001 (0x0001 - 0x0000)
struct PL_state_C_IsBuffCON final
{
public:
	bool                                          bpp__bReturnBuffCON__pf;                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_IsBuffCON;

// Function PL_state.PL_state_C.IsBuffDEF
// 0x0001 (0x0001 - 0x0000)
struct PL_state_C_IsBuffDEF final
{
public:
	bool                                          bpp__bReturnBuffDEF__pf;                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_IsBuffDEF;

// Function PL_state.PL_state_C.IsBuffINT
// 0x0001 (0x0001 - 0x0000)
struct PL_state_C_IsBuffINT final
{
public:
	bool                                          bpp__bReturnBuffINT__pf;                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_IsBuffINT;

// Function PL_state.PL_state_C.IsBuffLCK
// 0x0001 (0x0001 - 0x0000)
struct PL_state_C_IsBuffLCK final
{
public:
	bool                                          bpp__bReturnBuffLCK__pf;                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_IsBuffLCK;

// Function PL_state.PL_state_C.IsBuffMND
// 0x0001 (0x0001 - 0x0000)
struct PL_state_C_IsBuffMND final
{
public:
	bool                                          bpp__bReturnBuffMND__pf;                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_IsBuffMND;

// Function PL_state.PL_state_C.IsBuffSTR
// 0x0001 (0x0001 - 0x0000)
struct PL_state_C_IsBuffSTR final
{
public:
	bool                                          bpp__bReturnBuffSTR__pf;                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_IsBuffSTR;

// Function PL_state.PL_state_C.NumberBreak
// 0x000C (0x000C - 0x0000)
struct PL_state_C_NumberBreak final
{
public:
	int32                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Digit__pf;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Result__pf;                                   // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_NumberBreak;

// Function PL_state.PL_state_C.PauseGameEvent
// 0x0001 (0x0001 - 0x0000)
struct PL_state_C_PauseGameEvent final
{
public:
	bool                                          bpp__pauseOn__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_PauseGameEvent;

// Function PL_state.PL_state_C.PlusorMinus
// 0x000C (0x000C - 0x0000)
struct PL_state_C_PlusorMinus final
{
public:
	float                                         bpp__Data__pf;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Current__pf;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__out__pf;                                      // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_PlusorMinus;

// Function PL_state.PL_state_C.ReceiveGaugeUpdateEvent
// 0x0002 (0x0002 - 0x0000)
struct PL_state_C_ReceiveGaugeUpdateEvent final
{
public:
	uint8                                         bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__imm__pf;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_ReceiveGaugeUpdateEvent;

// Function PL_state.PL_state_C.ReplaceFaceIcon
// 0x0008 (0x0008 - 0x0000)
struct PL_state_C_ReplaceFaceIcon final
{
public:
	class UTexture2D*                             bpp__FaceTexture__pf;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_ReplaceFaceIcon;

// Function PL_state.PL_state_C.SetBuffIcon
// 0x0008 (0x0008 - 0x0000)
struct PL_state_C_SetBuffIcon final
{
public:
	int32                                         bpp__ArrayNo__pf;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__BuffNo__pf;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_SetBuffIcon;

// Function PL_state.PL_state_C.SetBulletGauge
// 0x0078 (0x0078 - 0x0000)
struct PL_state_C_SetBulletGauge final
{
public:
	struct FPBItemCatalogData                     bpp__Bullet__pf;                                   // 0x0000(0x0078)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_SetBulletGauge;

// Function PL_state.PL_state_C.SetCharacterIcon
// 0x0001 (0x0001 - 0x0000)
struct PL_state_C_SetCharacterIcon final
{
public:
	EPBGameModePlayer                             bpp__IconCharacter__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_SetCharacterIcon;

// Function PL_state.PL_state_C.SetEffectOnGauge
// 0x0010 (0x0010 - 0x0000)
struct PL_state_C_SetEffectOnGauge final
{
public:
	class UPBUIParticleSystem*                    bpp__TargetGaugeEffect__pf;                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__EffectID__pf;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_SetEffectOnGauge;

// Function PL_state.PL_state_C.SetHp
// 0x0008 (0x0008 - 0x0000)
struct PL_state_C_SetHp final
{
public:
	float                                         bpp__HP__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__HPSpeed__pf;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_SetHp;

// Function PL_state.PL_state_C.SetHPGauge
// 0x0004 (0x0004 - 0x0000)
struct PL_state_C_SetHPGauge final
{
public:
	float                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_SetHPGauge;

// Function PL_state.PL_state_C.SetHPSpeed
// 0x0004 (0x0004 - 0x0000)
struct PL_state_C_SetHPSpeed final
{
public:
	float                                         bpp__HPSpeed__pf;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_SetHPSpeed;

// Function PL_state.PL_state_C.SetMaxHP
// 0x0004 (0x0004 - 0x0000)
struct PL_state_C_SetMaxHP final
{
public:
	float                                         bpp__MaxMP__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_SetMaxHP;

// Function PL_state.PL_state_C.SetMaxMP
// 0x0004 (0x0004 - 0x0000)
struct PL_state_C_SetMaxMP final
{
public:
	float                                         bpp__MaxHP__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_SetMaxMP;

// Function PL_state.PL_state_C.SetMP
// 0x0008 (0x0008 - 0x0000)
struct PL_state_C_SetMP final
{
public:
	float                                         bpp__HP__pf;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__MPSpeed__pf;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_SetMP;

// Function PL_state.PL_state_C.SetMPGauge
// 0x0004 (0x0004 - 0x0000)
struct PL_state_C_SetMPGauge final
{
public:
	float                                         bpp__Value__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_SetMPGauge;

// Function PL_state.PL_state_C.SetMPSpeed
// 0x0004 (0x0004 - 0x0000)
struct PL_state_C_SetMPSpeed final
{
public:
	float                                         bpp__MPSpeed__pf;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_SetMPSpeed;

// Function PL_state.PL_state_C.Tick
// 0x003C (0x003C - 0x0000)
struct PL_state_C_Tick final
{
public:
	struct FGeometry                              bpp__MyGeometry__pf;                               // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         bpp__InDeltaTime__pf;                              // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PL_state_C_Tick;

}

