#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestMenuListItem

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestMenuListItem.QuestMenuListItem_C
// 0x0138 (0x0390 - 0x0258)
class UQuestMenuListItem_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Base;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CheckMark;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEffChoiceBP_C*                         EffChoiceBP;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainParts;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MLTF_Name;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NewIcon;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressIcon;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPBQuestCatalogData                    QuestData;                                         // 0x0298(0x00F8)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_QuestMenuListItem(int32 EntryPoint);
	void Construct();
	void SetNewIcon(bool IsVisible_0);
	void SetProgressIcon(EQuestProgress Progress);
	void SetDispCursor(bool IsOn);
	void QuestAccept();
	void UpdateEnabled();
	void IsEnabled(bool* IsEnabled_0);
	void GetQuestInfo(struct FPBQuestCatalogData* QuestData_0);
	void CancelAccept();
	void Initialize();
	void Setup();
	void SetQuestInfo(const struct FPBQuestCatalogData& Data);
	void SetQuestName();
	void SetArchiveUnlock();
	void SetDispCheckMark(bool IsDisplayCheckMark);
	void IsDispCheckMark(bool* IsDispCheckMark_0);
	void ToggleDispCheckMark();
	void QuestAcceptNoFlag();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("QuestMenuListItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QuestMenuListItem_C")
	}
	static class UQuestMenuListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestMenuListItem_C>();
	}
};
DUMPER7_ASSERTS_UQuestMenuListItem_C;

}

