#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestDetailWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestDetailWindow.QuestDetailWindow_C
// 0x0048 (0x02A0 - 0x0258)
class UQuestDetailWindow_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArchiveDetailWindow_C*                 ArchiveDetailWindow;                               // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveContentsBlock_C*                Client;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveContentsBlock_C*                Detail;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressGraph;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonItemIcon_C*                      QuestItemIcon;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArchiveIconContentsBlock_C*            Rewards;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleBack;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QuestDetailWindow(int32 EntryPoint);
	void Construct();
	void SetProgress(const struct FPBQuestCatalogData& Data);
	void SetDetail(const struct FPBQuestCatalogData& Data);
	void SetCliant(const struct FPBQuestCatalogData& Data);
	void SetRewardAndIcons(const struct FPBQuestCatalogData& Data);
	void UpdateQuestInfo(class UQuestMenuListItem_C* Item);
	void GetCateringTarget(const struct FPBQuestCatalogData& input_data);
	void GetDescription(const struct FPBQuestCatalogData& input_data, class FText* Output);
	void GetEnemyDescription(const struct FPBQuestCatalogData& input_data, class FText* Output);
	void GetCateringDescription(const struct FPBQuestCatalogData& input_data, class FText* Output);
	void GetMementoDescription(const struct FPBQuestCatalogData& input_data, class FText* Output);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("QuestDetailWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QuestDetailWindow_C")
	}
	static class UQuestDetailWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestDetailWindow_C>();
	}
};
DUMPER7_ASSERTS_UQuestDetailWindow_C;

}

