#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuitGameYesNo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuitGameYesNo.QuitGameYesNo_C
// 0x0038 (0x0290 - 0x0258)
class UQuitGameYesNo_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UYesNoPopup_C*                          YesNoPopup;                                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPBCharacterInventoryComponent*         Inventory;                                         // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBSoundControlComponent*               SoundComponent;                                    // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConfigSelectMenu_C*                    ConfigSelectMenu;                                  // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnWindowCancel;                                    // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_QuitGameYesNo(int32 EntryPoint);
	void OnPressedButton();
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void EventSelectYesClosed();
	void EventSelectYes();
	void EventSelectNoClosed();
	void EventSelectNo();
	void Initialize();
	void Setup();
	void OnStart();
	void OnActive();
	void OpenMenu(EUserWidgetPriority Priority_0);
	void CloseMenu();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("QuitGameYesNo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QuitGameYesNo_C")
	}
	static class UQuitGameYesNo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuitGameYesNo_C>();
	}
};
DUMPER7_ASSERTS_UQuitGameYesNo_C;

}

