#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RandomizerContinueButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function RandomizerContinueButton.RandomizerContinueButton_C.ExecuteUbergraph_RandomizerContinueButton
// 0x0008 (0x0008 - 0x0000)
struct RandomizerContinueButton_C_ExecuteUbergraph_RandomizerContinueButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_RandomizerContinueButton_C_ExecuteUbergraph_RandomizerContinueButton;

// Function RandomizerContinueButton.RandomizerContinueButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct RandomizerContinueButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_RandomizerContinueButton_C_PreConstruct;

// Function RandomizerContinueButton.RandomizerContinueButton_C.Initialize
// 0x0008 (0x0008 - 0x0000)
struct RandomizerContinueButton_C_Initialize final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RandomizerContinueButton_C_Initialize;

// Function RandomizerContinueButton.RandomizerContinueButton_C.SetSelect
// 0x0018 (0x0018 - 0x0000)
struct RandomizerContinueButton_C_SetSelect final
{
public:
	bool                                          IsSelect;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue1;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RandomizerContinueButton_C_SetSelect;

// Function RandomizerContinueButton.RandomizerContinueButton_C.IsActivated
// 0x0004 (0x0004 - 0x0000)
struct RandomizerContinueButton_C_IsActivated final
{
public:
	bool                                          TRUE_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isEnable;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsTrue;                                            // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_RandomizerContinueButton_C_IsActivated;

// Function RandomizerContinueButton.RandomizerContinueButton_C.GetUniqueKey
// 0x0008 (0x0008 - 0x0000)
struct RandomizerContinueButton_C_GetUniqueKey final
{
public:
	class FName                                   Unique_0;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RandomizerContinueButton_C_GetUniqueKey;

// Function RandomizerContinueButton.RandomizerContinueButton_C.新規関数_0
// 0x0020 (0x0020 - 0x0000)
struct RandomizerContinueButton_C_新規関数_0 final
{
public:
	class ATutorialManager*                       Tutorial;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTutorialDone_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATutorialManager*                       CallFunc_GetTutorialManager_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RandomizerContinueButton_C_新規関数_0;

// Function RandomizerContinueButton.RandomizerContinueButton_C.SetActivate
// 0x0001 (0x0001 - 0x0000)
struct RandomizerContinueButton_C_SetActivate final
{
public:
	bool                                          Input;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_RandomizerContinueButton_C_SetActivate;

}

