#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RandomizerSelecter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RandomizerSelecter.RandomizerSelecter_C
// 0x0078 (0x02F0 - 0x0278)
class URandomizerSelecter_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStartupSelectMenu_C*                   BaseMenu;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class URandomizerList_C*>              ListItems;                                         // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Index_0;                                           // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Top;                                               // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LAST;                                              // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   EventSelectCancel;                                 // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventSelectDecide;                                 // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCommonControllGuide_C*                 UIGuide;                                           // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventSelectionChanged;                             // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class URandomizerEnterSeedMenu_C*             EnterSeedMenu;                                     // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStartupSelecter_C*                     StartupSelecter;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RandomizerSelecter(int32 EntryPoint);
	void OnPressedButton();
	void Start(const TDelegate<void(const class FName& OldStep, const class FName& NewStep, bool NewStepIsEndStep)>& OnStepChanged, int32 ZOrder);
	void Construct();
	void Initialize();
	void Setup();
	void OnStart();
	void OnSelectMenu();
	void AddList(class URandomizerList_C* add_list);
	void GetList(int32 Param_Index_0, class URandomizerList_C** Output);
	void GetSelectList(class URandomizerList_C** Output);
	void Clean();
	void Refresh();
	void MoveCursor(int32 Move);
	void UpdateContorollGuide();
	void StartMenu(class UCommonControllGuide_C* UIGuide_0);
	void IsListEmpty(bool* IsListEmpty_0);
	void OpenEnterSeedMenu();
	void BackToMenu();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RandomizerSelecter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RandomizerSelecter_C")
	}
	static class URandomizerSelecter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URandomizerSelecter_C>();
	}
};
DUMPER7_ASSERTS_URandomizerSelecter_C;

}

