#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RankingModeSelecter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RankingModeSelecter.RankingModeSelecter_C
// 0x0040 (0x0298 - 0x0258)
class URankingModeSelecter_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 back;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Mode;                                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTabButtons_C*                          TabButtons;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           MenuNames;                                         // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Index_0;                                           // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Top;                                               // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LAST;                                              // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RankingModeSelecter(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void AddMenuLamp();
	void AddMode(const class FText& input_text);
	void Clear();
	void ClearMenuNames();
	void SetMode(int32 Param_Index_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RankingModeSelecter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RankingModeSelecter_C")
	}
	static class URankingModeSelecter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URankingModeSelecter_C>();
	}
};
DUMPER7_ASSERTS_URankingModeSelecter_C;

}

