#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RankingSpeedRunList

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function RankingSpeedRunList.RankingSpeedRunList_C.ExecuteUbergraph_RankingSpeedRunList
// 0x0004 (0x0004 - 0x0000)
struct RankingSpeedRunList_C_ExecuteUbergraph_RankingSpeedRunList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RankingSpeedRunList_C_ExecuteUbergraph_RankingSpeedRunList;

// Function RankingSpeedRunList.RankingSpeedRunList_C.SetRankingData
// 0x0040 (0x0040 - 0x0000)
struct RankingSpeedRunList_C_SetRankingData final
{
public:
	struct FPBLeaderboardRow                      Input;                                             // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_RankingSpeedRunList_C_SetRankingData;

// Function RankingSpeedRunList.RankingSpeedRunList_C.SetRank
// 0x0158 (0x0158 - 0x0000)
struct RankingSpeedRunList_C_SetRank final
{
public:
	int32                                         Val;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   txt;                                               // 0x0008(0x0018)(Edit, BlueprintVisible)
	TMap<EOrderCountType, class FText>            Map;                                               // 0x0020(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	EOrderCountType                               Key;                                               // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EOrderCountType, class FText>            K2Node_MakeVariable_MakeVariableOutput;            // 0x0078(0x0050)(ZeroConstructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	EOrderCountType                               CallFunc_GetOrderCountType_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0120(0x0018)()
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0138(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_RankingSpeedRunList_C_SetRank;

// Function RankingSpeedRunList.RankingSpeedRunList_C.SetUserName
// 0x0018 (0x0018 - 0x0000)
struct RankingSpeedRunList_C_SetUserName final
{
public:
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0000(0x0018)()
};
DUMPER7_ASSERTS_RankingSpeedRunList_C_SetUserName;

// Function RankingSpeedRunList.RankingSpeedRunList_C.SetDispCursor
// 0x0001 (0x0001 - 0x0000)
struct RankingSpeedRunList_C_SetDispCursor final
{
public:
	bool                                          is_on;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_RankingSpeedRunList_C_SetDispCursor;

// Function RankingSpeedRunList.RankingSpeedRunList_C.SetClearTime
// 0x0200 (0x0200 - 0x0000)
struct RankingSpeedRunList_C_SetClearTime final
{
public:
	class FText                                   txt;                                               // 0x0000(0x0018)(Edit, BlueprintVisible)
	struct FPBTimerText                           sliced;                                            // 0x0018(0x0078)(Edit, BlueprintVisible)
	float                                         sec;                                               // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x00D8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0118(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0158(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0168(0x0018)()
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBTimerText                           CallFunc_GetTimerText_ReturnValue;                 // 0x0188(0x0078)()
};
DUMPER7_ASSERTS_RankingSpeedRunList_C_SetClearTime;

// Function RankingSpeedRunList.RankingSpeedRunList_C.SetAchivedDate
// 0x0030 (0x0030 - 0x0000)
struct RankingSpeedRunList_C_SetAchivedDate final
{
public:
	class FText                                   text;                                              // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_RankingSpeedRunList_C_SetAchivedDate;

}

