#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RankingCourceSelecter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RankingCourceSelecter.RankingCourceSelecter_C
// 0x0088 (0x02E0 - 0x0258)
class URankingCourceSelecter_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URankingSelecter_C*                     Selecter;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           Contents;                                          // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class FText                                   Title;                                             // 0x0278(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, EPBExtraModeCourse>               Cource;                                            // 0x0290(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_RankingCourceSelecter(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void SetTitleText(const class FText& input_text);
	void SetupSelecter();
	void GetSelectCource(EPBExtraModeCourse* Value);
	void GetSelecter(class URankingSelecter_C** Selecter_0);
	void SwitchList(int32 move_val);
	void IsSelectCourse(const struct FPBLeaderboardRow& input_data, bool is_true, bool* is_enable);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RankingCourceSelecter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RankingCourceSelecter_C")
	}
	static class URankingCourceSelecter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URankingCourceSelecter_C>();
	}
};
DUMPER7_ASSERTS_URankingCourceSelecter_C;

}

