#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RankingPlayerSelecter

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function RankingPlayerSelecter.RankingPlayerSelecter_C.ExecuteUbergraph_RankingPlayerSelecter
// 0x0004 (0x0004 - 0x0000)
struct RankingPlayerSelecter_C_ExecuteUbergraph_RankingPlayerSelecter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RankingPlayerSelecter_C_ExecuteUbergraph_RankingPlayerSelecter;

// Function RankingPlayerSelecter.RankingPlayerSelecter_C.SetTitleText
// 0x0018 (0x0018 - 0x0000)
struct RankingPlayerSelecter_C_SetTitleText final
{
public:
	class FText                                   input_text;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_RankingPlayerSelecter_C_SetTitleText;

// Function RankingPlayerSelecter.RankingPlayerSelecter_C.SetupSelecter
// 0x0048 (0x0048 - 0x0000)
struct RankingPlayerSelecter_C_SetupSelecter final
{
public:
	class FText                                   Element;                                           // 0x0000(0x0018)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0028(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_RankingPlayerSelecter_C_SetupSelecter;

// Function RankingPlayerSelecter.RankingPlayerSelecter_C.GetSelectCharacter
// 0x0010 (0x0010 - 0x0000)
struct RankingPlayerSelecter_C_GetSelectCharacter final
{
public:
	EPBGameModePlayer                             Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         idx;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelecterIndex_index;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPBGameModePlayer                             CallFunc_Map_Find_Value;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_RankingPlayerSelecter_C_GetSelectCharacter;

// Function RankingPlayerSelecter.RankingPlayerSelecter_C.GetSelecter
// 0x0008 (0x0008 - 0x0000)
struct RankingPlayerSelecter_C_GetSelecter final
{
public:
	class URankingSelecter_C*                     Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RankingPlayerSelecter_C_GetSelecter;

// Function RankingPlayerSelecter.RankingPlayerSelecter_C.SwitchList
// 0x0008 (0x0008 - 0x0000)
struct RankingPlayerSelecter_C_SwitchList final
{
public:
	int32                                         move_val;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Move;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RankingPlayerSelecter_C_SwitchList;

// Function RankingPlayerSelecter.RankingPlayerSelecter_C.IsSelectCharacter
// 0x0090 (0x0090 - 0x0000)
struct RankingPlayerSelecter_C_IsSelectCharacter final
{
public:
	struct FPBLeaderboardRow                      inpuy_data;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          is_true;                                           // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          is_enable;                                         // 0x0041(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBLeaderboardRow                      Data;                                              // 0x0048(0x0040)(Edit, BlueprintVisible)
	bool                                          is_match;                                          // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBGameModePlayer                             Chara;                                             // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TRUE_0;                                            // 0x008A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBGameModePlayer                             CallFunc_GetSelectCharacter_Value;                 // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_RankingPlayerSelecter_C_IsSelectCharacter;

}

