#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReadableBook

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ReadableBook.ReadableBook_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct ReadableBook_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                bpp__EndPlayReason__pf;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ReadableBook_C_ReceiveEndPlay;

// Function ReadableBook.ReadableBook_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ReadableBook_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ReadableBook_C_ReceiveTick;

// Function ReadableBook.ReadableBook_C.StartClose
// 0x0004 (0x0004 - 0x0000)
struct ReadableBook_C_StartClose final
{
public:
	float                                         bpp__OpenDuration__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ReadableBook_C_StartClose;

// Function ReadableBook.ReadableBook_C.StartOpen
// 0x0004 (0x0004 - 0x0000)
struct ReadableBook_C_StartOpen final
{
public:
	float                                         bpp__OpenDuration__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ReadableBook_C_StartOpen;

// Function ReadableBook.ReadableBook_C.UpdateToClose
// 0x0004 (0x0004 - 0x0000)
struct ReadableBook_C_UpdateToClose final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ReadableBook_C_UpdateToClose;

// Function ReadableBook.ReadableBook_C.UpdateToOpen
// 0x0004 (0x0004 - 0x0000)
struct ReadableBook_C_UpdateToOpen final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ReadableBook_C_UpdateToOpen;

}

