#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RecordNum

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RecordNum.RecordNum_C
// 0x0020 (0x0278 - 0x0258)
class URecordNum_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Number;                                            // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RecordNum(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void Initialize();
	void Setup();
	void SetNumber(float in_Num);
	void SetMaterial(class UMaterialInterface* Input);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RecordNum_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RecordNum_C")
	}
	static class URecordNum_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URecordNum_C>();
	}
};
DUMPER7_ASSERTS_URecordNum_C;

}

