#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SampleDiaryWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SampleDiaryWidget.SampleDiaryWidget_C
// 0x0028 (0x02A0 - 0x0278)
class USampleDiaryWidget_C final : public UPBDiaryWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonControllGuide_C*                 ControllGuide;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonDiaryPage_C*                     DiaryPage;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AArchiveBackGround_C*                   BookModel;                                         // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsArchiveMenuDiary;                                // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SampleDiaryWidget(int32 EntryPoint);
	void OnPressedButton();
	void Destruct();
	void Construct();
	void BookOpened();
	void SetupEventBookOpened();
	void Close(float CloseDuration);
	void StartOpen(float OpenDuration);
	void CloseDiary();
	void Initialize();
	void OpenDiary();
	void OpenDiaryArchive();
	void Setup();
	void SetupDiaryPage();
	void UpdateControlGuide();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SampleDiaryWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SampleDiaryWidget_C")
	}
	static class USampleDiaryWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USampleDiaryWidget_C>();
	}
};
DUMPER7_ASSERTS_USampleDiaryWidget_C;

}

