#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveLights

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// DynamicClass SaveLights.SaveLights_C
// 0x0188 (0x0628 - 0x04A0)
class ASaveLights_C final : public ASaveLightController
{
public:
	class USaveLightComponent*                    SaveLight49;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight44;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight43;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight42;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight41;                                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight39;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight38;                                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight37;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight36;                                       // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight35;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight34;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight33;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight31;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight26;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight25;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight24;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight22;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USaveLightComponent*                    SaveLight21;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 LocalLight;                                        // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         Size;                                              // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LightSucked;                                       // 0x054C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54D[0x3];                                      // 0x054D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBaseCharacter*                       PlayerStep;                                        // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSaveLightSinParams                    K2Node_MakeStruct_SaveLightSinParams;              // 0x0558(0x0030)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	struct FSaveLightSinParams                    K2Node_MakeStruct_SaveLightSinParams1;             // 0x0588(0x0030)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	struct FSaveLightSinParams                    K2Node_MakeStruct_SaveLightSinParams2;             // 0x05B8(0x0030)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Temp_int_Variable;                                 // 0x05E8(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSaveLightSinParams                    K2Node_MakeStruct_SaveLightSinParams3;             // 0x05EC(0x0030)(Transient, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x061C(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASaveLightController*                   K2Node_CustomEvent_TargetActor;                    // 0x0620(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void LightGroup_1(const struct FVector& bpp__Frequency__pf, const struct FVector& bpp__Amplitude__pf, const struct FVector& bpp__Speed__pf, const struct FVector& bpp__Phase__pf);
	void LightGroup_2(const struct FVector& bpp__Frequency__pf, const struct FVector& bpp__Amplitude__pf, const struct FVector& bpp__Speed__pf, const struct FVector& bpp__Phase__pf);
	void LightGroup_3(const struct FVector& bpp__Frequency__pf, const struct FVector& bpp__Amplitude__pf, const struct FVector& bpp__Speed__pf, const struct FVector& bpp__Phase__pf);
	void LightGroup_4(const struct FVector& bpp__Frequency__pf, const struct FVector& bpp__Amplitude__pf, const struct FVector& bpp__Speed__pf, const struct FVector& bpp__Phase__pf);
	void LightGroup_5(const struct FVector& bpp__Frequency__pf, const struct FVector& bpp__Amplitude__pf, const struct FVector& bpp__Speed__pf, const struct FVector& bpp__Phase__pf);
	void OnTriggerLights(class ASaveLightController* bpp__TargetActor__pf);
	void ReceiveBeginPlay();
	void ReceiveTick(float bpp__DeltaSeconds__pf);
	void sinParameter(struct FSaveLightSinParams* bpp__SInParameter__pf);
	void sinParameter_Back(struct FSaveLightSinParams* bpp__SInParameter__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SaveLights_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SaveLights_C")
	}
	static class ASaveLights_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASaveLights_C>();
	}
};
DUMPER7_ASSERTS_ASaveLights_C;

}

