#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveLights

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SaveLights.SaveLights_C.LightGroup_1
// 0x0030 (0x0030 - 0x0000)
struct SaveLights_C_LightGroup_1 final
{
public:
	struct FVector                                bpp__Frequency__pf;                                // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Amplitude__pf;                                // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Speed__pf;                                    // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Phase__pf;                                    // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SaveLights_C_LightGroup_1;

// Function SaveLights.SaveLights_C.LightGroup_2
// 0x0030 (0x0030 - 0x0000)
struct SaveLights_C_LightGroup_2 final
{
public:
	struct FVector                                bpp__Frequency__pf;                                // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Amplitude__pf;                                // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Speed__pf;                                    // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Phase__pf;                                    // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SaveLights_C_LightGroup_2;

// Function SaveLights.SaveLights_C.LightGroup_3
// 0x0030 (0x0030 - 0x0000)
struct SaveLights_C_LightGroup_3 final
{
public:
	struct FVector                                bpp__Frequency__pf;                                // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Amplitude__pf;                                // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Speed__pf;                                    // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Phase__pf;                                    // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SaveLights_C_LightGroup_3;

// Function SaveLights.SaveLights_C.LightGroup_4
// 0x0030 (0x0030 - 0x0000)
struct SaveLights_C_LightGroup_4 final
{
public:
	struct FVector                                bpp__Frequency__pf;                                // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Amplitude__pf;                                // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Speed__pf;                                    // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Phase__pf;                                    // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SaveLights_C_LightGroup_4;

// Function SaveLights.SaveLights_C.LightGroup_5
// 0x0030 (0x0030 - 0x0000)
struct SaveLights_C_LightGroup_5 final
{
public:
	struct FVector                                bpp__Frequency__pf;                                // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Amplitude__pf;                                // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Speed__pf;                                    // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Phase__pf;                                    // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SaveLights_C_LightGroup_5;

// Function SaveLights.SaveLights_C.OnTriggerLights
// 0x0008 (0x0008 - 0x0000)
struct SaveLights_C_OnTriggerLights final
{
public:
	class ASaveLightController*                   bpp__TargetActor__pf;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SaveLights_C_OnTriggerLights;

// Function SaveLights.SaveLights_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SaveLights_C_ReceiveTick final
{
public:
	float                                         bpp__DeltaSeconds__pf;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SaveLights_C_ReceiveTick;

// Function SaveLights.SaveLights_C.sinParameter
// 0x0030 (0x0030 - 0x0000)
struct SaveLights_C_sinParameter final
{
public:
	struct FSaveLightSinParams                    bpp__SInParameter__pf;                             // 0x0000(0x0030)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SaveLights_C_sinParameter;

// Function SaveLights.SaveLights_C.sinParameter_Back
// 0x0030 (0x0030 - 0x0000)
struct SaveLights_C_sinParameter_Back final
{
public:
	struct FSaveLightSinParams                    bpp__SInParameter__pf;                             // 0x0000(0x0030)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SaveLights_C_sinParameter_Back;

}

