#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SavedataDetail

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SavedataDetail.SavedataDetail_C
// 0x00F0 (0x0348 - 0x0258)
class USavedataDetail_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AreaName;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BusterNum;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 frame;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 G;                                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Gold;                                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayTime;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Root;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TravelRate;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPBSaveGameDataInfo                    Data;                                              // 0x02A0(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_SavedataDetail(int32 EntryPoint);
	void Construct();
	void SetTravelRate(float MapComp);
	void SetBusterNum(int32 TotalKill);
	void SetGold(int32 Gold_0);
	void SetPlayTme(float Seconds);
	void SetVisible(ESlateVisibility InVisibility);
	void Initialize();
	void Setup();
	void SetSaveData(const struct FPBSaveGameDataInfo& Data_0);
	void UpdateInfo();
	void SetAreaName(class FName AreaID);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SavedataDetail_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SavedataDetail_C")
	}
	static class USavedataDetail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USavedataDetail_C>();
	}
};
DUMPER7_ASSERTS_USavedataDetail_C;

}

