#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveSlotItem

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SaveSlotItem.SaveSlotItem_C
// 0x0268 (0x04C0 - 0x0258)
class USaveSlotItem_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 back;                                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Break;                                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEffChoiceBP_C*                         EffChoiceBP;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Exclamation;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Root;                                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBox_C*                       TextBox;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPBSaveGameDataInfo                    SaveData;                                          // 0x0290(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          isNew;                                             // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          isEnable;                                          // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSuspend;                                         // 0x033A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B[0x5];                                      // 0x033B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   EventEditNameDecide;                               // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventEditNameCancel;                               // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FPBSaveGameDataInfo                    SuspendData;                                       // 0x0360(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsSelectSuspend;                                   // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsCorrupted;                                       // 0x0409(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40A[0x6];                                      // 0x040A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBSaveGameDataInfo                    ClassicData;                                       // 0x0410(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsSelectClassic;                                   // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsClassic;                                         // 0x04B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SaveSlotItem(int32 EntryPoint);
	void Construct();
	void BndEvt__TextBox_K2Node_ComponentBoundEvent_0_EventDecideInput__DelegateSignature();
	void BndEvt__TextBox_K2Node_ComponentBoundEvent_1_EventCancelInput__DelegateSignature();
	void PlayBlink();
	void SetDispCursor(bool isEnable_0);
	void Initialize();
	void Setup();
	void SetSlotParam(const struct FPBSaveGameDataInfo& input_data);
	void GetSaveData(struct FPBSaveGameDataInfo* SaveData_0);
	void SetNewDataFlag();
	void SetSlotName();
	void SetEnableData();
	void IsNewData(bool TRUE_0, bool* isEnable_0);
	void IsEnableData(bool TRUE_0, bool* isEnable_0);
	void IsInherite(bool is_true, bool* is_enable);
	void IsSuspended(bool is_true, bool* IsSuspended_0);
	void SetSuspendData(const struct FPBSaveGameDataInfo& input_data);
	void GetEditNameBox(class UCommonTextBox_C** TextBox_0);
	void UpdatePlayerName(const class FString& SlotName);
	void IsSelectSuspendData(bool is_true, bool* is_enable);
	void SwitchSelectData();
	void SetCorruptedData(const struct FPBSaveGameDataInfo& input_data);
	void SetClassicData(const struct FPBSaveGameDataInfo& Input_Data);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SaveSlotItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SaveSlotItem_C")
	}
	static class USaveSlotItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveSlotItem_C>();
	}
};
DUMPER7_ASSERTS_USaveSlotItem_C;

}

