#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerListingUnit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ServerListingUnit.ServerListingUnit_C
// 0x0080 (0x02B0 - 0x0230)
class UServerListingUnit_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_0;                                          // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListItem_C*                      CommonListItem;                                    // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FOnlineServerListing                   Listing;                                           // 0x0248(0x0060)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          IsFull;                                            // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ServerListingUnit(int32 EntryPoint);
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ServerListingUnit_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ServerListingUnit_C")
	}
	static class UServerListingUnit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UServerListingUnit_C>();
	}
};
DUMPER7_ASSERTS_UServerListingUnit_C;

}

