#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SetConfigKey

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function SetConfigKey.SetConfigKey_C.ExecuteUbergraph_SetConfigKey
// 0x0004 (0x0004 - 0x0000)
struct SetConfigKey_C_ExecuteUbergraph_SetConfigKey final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SetConfigKey_C_ExecuteUbergraph_SetConfigKey;

// Function SetConfigKey.SetConfigKey_C.Setup
// 0x0001 (0x0001 - 0x0000)
struct SetConfigKey_C_Setup final
{
public:
	bool                                          CallFunc_IsWindowsPlatform_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SetConfigKey_C_Setup;

// Function SetConfigKey.SetConfigKey_C.SetRightIcon
// 0x0018 (0x0018 - 0x0000)
struct SetConfigKey_C_SetRightIcon final
{
public:
	EPBGameKey                                    input_action;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetActionIconImage_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SetConfigKey_C_SetRightIcon;

// Function SetConfigKey.SetConfigKey_C.SetLeftIcon
// 0x0018 (0x0018 - 0x0000)
struct SetConfigKey_C_SetLeftIcon final
{
public:
	EPBGameKey                                    input_action;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetActionIconImage_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SetConfigKey_C_SetLeftIcon;

// Function SetConfigKey.SetConfigKey_C.SetConfigIcon
// 0x0005 (0x0005 - 0x0000)
struct SetConfigKey_C_SetConfigIcon final
{
public:
	EPBGameKey                                    input_action;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPcOnlyKeybind;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isPcOnly;                                          // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPBGameKey                                    Action;                                            // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWindowsPlatform_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SetConfigKey_C_SetConfigIcon;

// Function SetConfigKey.SetConfigKey_C.SetCenterIcon
// 0x0018 (0x0018 - 0x0000)
struct SetConfigKey_C_SetCenterIcon final
{
public:
	EPBGameKey                                    input_action;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBGameInstance*                        CallFunc_GetPBGameInstance_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetActionIconImage_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SetConfigKey_C_SetCenterIcon;

}

