#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShardMenuWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShardMenuWindow.ShardMenuWindow_C
// 0x0038 (0x02B0 - 0x0278)
class UShardMenuWindow_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonMenuListWindow_C*                CommonMenuListWindow;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipShardTab_C*                       EquipShardTab;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         tabIndex;                                          // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   SendShardInfomation;                               // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Equiped;                                           // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEmptyList;                                       // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ShardMenuWindow(int32 EntryPoint);
	void Construct();
	void IsEnableListItem(bool* isEnable);
	void GetEquipedShard(class UItemListItem_C** ret);
	void GetSelectCategory(ECarriedCatalog* Output);
	void Initialize();
	void Setup();
	void Refresh();
	void MoveScroll(int32 MoveVal, class UItemListItem_C** Description);
	void SwitchTab(int32 Index_0);
	void GetSelectShard(class UItemListItem_C** ret);
	void PlayTabSelectButton(int32 Move);
	void GetShardListData(ECarriedCatalog Input, TArray<struct FPBItemCatalogData>* ret);
	void GetTabIndex(int32* tabIndex_0);
	void GetSelectSortKey(struct FPBInventorySortData* Output);
	void SetSelectSortKey(const struct FPBInventorySortData& Input);
	void SetSelectSortList(TArray<EInventorySort>* SortList);
	void IsEmpty(bool IsTrue, bool* isEnable);
	void IsSelectSort(bool* isEnable);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ShardMenuWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ShardMenuWindow_C")
	}
	static class UShardMenuWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShardMenuWindow_C>();
	}
};
DUMPER7_ASSERTS_UShardMenuWindow_C;

}

