#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShardMenuWindow

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ShardData_structs.hpp"


namespace SDK::Params
{

// Function ShardMenuWindow.ShardMenuWindow_C.ExecuteUbergraph_ShardMenuWindow
// 0x0004 (0x0004 - 0x0000)
struct ShardMenuWindow_C_ExecuteUbergraph_ShardMenuWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_ExecuteUbergraph_ShardMenuWindow;

// Function ShardMenuWindow.ShardMenuWindow_C.IsEnableListItem
// 0x0002 (0x0002 - 0x0000)
struct ShardMenuWindow_C_IsEnableListItem final
{
public:
	bool                                          isEnable;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableListItem_IsEnable;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_IsEnableListItem;

// Function ShardMenuWindow.ShardMenuWindow_C.GetEquipedShard
// 0x0010 (0x0010 - 0x0000)
struct ShardMenuWindow_C_GetEquipedShard final
{
public:
	class UItemListItem_C*                        ret;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemListItem_C*                        CallFunc_GetList_ret;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_GetEquipedShard;

// Function ShardMenuWindow.ShardMenuWindow_C.GetSelectCategory
// 0x0010 (0x0010 - 0x0000)
struct ShardMenuWindow_C_GetSelectCategory final
{
public:
	ECarriedCatalog                               Output;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarriedCatalog                               Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarriedCatalog                               Temp_byte_Variable1;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarriedCatalog                               Temp_byte_Variable2;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarriedCatalog                               Temp_byte_Variable3;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarriedCatalog                               Temp_byte_Variable4;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarriedCatalog                               K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_GetSelectCategory;

// Function ShardMenuWindow.ShardMenuWindow_C.Refresh
// 0x0170 (0x0170 - 0x0000)
struct ShardMenuWindow_C_Refresh final
{
public:
	int32                                         idx;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Buf;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarriedCatalog                               Category;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCharacterInventoryComponent*         inventry;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemCatalogData                     Element;                                           // 0x0018(0x0078)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UItemListItem_C*                        ListItem;                                          // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddList_index;                            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemListItem_C*                        CallFunc_AddList_retItem;                          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBItemCatalogData>             CallFunc_GetShardListData_ret;                     // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarriedCatalog                               CallFunc_GetTabCategory_ReturnValue;               // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPBItemCatalogData                     CallFunc_Array_Get_Item;                           // 0x00D8(0x0078)(HasGetValueTypeHash)
	bool                                          CallFunc_IsEquipedItem_isEquip;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddList_index1;                           // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemListItem_C*                        CallFunc_AddList_retItem1;                         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_Refresh;

// Function ShardMenuWindow.ShardMenuWindow_C.MoveScroll
// 0x0020 (0x0020 - 0x0000)
struct ShardMenuWindow_C_MoveScroll final
{
public:
	int32                                         MoveVal;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemListItem_C*                        Description;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemListItem_C*                        CallFunc_MoveMenuCursor_Description;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_MoveScroll;

// Function ShardMenuWindow.ShardMenuWindow_C.SwitchTab
// 0x0008 (0x0008 - 0x0000)
struct ShardMenuWindow_C_SwitchTab final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_SwitchTab;

// Function ShardMenuWindow.ShardMenuWindow_C.GetSelectShard
// 0x0010 (0x0010 - 0x0000)
struct ShardMenuWindow_C_GetSelectShard final
{
public:
	class UItemListItem_C*                        ret;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemListItem_C*                        CallFunc_GetSelectList_ret;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_GetSelectShard;

// Function ShardMenuWindow.ShardMenuWindow_C.PlayTabSelectButton
// 0x0008 (0x0008 - 0x0000)
struct ShardMenuWindow_C_PlayTabSelectButton final
{
public:
	int32                                         Move;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_PlayTabSelectButton;

// Function ShardMenuWindow.ShardMenuWindow_C.GetShardListData
// 0x0048 (0x0048 - 0x0000)
struct ShardMenuWindow_C_GetShardListData final
{
public:
	ECarriedCatalog                               Input;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBItemCatalogData>             ret;                                               // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor)
	ECarriedCatalog                               Category;                                          // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBInventorySortData                   sortKey;                                           // 0x0019(0x0003)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCharacterInventoryComponent*         inventry;                                          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBInventorySortData                   CallFunc_GetSelectSortKey_Output;                  // 0x0028(0x0003)(NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBItemCatalogData>             CallFunc_GetAllMyEquip_ret;                        // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	class UPBCharacterInventoryComponent*         CallFunc_GetPlayerInventry_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_GetShardListData;

// Function ShardMenuWindow.ShardMenuWindow_C.GetTabIndex
// 0x0004 (0x0004 - 0x0000)
struct ShardMenuWindow_C_GetTabIndex final
{
public:
	int32                                         tabIndex_0;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_GetTabIndex;

// Function ShardMenuWindow.ShardMenuWindow_C.GetSelectSortKey
// 0x0006 (0x0006 - 0x0000)
struct ShardMenuWindow_C_GetSelectSortKey final
{
public:
	struct FPBInventorySortData                   Output;                                            // 0x0000(0x0003)(Parm, OutParm, NoDestructor)
	struct FPBInventorySortData                   CallFunc_GetSelectSortKey_Output;                  // 0x0003(0x0003)(NoDestructor)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_GetSelectSortKey;

// Function ShardMenuWindow.ShardMenuWindow_C.SetSelectSortKey
// 0x0006 (0x0006 - 0x0000)
struct ShardMenuWindow_C_SetSelectSortKey final
{
public:
	struct FPBInventorySortData                   Input;                                             // 0x0000(0x0003)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPBInventorySortData                   Key;                                               // 0x0003(0x0003)(Edit, BlueprintVisible, NoDestructor)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_SetSelectSortKey;

// Function ShardMenuWindow.ShardMenuWindow_C.SetSelectSortList
// 0x0048 (0x0048 - 0x0000)
struct ShardMenuWindow_C_SetSelectSortList final
{
public:
	TArray<EInventorySort>                        SortList;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<EInventorySort>                        Defaut;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EInventorySort>                        K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<EInventorySort>                        K2Node_Select_Default;                             // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_SetSelectSortList;

// Function ShardMenuWindow.ShardMenuWindow_C.IsEmpty
// 0x0004 (0x0004 - 0x0000)
struct ShardMenuWindow_C_IsEmpty final
{
public:
	bool                                          IsTrue;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          isEnable;                                          // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TRUE_0;                                            // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_IsEmpty;

// Function ShardMenuWindow.ShardMenuWindow_C.IsSelectSort
// 0x0003 (0x0003 - 0x0000)
struct ShardMenuWindow_C_IsSelectSort final
{
public:
	bool                                          isEnable;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_IsEnable;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectY_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ShardMenuWindow_C_IsSelectSort;

}

