#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShardTypeInfo

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"


namespace SDK::Params
{

// Function ShardTypeInfo.ShardTypeInfo_C.ExecuteUbergraph_ShardTypeInfo
// 0x0004 (0x0004 - 0x0000)
struct ShardTypeInfo_C_ExecuteUbergraph_ShardTypeInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShardTypeInfo_C_ExecuteUbergraph_ShardTypeInfo;

// Function ShardTypeInfo.ShardTypeInfo_C.SetShardData
// 0x00F0 (0x00F0 - 0x0000)
struct ShardTypeInfo_C_SetShardData final
{
public:
	struct FPBItemCatalogData                     Input;                                             // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FPBItemCatalogData                     itemData;                                          // 0x0078(0x0078)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ShardTypeInfo_C_SetShardData;

// Function ShardTypeInfo.ShardTypeInfo_C.SetShardType
// 0x0050 (0x0050 - 0x0000)
struct ShardTypeInfo_C_SetShardType final
{
public:
	bool                                          IsHold;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Hold;                                              // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0020(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0038(0x0018)()
};
DUMPER7_ASSERTS_ShardTypeInfo_C_SetShardType;

}

