#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShortcutSet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShortcutSet.ShortcutSet_C
// 0x00F8 (0x0370 - 0x0278)
class UShortcutSet_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonItemIcon_C*                      CommonItemIcon;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBox_C*                       CommonTextBox;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEffChoiceBP_C*                         EffChoiceBP;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   myId;                                              // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Description;                                       // 0x02A0(0x0018)(Edit, BlueprintVisible)
	float                                         IconID;                                            // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Power;                                             // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         AttributeIcons;                                    // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num;                                               // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPBItemCatalogData                     Data;                                              // 0x02D8(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventDecideName;                                   // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventCancelName;                                   // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_ShortcutSet(int32 EntryPoint);
	void Construct();
	void EventCancelInput();
	void SetupEventCancelInput();
	void EventDecideInput();
	void SetupEventDecideInput();
	void SetItemInfo(const struct FPBItemCatalogData& Item);
	void SetListCursor(ESlateVisibility InVisibility);
	void GetInputText(class FText* Output);
	void GetItemName(class FText* Output);
	void Initialize();
	void InputTextActivate();
	void InputTextInvalidate();
	void SetInputText(const class FText& Input);
	void SetItemName(const class FText& InText);
	void SetTextColor(const struct FSlateColor& Input);
	void Setup();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ShortcutSet_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ShortcutSet_C")
	}
	static class UShortcutSet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShortcutSet_C>();
	}
};
DUMPER7_ASSERTS_UShortcutSet_C;

}

