#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Single_LaunchBulletFromDecal

#include "Basic.hpp"

#include "ProjectBlood_classes.hpp"


namespace SDK
{

// DynamicClass Single_LaunchBulletFromDecal.Single_LaunchBulletFromDecal_C
// 0x0010 (0x0048 - 0x0038)
class USingle_LaunchBulletFromDecal_C final : public UPBAnimNotify
{
public:
	class FName                                   BulletID;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsGround;                                          // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCeil;                                            // 0x0041(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsWall;                                            // 0x0042(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool PBNotifyWithCharacter(class APBBaseCharacter* bpp__character__pf, class USkeletalMeshComponent* bpp__MeshComp__pf, class UAnimSequenceBase* bpp__Animation__pf) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Single_LaunchBulletFromDecal_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Single_LaunchBulletFromDecal_C")
	}
	static class USingle_LaunchBulletFromDecal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USingle_LaunchBulletFromDecal_C>();
	}
};
DUMPER7_ASSERTS_USingle_LaunchBulletFromDecal_C;

}

