#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SortMenuList

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SortMenuList.SortMenuList_C
// 0x0020 (0x0278 - 0x0258)
class USortMenuList_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Arrow;                                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonCheckBoxList_C*                  CommonCheckBoxList;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EInventorySort                                sortKey;                                           // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isOrder;                                           // 0x0271(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsActive;                                          // 0x0272(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SortMenuList(int32 EntryPoint);
	void Construct();
	void Setup(EInventorySort sortKey_0);
	void UpdateText();
	void UpdateOrder();
	void SetListCursor(ESlateVisibility InVisibility);
	void SetSortActive(bool In_Active);
	void GetSortKey(EInventorySort* sortKey_0);
	void SwitchOrder();
	void GetSortOrder(bool* isOrder_0);
	void SetSortOrder(bool isOrder_0);
	void GetSortActive(bool* IsActive_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SortMenuList_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SortMenuList_C")
	}
	static class USortMenuList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USortMenuList_C>();
	}
};
DUMPER7_ASSERTS_USortMenuList_C;

}

