#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundMenuSet

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SoundMenuSet.SoundMenuSet_C.SetListCursor
// 0x0002 (0x0002 - 0x0000)
struct SoundMenuSet_C_SetListCursor final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Visible;                                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SoundMenuSet_C_SetListCursor;

// Function SoundMenuSet.SoundMenuSet_C.SetContentText
// 0x0030 (0x0030 - 0x0000)
struct SoundMenuSet_C_SetContentText final
{
public:
	class FText                                   inputText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   text;                                              // 0x0018(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_SoundMenuSet_C_SetContentText;

// Function SoundMenuSet.SoundMenuSet_C.SetPlayState
// 0x0001 (0x0001 - 0x0000)
struct SoundMenuSet_C_SetPlayState final
{
public:
	bool                                          IsPlay;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SoundMenuSet_C_SetPlayState;

// Function SoundMenuSet.SoundMenuSet_C.GetPlayState
// 0x0001 (0x0001 - 0x0000)
struct SoundMenuSet_C_GetPlayState final
{
public:
	bool                                          IsPlay;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SoundMenuSet_C_GetPlayState;

// Function SoundMenuSet.SoundMenuSet_C.SwitchPlayState
// 0x0002 (0x0002 - 0x0000)
struct SoundMenuSet_C_SwitchPlayState final
{
public:
	bool                                          IsPlay;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_SoundMenuSet_C_SwitchPlayState;

// Function SoundMenuSet.SoundMenuSet_C.MoveSongCursor
// 0x0030 (0x0030 - 0x0000)
struct SoundMenuSet_C_MoveSongCursor final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddValueAndLoop_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SoundMenuSet_C_MoveSongCursor;

// Function SoundMenuSet.SoundMenuSet_C.GetSongDescription
// 0x0018 (0x0018 - 0x0000)
struct SoundMenuSet_C_GetSongDescription final
{
public:
	class FText                                   ret;                                               // 0x0000(0x0018)(Parm, OutParm)
};
DUMPER7_ASSERTS_SoundMenuSet_C_GetSongDescription;

// Function SoundMenuSet.SoundMenuSet_C.GetSongId
// 0x0008 (0x0008 - 0x0000)
struct SoundMenuSet_C_GetSongId final
{
public:
	class FName                                   ret;                                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SoundMenuSet_C_GetSongId;

}

