#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Step_GroundRoot_New

#include "Basic.hpp"

#include "Step_Root_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// DynamicClass Step_GroundRoot_New.Step_GroundRoot_New_C
// 0x0020 (0x0B98 - 0x0B78)
class UStep_GroundRoot_New_C : public UStep_Root_C
{
public:
	float                                         PrevRootMotion;                                    // 0x0B78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInitRight;                                       // 0x0B7C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUseGlobalMove;                                   // 0x0B7D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B7E[0x2];                                      // 0x0B7E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastLandLocation;                                  // 0x0B80(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastLandCheclTime;                                 // 0x0B8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsKnockedBack;                                     // 0x0B90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B91[0x7];                                      // 0x0B91(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void KnockbackCharacter(class UPBCollisionObject* bpp__attackCollisionObject__pf, const struct FPBCollisionComponent& bpp__attackCollisionComponent__pf);
	void OutputMoveInfo(struct FStepUpdateOutput* bpp__Output__pf);
	void SetDirectSpeed(bool bpp__IsDirectSpeed__pf, const struct FVector& bpp__DirectSpeedWorldVector__pf, bool* bpp__return__pf);
	void UpdatePostStepProcee();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Step_GroundRoot_New_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Step_GroundRoot_New_C")
	}
	static class UStep_GroundRoot_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStep_GroundRoot_New_C>();
	}
};
DUMPER7_ASSERTS_UStep_GroundRoot_New_C;

}

