#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Step_PlayerRoot

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Step_PlayerRoot.Step_PlayerRoot_C.BeginShovelArmor
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_BeginShovelArmor final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_BeginShovelArmor;

// Function Step_PlayerRoot.Step_PlayerRoot_C.BeginShovelDown
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_BeginShovelDown final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_BeginShovelDown;

// Function Step_PlayerRoot.Step_PlayerRoot_C.EndShovelArmor
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_EndShovelArmor final
{
public:
	bool                                          bpp__Value__pf;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_EndShovelArmor;

// Function Step_PlayerRoot.Step_PlayerRoot_C.EndShovelDown
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_EndShovelDown final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_EndShovelDown;

// Function Step_PlayerRoot.Step_PlayerRoot_C.Exec_CaptureFromOuter
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_Exec_CaptureFromOuter final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_Exec_CaptureFromOuter;

// Function Step_PlayerRoot.Step_PlayerRoot_C.Exec_CaptureReleaseFromOuter
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_Exec_CaptureReleaseFromOuter final
{
public:
	bool                                          bpp__IsExec__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_Exec_CaptureReleaseFromOuter;

// Function Step_PlayerRoot.Step_PlayerRoot_C.ExecEventMove_0
// 0x000C (0x000C - 0x0000)
struct Step_PlayerRoot_C_ExecEventMove_0 final
{
public:
	struct FVector                                bpp__TargetPosition__pf;                           // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_ExecEventMove_0;

// Function Step_PlayerRoot.Step_PlayerRoot_C.ExecFromOuter_DamageBlast
// 0x0014 (0x0014 - 0x0000)
struct Step_PlayerRoot_C_ExecFromOuter_DamageBlast final
{
public:
	float                                         bpp__Distance__pf;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__Direction__pf;                                // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsExec__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_ExecFromOuter_DamageBlast;

// Function Step_PlayerRoot.Step_PlayerRoot_C.ExecuteUbergraph_Step_PlayerRoot_1
// 0x0004 (0x0004 - 0x0000)
struct Step_PlayerRoot_C_ExecuteUbergraph_Step_PlayerRoot_1 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_ExecuteUbergraph_Step_PlayerRoot_1;

// Function Step_PlayerRoot.Step_PlayerRoot_C.GetPlayerState
// 0x0002 (0x0002 - 0x0000)
struct Step_PlayerRoot_C_GetPlayerState final
{
public:
	EPBPlayerBit                                  bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_GetPlayerState;

// Function Step_PlayerRoot.Step_PlayerRoot_C.KeyOff
// 0x0002 (0x0002 - 0x0000)
struct Step_PlayerRoot_C_KeyOff final
{
public:
	EPBGameKey                                    bpp__Key__pf;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_KeyOff;

// Function Step_PlayerRoot.Step_PlayerRoot_C.KeyOn
// 0x0002 (0x0002 - 0x0000)
struct Step_PlayerRoot_C_KeyOn final
{
public:
	EPBGameKey                                    bpp__Key__pf;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_KeyOn;

// Function Step_PlayerRoot.Step_PlayerRoot_C.OnLoaded_C6C24E2A4D4E24F787BD0FAF9FE70E4A
// 0x0008 (0x0008 - 0x0000)
struct Step_PlayerRoot_C_OnLoaded_C6C24E2A4D4E24F787BD0FAF9FE70E4A final
{
public:
	class UClass*                                 bpp__Loaded__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_OnLoaded_C6C24E2A4D4E24F787BD0FAF9FE70E4A;

// Function Step_PlayerRoot.Step_PlayerRoot_C.SetEvent
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_SetEvent final
{
public:
	bool                                          bpp__IsEvent__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_SetEvent;

// Function Step_PlayerRoot.Step_PlayerRoot_C.SetPlayerState
// 0x0003 (0x0003 - 0x0000)
struct Step_PlayerRoot_C_SetPlayerState final
{
public:
	EPBPlayerBit                                  bpp__Type__pf;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Activate__pf;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__return__pf;                                   // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_SetPlayerState;

// Function Step_PlayerRoot.Step_PlayerRoot_C.ShovelArmor_Off
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_ShovelArmor_Off final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_ShovelArmor_Off;

// Function Step_PlayerRoot.Step_PlayerRoot_C.ShovelArmor_Spawn
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_ShovelArmor_Spawn final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_ShovelArmor_Spawn;

// Function Step_PlayerRoot.Step_PlayerRoot_C.ShovelOff
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_ShovelOff final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_ShovelOff;

// Function Step_PlayerRoot.Step_PlayerRoot_C.ShovelOn
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_ShovelOn final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_ShovelOn;

// Function Step_PlayerRoot.Step_PlayerRoot_C.SpawnBullet
// 0x0030 (0x0030 - 0x0000)
struct Step_PlayerRoot_C_SpawnBullet final
{
public:
	class FName                                   bpp__BulletID__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                bpp__SpawnWorldLocation__pf;                       // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBulletDirection                              bpp__DirectionType__pf;                            // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECarriedCatalog                               bpp__SpawnerType__pf;                              // 0x0015(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsOverRoom__pf;                               // 0x0016(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsCopyCategoryPause__pf;                      // 0x0017(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsSpawn__pf;                                  // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APBBulletActor*                         bpp__BulletInstance__pf;                           // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 bpp__SubBulletInstance__pf;                        // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_SpawnBullet;

// Function Step_PlayerRoot.Step_PlayerRoot_C.UpdateEventBackStep
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_UpdateEventBackStep final
{
public:
	bool                                          bpp__IsFinish__pf;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_UpdateEventBackStep;

// Function Step_PlayerRoot.Step_PlayerRoot_C.UpdateEventMove
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_UpdateEventMove final
{
public:
	bool                                          bpp__IsReach__pf;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_UpdateEventMove;

// Function Step_PlayerRoot.Step_PlayerRoot_C.WeaponChangeCallback
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_WeaponChangeCallback final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_WeaponChangeCallback;

// Function Step_PlayerRoot.Step_PlayerRoot_C.WeaponDispOff
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_WeaponDispOff final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_WeaponDispOff;

// Function Step_PlayerRoot.Step_PlayerRoot_C.WeaponDispOn
// 0x0001 (0x0001 - 0x0000)
struct Step_PlayerRoot_C_WeaponDispOn final
{
public:
	bool                                          bpp__return__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Step_PlayerRoot_C_WeaponDispOn;

}

