#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Step_PlayerRoot

#include "Basic.hpp"

#include "ProjectBlood_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Step_GroundRoot_New_classes.hpp"


namespace SDK
{

// DynamicClass Step_PlayerRoot.Step_PlayerRoot_C
// 0x00A0 (0x0C38 - 0x0B98)
class UStep_PlayerRoot_C : public UStep_GroundRoot_New_C
{
public:
	uint8                                         Pad_B98[0x8];                                      // 0x0B98(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          IsEvent;                                           // 0x0BA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BA1[0x3];                                      // 0x0BA1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                EventTargetPosition;                               // 0x0BA4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBPlayerEventCondition                       EventCondition;                                    // 0x0BB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BB1[0x3];                                      // 0x0BB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InitialPosition;                                   // 0x0BB4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBackStepOnceFlag;                                // 0x0BC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDemo;                                            // 0x0BC1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsMoonWarpRequest;                                 // 0x0BC2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC3[0x1];                                      // 0x0BC3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MoonWarp_WarpLocation;                             // 0x0BC4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsChangeBunny;                                     // 0x0BD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BD1[0x3];                                      // 0x0BD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TotalMoney;                                        // 0x0BD4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PrevTotalMoney;                                    // 0x0BD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NotRecom_IsEventMove;                              // 0x0BDC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCaptured;                                        // 0x0BDD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBRMFinished;                                     // 0x0BDE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BDF[0x1];                                      // 0x0BDF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   BossRevengeWidget;                                 // 0x0BE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 K2Node_CustomEvent_Loaded;                         // 0x0C08(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 Temp_class_Variable;                               // 0x0C10(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 K2Node_ClassDynamicCast_AsPBUser_Widget;           // 0x0C18(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0C20(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C21[0x3];                                      // 0x0C21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;         // 0x0C24(0x0010)(ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C34[0x4];                                      // 0x0C34(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginShovelArmor(bool* bpp__Value__pf);
	void BeginShovelDown(bool* bpp__return__pf);
	void EndShovelArmor(bool* bpp__Value__pf);
	void EndShovelDown(bool* bpp__return__pf);
	void Exec_CaptureFromOuter(bool* bpp__IsExec__pf);
	void Exec_CaptureReleaseFromOuter(bool* bpp__IsExec__pf);
	void ExecEventBackStep();
	void ExecEventMove_0(const struct FVector& bpp__TargetPosition__pf);
	void ExecFromOuter_DamageBlast(float bpp__Distance__pf, const struct FVector& bpp__Direction__pf, bool* bpp__IsExec__pf);
	void ExecuteUbergraph_Step_PlayerRoot_1(int32 bpp__EntryPoint__pf);
	void FinishBossRevengeMode();
	void FinishBossRevengeModeEvent();
	void GetPlayerState(EPBPlayerBit bpp__Type__pf, bool* bpp__return__pf);
	void KeyOff(EPBGameKey bpp__Key__pf, bool* bpp__return__pf);
	void KeyOn(EPBGameKey bpp__Key__pf, bool* bpp__return__pf);
	void OnKillBossRevengeBoss();
	void OnLoaded_C6C24E2A4D4E24F787BD0FAF9FE70E4A(class UClass* bpp__Loaded__pf);
	void SetEvent(bool bpp__IsEvent__pf);
	void SetPlayerState(EPBPlayerBit bpp__Type__pf, bool bpp__Activate__pf, bool* bpp__return__pf);
	void SetRoomSetting();
	void ShovelArmor_Off(bool* bpp__return__pf);
	void ShovelArmor_Spawn(bool* bpp__return__pf);
	void ShovelOff(bool* bpp__return__pf);
	void ShovelOn(bool* bpp__return__pf);
	void SpawnBullet(class FName bpp__BulletID__pf, const struct FVector& bpp__SpawnWorldLocation__pf, EBulletDirection bpp__DirectionType__pf, ECarriedCatalog bpp__SpawnerType__pf, bool bpp__IsOverRoom__pf, bool bpp__IsCopyCategoryPause__pf, bool* bpp__IsSpawn__pf, class APBBulletActor** bpp__BulletInstance__pf, class AActor** bpp__SubBulletInstance__pf);
	void UpdateEventBackStep(bool* bpp__IsFinish__pf);
	void UpdateEventMain();
	void UpdateEventMove(bool* bpp__IsReach__pf);
	void WeaponChangeCallback(bool* bpp__return__pf);
	void WeaponDispOff(bool* bpp__return__pf);
	void WeaponDispOn(bool* bpp__return__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Step_PlayerRoot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Step_PlayerRoot_C")
	}
	static class UStep_PlayerRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStep_PlayerRoot_C>();
	}
};
DUMPER7_ASSERTS_UStep_PlayerRoot_C;

}

