#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeRecordListWindow_Archives

#include "Basic.hpp"


namespace SDK::Params
{

// Function TimeRecordListWindow_Archives.TimeRecordListWindow_Archives_C.ExecuteUbergraph_TimeRecordListWindow_Archives
// 0x0004 (0x0004 - 0x0000)
struct TimeRecordListWindow_Archives_C_ExecuteUbergraph_TimeRecordListWindow_Archives final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TimeRecordListWindow_Archives_C_ExecuteUbergraph_TimeRecordListWindow_Archives;

// Function TimeRecordListWindow_Archives.TimeRecordListWindow_Archives_C.Clean
// 0x0030 (0x0030 - 0x0000)
struct TimeRecordListWindow_Archives_C_Clean final
{
public:
	int32                                         idx;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UArchiveTimeAttackListItem_Archives_C*  Element;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArchiveTimeAttackListItem_Archives_C*  CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TimeRecordListWindow_Archives_C_Clean;

// Function TimeRecordListWindow_Archives.TimeRecordListWindow_Archives_C.AddList
// 0x0028 (0x0028 - 0x0000)
struct TimeRecordListWindow_Archives_C_AddList final
{
public:
	class UArchiveTimeAttackListItem_Archives_C*  Content;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UArchiveTimeAttackListItem_Archives_C*  AddItem;                                           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddWidght_output;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TimeRecordListWindow_Archives_C_AddList;

// Function TimeRecordListWindow_Archives.TimeRecordListWindow_Archives_C.GetList
// 0x0028 (0x0028 - 0x0000)
struct TimeRecordListWindow_Archives_C_GetList final
{
public:
	int32                                         Param_Index_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UArchiveTimeAttackListItem_Archives_C*  Output;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         idx;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UArchiveTimeAttackListItem_Archives_C*  CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetListIndex_NewParam;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TimeRecordListWindow_Archives_C_GetList;

// Function TimeRecordListWindow_Archives.TimeRecordListWindow_Archives_C.GetSelectList
// 0x0010 (0x0010 - 0x0000)
struct TimeRecordListWindow_Archives_C_GetSelectList final
{
public:
	class UArchiveTimeAttackListItem_Archives_C*  Output;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArchiveTimeAttackListItem_Archives_C*  CallFunc_GetList_Output;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TimeRecordListWindow_Archives_C_GetSelectList;

// Function TimeRecordListWindow_Archives.TimeRecordListWindow_Archives_C.MoveCursor
// 0x0028 (0x0028 - 0x0000)
struct TimeRecordListWindow_Archives_C_MoveCursor final
{
public:
	int32                                         MoveValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsListEmpty_IsEmpty;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UArchiveTimeAttackListItem_Archives_C*  CallFunc_GetSelectList_Output;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UArchiveTimeAttackListItem_Archives_C*  CallFunc_GetSelectList_Output1;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetScroll_ret;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TimeRecordListWindow_Archives_C_MoveCursor;

// Function TimeRecordListWindow_Archives.TimeRecordListWindow_Archives_C.RefreshScroll
// 0x0008 (0x0008 - 0x0000)
struct TimeRecordListWindow_Archives_C_RefreshScroll final
{
public:
	int32                                         input_offset;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Val;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TimeRecordListWindow_Archives_C_RefreshScroll;

// Function TimeRecordListWindow_Archives.TimeRecordListWindow_Archives_C.GetListIndex
// 0x0004 (0x0004 - 0x0000)
struct TimeRecordListWindow_Archives_C_GetListIndex final
{
public:
	int32                                         Param_Index_0;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TimeRecordListWindow_Archives_C_GetListIndex;

// Function TimeRecordListWindow_Archives.TimeRecordListWindow_Archives_C.IsMoveCursor
// 0x0004 (0x0004 - 0x0000)
struct TimeRecordListWindow_Archives_C_IsMoveCursor final
{
public:
	bool                                          is_true;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          is_enable;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TRUE_0;                                            // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNumOfListOver_is_over;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TimeRecordListWindow_Archives_C_IsMoveCursor;

// Function TimeRecordListWindow_Archives.TimeRecordListWindow_Archives_C.IsListEmpty
// 0x000C (0x000C - 0x0000)
struct TimeRecordListWindow_Archives_C_IsListEmpty final
{
public:
	bool                                          IsEmpty;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_TimeRecordListWindow_Archives_C_IsListEmpty;

}

