#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TitleLeaderBoardMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TitleLeaderBoardMenu.TitleLeaderBoardMenu_C
// 0x0078 (0x02D0 - 0x0258)
class UTitleLeaderBoardMenu_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear;                                            // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTitleMenuItem_C*                       Menu01;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTitleMenuItem_C*                       Menu02;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTitleMenuItem_C*                       Menu04;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTitleMenuItem_C*                       Menu07;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTitleMenuItem_C*                       Menu10;                                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MenuPanel;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Title;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTitleMenuItem_C*>               MenuLists;                                         // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Index_0;                                           // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LAST;                                              // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Top;                                               // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   EventExitMenu;                                     // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_TitleLeaderBoardMenu(int32 EntryPoint);
	void Construct();
	void Initialize();
	void Setup();
	void SetupMenu();
	void Clear();
	void Refresh();
	void AddMenu(class UTitleMenuItem_C* add_menu);
	void GetMenu(int32 Input, class UTitleMenuItem_C** Output);
	void GetSelectMenu(class UTitleMenuItem_C** Output);
	void MoveCursor(int32 Move);
	void ActivateMenu(class UTitleMenuItem_C* add_menu);
	void GetSelectMode(class FName* Mode);
	void InitializeCursorByLastGameMode();
	void GetIndexOfMenu(class UTitleMenuItem_C* TitleMenuItem, int32* menuIndex);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TitleLeaderBoardMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TitleLeaderBoardMenu_C")
	}
	static class UTitleLeaderBoardMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTitleLeaderBoardMenu_C>();
	}
};
DUMPER7_ASSERTS_UTitleLeaderBoardMenu_C;

}

