#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TwoButtonPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PopupParam_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass 2ButtonPopup.2ButtonPopup_C
// 0x0150 (0x03C8 - 0x0278)
class UTwoButtonPopup_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Close;                                             // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 back;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonPopupButton_C*                   Button01;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonPopupButton_C*                   Button02;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PopupText;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPopupParam                            Param;                                             // 0x02B8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UCommonPopupButton_C*>           Buttons;                                           // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Top;                                               // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LAST;                                              // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   text;                                              // 0x0310(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 DecideSE;                                          // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CancelSE;                                          // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   EventPopupOpend;                                   // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventPopupClosed;                                  // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Btn01Text;                                         // 0x0368(0x0018)(Edit, BlueprintVisible)
	class FText                                   Btn02Text;                                         // 0x0380(0x0018)(Edit, BlueprintVisible)
	UMulticastDelegateProperty_                   EventSelectButton1;                                // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventSelectButton2;                                // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   EventSelectCanceled;                               // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_2ButtonPopup(int32 EntryPoint);
	void OnPressedButton();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void WidgetAnimationEvt_close_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_open_K2Node_WidgetAnimationEvent_0();
	void Initialize();
	void Setup();
	void OnActive(int32* return_0);
	void GetButton(int32 Param_Index_0, class UCommonPopupButton_C** Output);
	void GetSelectButton(class UCommonPopupButton_C** Output);
	void MoveCursor(int32 Move);
	void GetPopupReturn(int32* Value);
	void ClosePopup();
	void OpenPopup();
	void SetButtonsText();
	void SetPopupParam(const class FText& input_text, const struct FPopupParam& input_param);
	void SetPopupText(const class FText& Input);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("2ButtonPopup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"2ButtonPopup_C")
	}
	static class UTwoButtonPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTwoButtonPopup_C>();
	}
};
DUMPER7_ASSERTS_UTwoButtonPopup_C;

}

