#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Dialogue

#include "Basic.hpp"

#include "Dialogue_TableItem_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_Dialogue.UI_Dialogue_C.AddNewContainer
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_C_AddNewContainer final
{
public:
	class UUI_Dialogue_TextContainer_C*           bpp__NewChild__pf;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_AddNewContainer;

// Function UI_Dialogue.UI_Dialogue_C.AddResponseItem
// 0x0028 (0x0028 - 0x0000)
struct UI_Dialogue_C_AddResponseItem final
{
public:
	class FName                                   bpp__Branch__pf;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__Host__pf;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                bpp__ResponseHandler__pf;                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__HiddenResponseOption__pf;                     // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Dialogue_ResponseItem_C*            bpp__Item__pf;                                     // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_AddResponseItem;

// Function UI_Dialogue.UI_Dialogue_C.AppendInlineImages
// 0x0010 (0x0010 - 0x0000)
struct UI_Dialogue_C_AppendInlineImages final
{
public:
	int32                                         bpp__CurrentItemIndex__pf;                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__HideUntilWordIndex__pf;                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUI_Dialogue_TextContainer_C*           bpp__CurrentContainer__pf;                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_AppendInlineImages;

// Function UI_Dialogue.UI_Dialogue_C.CreateDialogueItem
// 0x0018 (0x0018 - 0x0000)
struct UI_Dialogue_C_CreateDialogueItem final
{
public:
	class FString                                 bpp__Text__pf__const;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUI_Dialogue_TextItem_C*                bpp__Item__pf;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_CreateDialogueItem;

// Function UI_Dialogue.UI_Dialogue_C.ExecuteUbergraph_UI_Dialogue_0
// 0x0004 (0x0004 - 0x0000)
struct UI_Dialogue_C_ExecuteUbergraph_UI_Dialogue_0 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_ExecuteUbergraph_UI_Dialogue_0;

// Function UI_Dialogue.UI_Dialogue_C.ExecuteUbergraph_UI_Dialogue_4
// 0x0004 (0x0004 - 0x0000)
struct UI_Dialogue_C_ExecuteUbergraph_UI_Dialogue_4 final
{
public:
	int32                                         bpp__EntryPoint__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_ExecuteUbergraph_UI_Dialogue_4;

// Function UI_Dialogue.UI_Dialogue_C.ExtractInlineScript
// 0x0018 (0x0018 - 0x0000)
struct UI_Dialogue_C_ExtractInlineScript final
{
public:
	class FString                                 bpp__SourceString__pf;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__TotalCharactersProcessed__pf;                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UI_Dialogue_C_ExtractInlineScript;

// Function UI_Dialogue.UI_Dialogue_C.ExtractTextPartition
// 0x0030 (0x0030 - 0x0000)
struct UI_Dialogue_C_ExtractTextPartition final
{
public:
	class FString                                 bpp__FullText__pf__const;                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__Partition__pf;                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 bpp__Result__pf;                                   // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__IsLastPartition__pf;                          // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UI_Dialogue_C_ExtractTextPartition;

// Function UI_Dialogue.UI_Dialogue_C.GetControl_ClickToContinueNotification
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_C_GetControl_ClickToContinueNotification final
{
public:
	class UImage*                                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_GetControl_ClickToContinueNotification;

// Function UI_Dialogue.UI_Dialogue_C.GetControl_ClickZone
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_C_GetControl_ClickZone final
{
public:
	class UImage*                                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_GetControl_ClickZone;

// Function UI_Dialogue.UI_Dialogue_C.GetControl_ResponseContainer
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_C_GetControl_ResponseContainer final
{
public:
	class UPanelWidget*                           ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_GetControl_ResponseContainer;

// Function UI_Dialogue.UI_Dialogue_C.GetControl_SpeakerName
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_C_GetControl_SpeakerName final
{
public:
	class UTextBlock*                             bpp__Control__pf;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_GetControl_SpeakerName;

// Function UI_Dialogue.UI_Dialogue_C.GetControl_SpeakerPortrait
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_C_GetControl_SpeakerPortrait final
{
public:
	class UImage*                                 bpp__Control__pf;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_GetControl_SpeakerPortrait;

// Function UI_Dialogue.UI_Dialogue_C.GetControl_TextAreaVerticalBox
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_C_GetControl_TextAreaVerticalBox final
{
public:
	class UVerticalBox*                           ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_GetControl_TextAreaVerticalBox;

// Function UI_Dialogue.UI_Dialogue_C.GetControl_TextScrollBox
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_C_GetControl_TextScrollBox final
{
public:
	class UScrollBox*                             bpp__Control__pf;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_GetControl_TextScrollBox;

// Function UI_Dialogue.UI_Dialogue_C.GetCurrentColour
// 0x0010 (0x0010 - 0x0000)
struct UI_Dialogue_C_GetCurrentColour final
{
public:
	struct FLinearColor                           bpp__Colour__pf;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_GetCurrentColour;

// Function UI_Dialogue.UI_Dialogue_C.GetCurrentTypewriterDelay
// 0x0004 (0x0004 - 0x0000)
struct UI_Dialogue_C_GetCurrentTypewriterDelay final
{
public:
	float                                         bpp__Delay__pf;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_GetCurrentTypewriterDelay;

// Function UI_Dialogue.UI_Dialogue_C.GetCurrentVibrationSettings
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_C_GetCurrentVibrationSettings final
{
public:
	float                                         bpp__Strength__pf;                                 // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         bpp__Speed__pf;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_GetCurrentVibrationSettings;

// Function UI_Dialogue.UI_Dialogue_C.HasVisibleResponses
// 0x0001 (0x0001 - 0x0000)
struct UI_Dialogue_C_HasVisibleResponses final
{
public:
	bool                                          bpp__Result__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_HasVisibleResponses;

// Function UI_Dialogue.UI_Dialogue_C.IncrementGamepadHighlightedResponse
// 0x0004 (0x0004 - 0x0000)
struct UI_Dialogue_C_IncrementGamepadHighlightedResponse final
{
public:
	int32                                         bpp__Amount__pf;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_IncrementGamepadHighlightedResponse;

// Function UI_Dialogue.UI_Dialogue_C.InitializeNextTextItem
// 0x0004 (0x0004 - 0x0000)
struct UI_Dialogue_C_InitializeNextTextItem final
{
public:
	float                                         bpp__StartingLifetime__pf;                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_InitializeNextTextItem;

// Function UI_Dialogue.UI_Dialogue_C.IsEndTag
// 0x0018 (0x0018 - 0x0000)
struct UI_Dialogue_C_IsEndTag final
{
public:
	class FString                                 bpp__TagText__pf__const;                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__Result__pf;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UI_Dialogue_C_IsEndTag;

// Function UI_Dialogue.UI_Dialogue_C.IsTypewriterDone
// 0x0001 (0x0001 - 0x0000)
struct UI_Dialogue_C_IsTypewriterDone final
{
public:
	bool                                          bpp__ReturnxValue__pfT;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_IsTypewriterDone;

// Function UI_Dialogue.UI_Dialogue_C.ItemAdded
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_C_ItemAdded final
{
public:
	class UUI_Dialogue_TextItem_C*                bpp__Item__pf;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_ItemAdded;

// Function UI_Dialogue.UI_Dialogue_C.On_imgClickZone_MouseButtonDown_0
// 0x0160 (0x0160 - 0x0000)
struct UI_Dialogue_C_On_imgClickZone_MouseButtonDown_0 final
{
public:
	struct FGeometry                              bpp__MyGeometry__pf;                               // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          bpp__MouseEvent__pf__const;                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_On_imgClickZone_MouseButtonDown_0;

// Function UI_Dialogue.UI_Dialogue_C.OnCharacterDisplayedChanging
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_C_OnCharacterDisplayedChanging final
{
public:
	int32                                         bpp__NewCharacterCount__pf;                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__PreviousCharacterCount__pf;                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_OnCharacterDisplayedChanging;

// Function UI_Dialogue.UI_Dialogue_C.OnClickZone_Clicked
// 0x0001 (0x0001 - 0x0000)
struct UI_Dialogue_C_OnClickZone_Clicked final
{
public:
	bool                                          bpp__Failed__pf;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_OnClickZone_Clicked;

// Function UI_Dialogue.UI_Dialogue_C.OnTypewriterItemComplete
// 0x0004 (0x0004 - 0x0000)
struct UI_Dialogue_C_OnTypewriterItemComplete final
{
public:
	float                                         bpp__ExcessTime__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_OnTypewriterItemComplete;

// Function UI_Dialogue.UI_Dialogue_C.ParseColourTag
// 0x0018 (0x0018 - 0x0000)
struct UI_Dialogue_C_ParseColourTag final
{
public:
	class FString                                 bpp__LoweredText__pf__const;                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__OptionStart__pf;                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UI_Dialogue_C_ParseColourTag;

// Function UI_Dialogue.UI_Dialogue_C.ParseFloatTag
// 0x0028 (0x0028 - 0x0000)
struct UI_Dialogue_C_ParseFloatTag final
{
public:
	class FString                                 bpp__LoweredText__pf__const;                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__OptionStart__pf;                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 bpp__Stack__pf;                                    // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_ParseFloatTag;

// Function UI_Dialogue.UI_Dialogue_C.ParseImageTag
// 0x0040 (0x0040 - 0x0000)
struct UI_Dialogue_C_ParseImageTag final
{
public:
	class FString                                 bpp__LoweredText__pf__const;                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__OptionStart__pf;                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           bpp__ImageStack__pf;                               // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 bpp__ItemIndexStack__pf;                           // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         bpp__CurrentItemIndex__pf;                         // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UI_Dialogue_C_ParseImageTag;

// Function UI_Dialogue.UI_Dialogue_C.ParseOptionTag
// 0x0018 (0x0018 - 0x0000)
struct UI_Dialogue_C_ParseOptionTag final
{
public:
	class FString                                 bpp__OptionText__pf__const;                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__CurrentItemIndex__pf;                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UI_Dialogue_C_ParseOptionTag;

// Function UI_Dialogue.UI_Dialogue_C.ParseTextForOptions
// 0x0010 (0x0010 - 0x0000)
struct UI_Dialogue_C_ParseTextForOptions final
{
public:
	class FString                                 bpp__Text__pf__const;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_ParseTextForOptions;

// Function UI_Dialogue.UI_Dialogue_C.SelectResponse
// 0x0004 (0x0004 - 0x0000)
struct UI_Dialogue_C_SelectResponse final
{
public:
	int32                                         bpp__Index__pf;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_SelectResponse;

// Function UI_Dialogue.UI_Dialogue_C.SetDialogueTableItem
// 0x00B0 (0x00B0 - 0x0000)
struct UI_Dialogue_C_SetDialogueTableItem final
{
public:
	struct FDialogue_TableItem                    bpp__TableItem__pf;                                // 0x0000(0x0090)(Parm, OutParm, NativeAccessSpecifierPublic)
	class UObject*                                bpp__ResponseHandler__pf;                          // 0x0090(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABP_ScriptInterpreter_C*                bpp__ScriptxInterpreter__pfT;                      // 0x0098(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   bpp__BranchName__pf;                               // 0x00A0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         bpp__PartNumber__pf;                               // 0x00A8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UI_Dialogue_C_SetDialogueTableItem;

// Function UI_Dialogue.UI_Dialogue_C.SetSpeakerAttributes
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_C_SetSpeakerAttributes final
{
public:
	class FName                                   bpp__SpeakerID__pf;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_SetSpeakerAttributes;

// Function UI_Dialogue.UI_Dialogue_C.SetSpeakerName
// 0x0018 (0x0018 - 0x0000)
struct UI_Dialogue_C_SetSpeakerName final
{
public:
	class FText                                   bpp__Text__pf__const;                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_SetSpeakerName;

// Function UI_Dialogue.UI_Dialogue_C.SetSpeakerPortrait
// 0x0010 (0x0010 - 0x0000)
struct UI_Dialogue_C_SetSpeakerPortrait final
{
public:
	class UObject*                                bpp__Portrait__pf;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bpp__ReplaceExisting__pf;                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UI_Dialogue_C_SetSpeakerPortrait;

// Function UI_Dialogue.UI_Dialogue_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct UI_Dialogue_C_SetText final
{
public:
	class FString                                 bpp__Text__pf__const;                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_SetText;

// Function UI_Dialogue.UI_Dialogue_C.ShowClickToContinue
// 0x0001 (0x0001 - 0x0000)
struct UI_Dialogue_C_ShowClickToContinue final
{
public:
	bool                                          bpp__Visible__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_ShowClickToContinue;

// Function UI_Dialogue.UI_Dialogue_C.ShowClickZone
// 0x0001 (0x0001 - 0x0000)
struct UI_Dialogue_C_ShowClickZone final
{
public:
	bool                                          bpp__Visible__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_ShowClickZone;

// Function UI_Dialogue.UI_Dialogue_C.ShowResponses
// 0x0001 (0x0001 - 0x0000)
struct UI_Dialogue_C_ShowResponses final
{
public:
	bool                                          bpp__Visible__pf;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_ShowResponses;

// Function UI_Dialogue.UI_Dialogue_C.Split Item by Word
// 0x0018 (0x0018 - 0x0000)
struct UI_Dialogue_C_Split_Item_by_Word final
{
public:
	class UUI_Dialogue_TextItem_C*                bpp__Item__pf;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UUI_Dialogue_TextItem_C*>        bpp__ByWord__pf;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_Split_Item_by_Word;

// Function UI_Dialogue.UI_Dialogue_C.StartFadeOutAudio
// 0x0004 (0x0004 - 0x0000)
struct UI_Dialogue_C_StartFadeOutAudio final
{
public:
	float                                         bpp__TimeToFade__pf;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_StartFadeOutAudio;

// Function UI_Dialogue.UI_Dialogue_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_Dialogue_C_Tick final
{
public:
	struct FGeometry                              bpp__MyGeometry__pf;                               // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         bpp__InDeltaTime__pf;                              // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_C_Tick;

}

