#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Dialogue_TextItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_Dialogue_TextItem.UI_Dialogue_TextItem_C.Clone
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_TextItem_C_Clone final
{
public:
	class UUI_Dialogue_TextItem_C*                bpp__ClonedItem__pf;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_TextItem_C_Clone;

// Function UI_Dialogue_TextItem.UI_Dialogue_TextItem_C.GetInvisibleText
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_TextItem_C_GetInvisibleText final
{
public:
	class UWidget*                                bpp__NewParam__pf;                                 // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_TextItem_C_GetInvisibleText;

// Function UI_Dialogue_TextItem.UI_Dialogue_TextItem_C.GetTextControl
// 0x0008 (0x0008 - 0x0000)
struct UI_Dialogue_TextItem_C_GetTextControl final
{
public:
	class UTextBlock*                             bpp__Control__pf;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_TextItem_C_GetTextControl;

// Function UI_Dialogue_TextItem.UI_Dialogue_TextItem_C.Initialize
// 0x0004 (0x0004 - 0x0000)
struct UI_Dialogue_TextItem_C_Initialize final
{
public:
	float                                         bpp__StartingLifetime__pf;                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_TextItem_C_Initialize;

// Function UI_Dialogue_TextItem.UI_Dialogue_TextItem_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_Dialogue_TextItem_C_Tick final
{
public:
	struct FGeometry                              bpp__MyGeometry__pf;                               // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         bpp__InDeltaTime__pf;                              // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UI_Dialogue_TextItem_C_Tick;

}

