#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Dialogue_ResponseItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// DynamicClass UI_Dialogue_ResponseItem.UI_Dialogue_ResponseItem_C
// 0x0118 (0x0348 - 0x0230)
class UUI_Dialogue_ResponseItem_C final : public UUserWidget
{
public:
	class UButton*                                btnResponse;                                       // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 imgDecor;                                          // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             lblText;                                           // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResponseIdx;                                       // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ResponseHandler;                                   // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BranchName;                                        // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                BranchHost;                                        // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HiddenResponseOption;                              // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            NormalStyle;                                       // 0x0270(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          Highlighted;                                       // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   HighlightStateChanged;                             // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   SelectedStateChanged;                              // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	bool                                          Selected;                                          // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                NormalStylePadding;                                // 0x0324(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CallFunc_GetLabel_lblText;                         // 0x0338(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                CallFunc_GetButton_btnResponse;                    // 0x0340(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void BndEvt__btnResponse_K2Node_ComponentBoundEvent_42_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void DoRespond();
	void GetButton(class UButton** bpp__btnResponse__pf);
	void GetLabel(class UTextBlock** bpp__lblText__pf);
	void Initialize(class FName bpp__BranchName__pf, class UObject* bpp__BranchHost__pf, class UObject* bpp__ResponseHandler__pf, bool bpp__HiddenResponse__pf, const class FText& bpp__Text__pf__const);
	void SetHighlighted(bool bpp__Highlighted__pf);
	void SetSelected(bool bpp__Selected__pf);
	void UpdateStyle(float bpp__Delta__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UI_Dialogue_ResponseItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Dialogue_ResponseItem_C")
	}
	static class UUI_Dialogue_ResponseItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Dialogue_ResponseItem_C>();
	}
};
DUMPER7_ASSERTS_UUI_Dialogue_ResponseItem_C;

}

