#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_UpButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UMG_UpButton.UMG_UpButton_C.GetBrush_0
// 0x0088 (0x0088 - 0x0000)
struct UMG_UpButton_C_GetBrush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UMG_UpButton_C_GetBrush_0;

// Function UMG_UpButton.UMG_UpButton_C.GetOwnerCharacter
// 0x0008 (0x0008 - 0x0000)
struct UMG_UpButton_C_GetOwnerCharacter final
{
public:
	class APBBaseCharacter*                       bpp__ValidCharacter__pf;                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UMG_UpButton_C_GetOwnerCharacter;

// Function UMG_UpButton.UMG_UpButton_C.GetScreenLocation
// 0x0008 (0x0008 - 0x0000)
struct UMG_UpButton_C_GetScreenLocation final
{
public:
	struct FVector2D                              bpp__ScreenPosition__pf;                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UMG_UpButton_C_GetScreenLocation;

// Function UMG_UpButton.UMG_UpButton_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_UpButton_C_Tick final
{
public:
	struct FGeometry                              bpp__MyGeometry__pf;                               // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         bpp__InDeltaTime__pf;                              // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UMG_UpButton_C_Tick;

}

