#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PBCConfirmDeletePopup

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PBCConfirmDeletePopup.WBP_PBCConfirmDeletePopup_C.ExecuteUbergraph_WBP_PBCConfirmDeletePopup
// 0x0010 (0x0010 - 0x0000)
struct WBP_PBCConfirmDeletePopup_C_ExecuteUbergraph_WBP_PBCConfirmDeletePopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBCNavigableUI*                        CallFunc_GetCurrUI_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PBCConfirmDeletePopup_C_ExecuteUbergraph_WBP_PBCConfirmDeletePopup;

// Function WBP_PBCConfirmDeletePopup.WBP_PBCConfirmDeletePopup_C.Setup
// 0x0070 (0x0070 - 0x0000)
struct WBP_PBCConfirmDeletePopup_C_Setup final
{
public:
	class UPBCNavigableUIElement_SaveSlot*        SaveSlot;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_FindTextInLocalizationTable_OutText;      // 0x0008(0x0018)()
	bool                                          CallFunc_FindTextInLocalizationTable_ReturnValue;  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
};
DUMPER7_ASSERTS_WBP_PBCConfirmDeletePopup_C_Setup;

// Function WBP_PBCConfirmDeletePopup.WBP_PBCConfirmDeletePopup_C.OnDoDelete
// 0x0028 (0x0028 - 0x0000)
struct WBP_PBCConfirmDeletePopup_C_OnDoDelete final
{
public:
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPBGameInstance*                        K2Node_DynamicCast_AsPBGame_Instance;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBSaveManager*                         CallFunc_GetSaveManager_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DeleteClassicSaveGameFileFromDisk_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_PBCConfirmDeletePopup_C_OnDoDelete;

}

