#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PBCNavigableElem_Select

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PBCNavigableElem_Select.WBP_PBCNavigableElem_Select_C.ExecuteUbergraph_WBP_PBCNavigableElem_Select
// 0x000C (0x000C - 0x0000)
struct WBP_PBCNavigableElem_Select_C_ExecuteUbergraph_WBP_PBCNavigableElem_Select final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySFX_ReturnValue;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_PBCNavigableElem_Select_C_ExecuteUbergraph_WBP_PBCNavigableElem_Select;

// Function WBP_PBCNavigableElem_Select.WBP_PBCNavigableElem_Select_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PBCNavigableElem_Select_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_PBCNavigableElem_Select_C_PreConstruct;

// Function WBP_PBCNavigableElem_Select.WBP_PBCNavigableElem_Select_C.SetTextTextureActive
// 0x0002 (0x0002 - 0x0000)
struct WBP_PBCNavigableElem_Select_C_SetTextTextureActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_PBCNavigableElem_Select_C_SetTextTextureActive;

}

