#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PBCFileSelect

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PBCFileSelect.WBP_PBCFileSelect_C.ExecuteUbergraph_WBP_PBCFileSelect
// 0x0020 (0x0020 - 0x0000)
struct WBP_PBCFileSelect_C_ExecuteUbergraph_WBP_PBCFileSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_PBCFade_C*>                  CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class UBP_PBCFade_C*                          CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PBCFileSelect_C_ExecuteUbergraph_WBP_PBCFileSelect;

// Function WBP_PBCFileSelect.WBP_PBCFileSelect_C.ShowDeleteConfirmation
// 0x0018 (0x0018 - 0x0000)
struct WBP_PBCFileSelect_C_ShowDeleteConfirmation final
{
public:
	class UPBCNavigableUIElement_SaveSlot*        SaveSlotObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_PBCConfirmDeletePopup_C*           CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_PBCFileSelect_C_ShowDeleteConfirmation;

}

