#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PBCFileSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PBCFileSelect.WBP_PBCFileSelect_C
// 0x0038 (0x02C0 - 0x0288)
class UWBP_PBCFileSelect_C final : public UPBCNavigableUI_FileSelect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Bg;                                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PBCFooter_C*                       WBP_PBCFooter;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PBCSaveSlot_C*                     WBP_PBCSaveSlot;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PBCSaveSlot_C*                     WBP_PBCSaveSlot_0;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PBCSaveSlot_C*                     WBP_PBCSaveSlot_1;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PBCConfirmDeletePopup_C*           ConfirmDeletePopup;                                // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PBCFileSelect(int32 EntryPoint);
	void Destruct();
	void OnHideUI();
	void OnShowUI();
	void OnPressBack();
	void Construct();
	void ShowDeleteConfirmation(class UPBCNavigableUIElement_SaveSlot* SaveSlotObject);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_PBCFileSelect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_PBCFileSelect_C")
	}
	static class UWBP_PBCFileSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PBCFileSelect_C>();
	}
};
DUMPER7_ASSERTS_UWBP_PBCFileSelect_C;

}

