#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Widget_MultiplayerCharacterSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Widget_MultiplayerCharacterSelect.Widget_MultiplayerCharacterSelect_C
// 0x0088 (0x0300 - 0x0278)
class UWidget_MultiplayerCharacterSelect_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidget_CharacterSelect_C*              CharacterSelect_P1;                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget_CharacterSelect_C*              CharacterSelect_P2;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CharacterSelectCanvas;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonControllGuide_C*                 ControlGuideP1;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonControllGuide_C*                 ControlGuideP1Only;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonControllGuide_C*                 ControlGuideP2;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuBg_C*                              MenuBg;                                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonMenuHeader_C*                    MenuHeader;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget_2ndControllerConfirm_C*         SecondControllerConfirm;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   CloseMenuEvent;                                    // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   SelectionFinishedEvent;                            // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          OnePlayer;                                         // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsVersusMode;                                      // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonControllGuide_C*                 CurrentP1ControlGuide;                             // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonMsgPopup_C*                      MsgPopup;                                          // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Widget_MultiplayerCharacterSelect(int32 EntryPoint);
	void MsgPopupClosed();
	void TryToUseMissingDLC();
	void AcceptedOnline();
	void OnShow();
	void OnCustomizeEnd(int32 Player01);
	void OnLoadoutCancel(int32 Player01);
	void OnLoadoutOpened(int32 Player01);
	void OnCustomizeBegin(int32 Player01);
	void PreConstruct(bool IsDesignTime);
	void GoForward(int32 Player);
	void GoBack(int32 Player);
	void Construct();
	void RemoveSecondPlayer();
	void AddSecondPlayer();
	void PauseMenu(bool Pause);
	void UpdateControlGuide(class FName ButtonY, bool IsAllowBack, class UCommonControllGuide_C* ControlGuide);
	void ReInitModels();
	void UpdateHeaderText(bool Loadout_Text);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Widget_MultiplayerCharacterSelect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Widget_MultiplayerCharacterSelect_C")
	}
	static class UWidget_MultiplayerCharacterSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidget_MultiplayerCharacterSelect_C>();
	}
};
DUMPER7_ASSERTS_UWidget_MultiplayerCharacterSelect_C;

}

