#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Widget_ChaosShardPickup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Widget_ChaosShardPickup.Widget_ChaosShardPickup_C
// 0x00B8 (0x0330 - 0x0278)
class UWidget_ChaosShardPickup_C final : public UPBUserWidgetPauseMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidget_ChaosItemSwap_C*                P1SwapInfo;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget_ChaosItemSwap_C*                P2SwapInfo;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget_ChaosTreasureUpButton_C*        Player1Notify;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidget_ChaosTreasureUpButton_C*        Player2Notify;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   Player1PickUpShard;                                // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   Player2PickUpShard;                                // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          P1AlreadyTraded;                                   // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          P2AlreadyTraded;                                   // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C2[0x2];                                      // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SwapItem;                                          // 0x02C4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarriedCatalog                               SwapItemType;                                      // 0x02CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NextPlayer1Shard;                                  // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NextPlayer2Shard;                                  // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   NextPlayer1NotifyText;                             // 0x02E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   NextPlayer2NotifyText;                             // 0x02F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	UMulticastDelegateProperty_                   Player1CancelShard;                                // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   Player2CancelShard;                                // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_Widget_ChaosShardPickup(int32 EntryPoint);
	void DeclineSwapP2();
	void AcceptSwapP2();
	void BindEventP2(class UWidget_ChaosItemSwap_C* SwapPopup);
	void DeclineSwapP1();
	void AcceptSwapP1();
	void BindEventP1(class UWidget_ChaosItemSwap_C* SwapPopup);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void HidePlayer1Notify();
	void HidePlayer2Notify();
	void ShowPlayer1Notify(const class FText& text);
	void ShowPlayer2Notify(const class FText& text);
	void UpdateSwapInfo(bool Player1);
	void CheckSwap(bool Player1);
	void AcceptShard(bool Player1);
	void SetItemData(class FName ItemName, ECarriedCatalog ItemType);
	void IsOpeningChest(int32 Player, bool* IsOver, bool* IsOpening);
	void CheckEquipInput(int32 Player, bool* return_0);
	void FinishSwap(class UWidget_ChaosItemSwap_C* Widget);
	void IsPlayer1ShowingSwap(bool* return_0);
	void IsPlayer2ShowingSwap(bool* return_0);
	void SetPlayer1NextShardInfo(class FName NextShard, const class FText& NextText);
	void SetPlayer2NextShardInfo(class FName NextShard, const class FText& NextText);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Widget_ChaosShardPickup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Widget_ChaosShardPickup_C")
	}
	static class UWidget_ChaosShardPickup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidget_ChaosShardPickup_C>();
	}
};
DUMPER7_ASSERTS_UWidget_ChaosShardPickup_C;

}

