#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Widget_ChaosEquipSetWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EquipSetWindow_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Widget_ChaosEquipSetWindow.Widget_ChaosEquipSetWindow_C
// 0x0040 (0x0300 - 0x02C0)
class UWidget_ChaosEquipSetWindow_C final : public UEquipSetWindow_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Widget_ChaosEquipSetWindow_C;       // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 frame;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipSet_C*                            SetBody_Chaos;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipSet_C*                            SetBullet_Chaos;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipSet_C*                            SetDirectionalShard_Chaos;                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipSet_C*                            SetEffectiveShard_Chaos;                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipSet_C*                            SetTriggerShard_Chaos;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipSet_C*                            SetWeapon_Chaos;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Widget_ChaosEquipSetWindow(int32 EntryPoint);
	void Initialize();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Widget_ChaosEquipSetWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Widget_ChaosEquipSetWindow_C")
	}
	static class UWidget_ChaosEquipSetWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidget_ChaosEquipSetWindow_C>();
	}
};
DUMPER7_ASSERTS_UWidget_ChaosEquipSetWindow_C;

}

