#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wirdget_Chaos_Completed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectBlood_structs.hpp"
#include "ProjectBlood_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Wirdget_Chaos_Completed.Wirdget_Chaos_Completed_C
// 0x0070 (0x02C8 - 0x0258)
class UWirdget_Chaos_Completed_C final : public UPBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOneButtonPopup_C*                      OneButtonPopup;                                    // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OnlineWaitMsgWaitingforo;                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TimeTextField;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     TextBlocks;                                        // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UChaosModeLogic*                        ChaosModeLogic;                                    // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayerTime;                                        // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 HoursQuantity;                                     // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 MinuteQuantity;                                    // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 SecondQuantity;                                    // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Wirdget_Chaos_Completed(int32 EntryPoint);
	void Destruct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnPressedButton();
	void Construct();
	void EventPopupClosed();
	void EventPopupOpened();
	void SetupEvent();
	void SetupPopup();
	void Initialize();
	void SetupEvents();
	void OpenMenu(EUserWidgetPriority Priority_0);
	void CloseMenu();
	void BackToTitle();
	void OnSelect();
	void PauseGame();
	void SetPopupText();
	void CalculateTimeDisplay();
	void CreateResultsWidget();
	void OnWait();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Wirdget_Chaos_Completed_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Wirdget_Chaos_Completed_C")
	}
	static class UWirdget_Chaos_Completed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWirdget_Chaos_Completed_C>();
	}
};
DUMPER7_ASSERTS_UWirdget_Chaos_Completed_C;

}

